
#include <string.h>
#include <fapi/sys_services.h>
#include <fapi/reg_dma.h>
#include <fapi/drv_dma.h>
#include <fapi/drv_usb.h>
#include "musb/usb_ch9.h"
#include "musb/musbhdrc.h"
#include "musb/musbdefs.h"
#include "musb/list_49cd8c.h"
#include "musb/musb_dma.h"
#include "musb/musb.h"


extern uint8_t MGC_Read8(uint8_t* baseAddr, uint16_t offset);
extern uint16_t MGC_Read16(uint8_t* baseAddr, uint16_t offset);
extern void MGC_Write8(uint8_t* baseAddr, uint16_t offset, uint8_t);
extern MUSB_Array* MUSB_ArrayInit(MUSB_Array* pArray,
   uint16_t wItemSize, uint16_t wStaticItemCount, void* pStaticBuffer);
extern uint8_t MUSB_ArrayAppend(MUSB_Array* pArray, void* pItem);


/* 21cc8000 - complete */
uint8_t MGC_DrcInit(MGC_Port* pPort/*fp128*/) /*120*/
{
    uint8_t bEnd; /*fp26*/
    MGC_EndpointResource end; /*fp124*/ /*123*/
    uint8_t bFifoSize; /*fp25*/
    MGC_Controller* pImplController = pPort->pController; /*fp24*/
    uint8_t* pBase = pImplController->pControllerAddressIst; /*fp20*/
    uint8_t bOk = 0; /*fp13*/

   /* At least Endpoint 0 */
   pPort->bEndCount = 1;
   pPort->wEndMask = (1 << 0);

   for (bEnd = 1; bEnd < MUSB_C_NUM_EPS; bEnd++)
   {
      MGC_SelectEnd(pBase, bEnd);

      bFifoSize = MGC_ReadCsr8(pBase, MGC_O_HDRC_FIFOSIZE, bEnd);

      if (bFifoSize == 0)
      {
         /* 0's returned when no more endpoints */
         break;
      }

      pPort->bEndCount++;
      pPort->wEndMask |= (1 << bEnd);
   }


   46      DW_TAG_variable    [no children]
    DW_AT_name         DW_FORM_string
    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data2
    DW_AT_type         DW_FORM_ref4
    DW_AT_external     DW_FORM_flag
    DW_AT_declaration  DW_FORM_flag

The section .debug_info contains:

  Compilation Unit @ offset 0x0:
   Length:        22300
   Version:       2
   Abbrev Offset: 0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
  < c>     DW_AT_producer    : GNU C 4.2.2
  <18>     DW_AT_language    : 1    (ANSI C)
  <19>     DW_AT_name        : ../cd/mu_drc.c
  <28>     DW_AT_comp_dir    : /cygdrive/d/PROJECTS/MB86H60/software/HDTV_branch/subsystems/bus/musb/src/systems
  <7a>     DW_AT_low_pc      : 0
  <7e>     DW_AT_high_pc     : 0x427c
  <82>     DW_AT_stmt_list   : 0
 <1><86>: Abbrev Number: 2 (DW_TAG_typedef)
  <87>     DW_AT_name        : size_t
  <8e>     DW_AT_decl_file   : 2
  <8f>     DW_AT_decl_line   : 214
  <90>     DW_AT_type        : <94>
 <1><94>: Abbrev Number: 3 (DW_TAG_base_type)
  <95>     DW_AT_byte_size   : 4
  <96>     DW_AT_encoding    : 7    (unsigned)
  <97>     DW_AT_name        : long unsigned int
 <1><a9>: Abbrev Number: 3 (DW_TAG_base_type)
  <aa>     DW_AT_byte_size   : 4
  <ab>     DW_AT_encoding    : 5    (signed)
  <ac>     DW_AT_name        : int
 <1><b0>: Abbrev Number: 3 (DW_TAG_base_type)
  <b1>     DW_AT_byte_size   : 4
  <b2>     DW_AT_encoding    : 5    (signed)
  <b3>     DW_AT_name        : long int
 <1><bc>: Abbrev Number: 3 (DW_TAG_base_type)
  <bd>     DW_AT_byte_size   : 8
  <be>     DW_AT_encoding    : 5    (signed)
  <bf>     DW_AT_name        : long long int
 <1><cd>: Abbrev Number: 3 (DW_TAG_base_type)
  <ce>     DW_AT_byte_size   : 4
  <cf>     DW_AT_encoding    : 7    (unsigned)
  <d0>     DW_AT_name        : unsigned int
 <1><dd>: Abbrev Number: 4 (DW_TAG_base_type)
  <de>     DW_AT_byte_size   : 4
  <df>     DW_AT_encoding    : 7    (unsigned)
 <1><e0>: Abbrev Number: 3 (DW_TAG_base_type)
  <e1>     DW_AT_byte_size   : 1
  <e2>     DW_AT_encoding    : 8    (unsigned char)
  <e3>     DW_AT_name        : unsigned char
 <1><f1>: Abbrev Number: 5 (DW_TAG_pointer_type)
  <f2>     DW_AT_byte_size   : 4
 <1><f3>: Abbrev Number: 6 (DW_TAG_subroutine_type)
  <f4>     DW_AT_prototyped  : 1
 <1><f5>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <f6>     DW_AT_byte_size   : 4
  <f7>     DW_AT_type        : <f3>
 <1><fb>: Abbrev Number: 3 (DW_TAG_base_type)
  <fc>     DW_AT_byte_size   : 2
  <fd>     DW_AT_encoding    : 5    (signed)
  <fe>     DW_AT_name        : short int
 <1><108>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <109>     DW_AT_byte_size   : 4
  <10a>     DW_AT_type        : <10e>
 <1><10e>: Abbrev Number: 3 (DW_TAG_base_type)
  <10f>     DW_AT_byte_size   : 1
  <110>     DW_AT_encoding    : 8   (unsigned char)
  <111>     DW_AT_name        : char
 <1><116>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <117>     DW_AT_byte_size   : 4
  <118>     DW_AT_type        : <11c>
 <1><11c>: Abbrev Number: 8 (DW_TAG_const_type)
  <11d>     DW_AT_type        : <10e>
 <1><121>: Abbrev Number: 3 (DW_TAG_base_type)
  <122>     DW_AT_byte_size   : 2
  <123>     DW_AT_encoding    : 7   (unsigned)
  <124>     DW_AT_name        : short unsigned int
 <1><137>: Abbrev Number: 3 (DW_TAG_base_type)
  <138>     DW_AT_byte_size   : 8
  <139>     DW_AT_encoding    : 7   (unsigned)
  <13a>     DW_AT_name        : long long unsigned int
 <1><151>: Abbrev Number: 3 (DW_TAG_base_type)
  <152>     DW_AT_byte_size   : 1
  <153>     DW_AT_encoding    : 6   (signed char)
  <154>     DW_AT_name        : signed char
 <1><160>: Abbrev Number: 2 (DW_TAG_typedef)
  <161>     DW_AT_name        : uint8_t
  <169>     DW_AT_decl_file   : 3
  <16a>     DW_AT_decl_line   : 46
  <16b>     DW_AT_type        : <e0>
 <1><16f>: Abbrev Number: 2 (DW_TAG_typedef)
  <170>     DW_AT_name        : uint16_t
  <179>     DW_AT_decl_file   : 3
  <17a>     DW_AT_decl_line   : 58
  <17b>     DW_AT_type        : <121>
 <1><17f>: Abbrev Number: 2 (DW_TAG_typedef)
  <180>     DW_AT_name        : int32_t
  <188>     DW_AT_decl_file   : 3
  <189>     DW_AT_decl_line   : 83
  <18a>     DW_AT_type        : <b0>
 <1><18e>: Abbrev Number: 2 (DW_TAG_typedef)
  <18f>     DW_AT_name        : uint32_t
  <198>     DW_AT_decl_file   : 3
  <199>     DW_AT_decl_line   : 84
  <19a>     DW_AT_type        : <94>
 <1><19e>: Abbrev Number: 2 (DW_TAG_typedef)
  <19f>     DW_AT_name        : uint_fast16_t
  <1ad>     DW_AT_decl_file   : 3
  <1ae>     DW_AT_decl_line   : 170
  <1af>     DW_AT_type        : <cd>
 <1><1b3>: Abbrev Number: 2 (DW_TAG_typedef)
  <1b4>     DW_AT_name        : FAPI_SYS_HandleT
  <1c5>     DW_AT_decl_file   : 4
  <1c6>     DW_AT_decl_line   : 71
  <1c7>     DW_AT_type        : <f1>
 <1><1cb>: Abbrev Number: 9 (DW_TAG_enumeration_type)
  <1cc>     DW_AT_byte_size   : 4
  <1cd>     DW_AT_decl_file   : 4
  <1ce>     DW_AT_decl_line   : 83
  <1cf>     DW_AT_sibling     : <225>
 <2><1d3>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1d4>     DW_AT_name        : FAPI_SYS_BSR_EXEC_UNDEFINED
  <1f0>     DW_AT_const_value : 0
 <2><1f1>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1f2>     DW_AT_name        : FAPI_SYS_BSR_EXEC_THREAD
  <20b>     DW_AT_const_value : 1
 <2><20c>: Abbrev Number: 10 (DW_TAG_enumerator)
  <20d>     DW_AT_name        : FAPI_SYS_BSR_EXEC_IRQ
  <223>     DW_AT_const_value : 2
 <1><225>: Abbrev Number: 2 (DW_TAG_typedef)
  <226>     DW_AT_name        : FAPI_SYS_BsrExecutionEnumT
  <241>     DW_AT_decl_file   : 4
  <242>     DW_AT_decl_line   : 125
  <243>     DW_AT_type        : <1cb>
 <1><247>: Abbrev Number: 11 (DW_TAG_structure_type)
  <248>     DW_AT_byte_size   : 36
  <249>     DW_AT_decl_file   : 4
  <24a>     DW_AT_decl_line   : 139
  <24b>     DW_AT_sibling     : <317>
 <2><24f>: Abbrev Number: 12 (DW_TAG_member)
  <250>     DW_AT_name        : driverNamePtr
  <25e>     DW_AT_decl_file   : 4
  <25f>     DW_AT_decl_line   : 150
  <260>     DW_AT_type        : <116>
  <264>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><267>: Abbrev Number: 12 (DW_TAG_member)
  <268>     DW_AT_name        : irqNo
  <26e>     DW_AT_decl_file   : 4
  <26f>     DW_AT_decl_line   : 163
  <270>     DW_AT_type        : <17f>
  <274>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><277>: Abbrev Number: 12 (DW_TAG_member)
  <278>     DW_AT_name        : bsrExecution
  <285>     DW_AT_decl_file   : 4
  <286>     DW_AT_decl_line   : 177
  <287>     DW_AT_type        : <225>
  <28b>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><28e>: Abbrev Number: 12 (DW_TAG_member)
  <28f>     DW_AT_name        : initDriverFunc
  <29e>     DW_AT_decl_file   : 4
  <29f>     DW_AT_decl_line   : 206
  <2a0>     DW_AT_type        : <31d>
  <2a4>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <2><2a7>: Abbrev Number: 12 (DW_TAG_member)
  <2a8>     DW_AT_name        : exitDriverFunc
  <2b7>     DW_AT_decl_file   : 4
  <2b8>     DW_AT_decl_line   : 222
  <2b9>     DW_AT_type        : <f5>
  <2bd>     DW_AT_data_member_location: 2 byte block: 23 10     (DW_OP_plus_uconst: 16)
 <2><2c0>: Abbrev Number: 13 (DW_TAG_member)
  <2c1>     DW_AT_name        : isrFunc
  <2c9>     DW_AT_decl_file   : 4
  <2ca>     DW_AT_decl_line   : 257
  <2cc>     DW_AT_type        : <329>
  <2d0>     DW_AT_data_member_location: 2 byte block: 23 14     (DW_OP_plus_uconst: 20)
 <2><2d3>: Abbrev Number: 13 (DW_TAG_member)
  <2d4>     DW_AT_name        : bsrFunc
  <2dc>     DW_AT_decl_file   : 4
  <2dd>     DW_AT_decl_line   : 291
  <2df>     DW_AT_type        : <33b>
  <2e3>     DW_AT_data_member_location: 2 byte block: 23 18     (DW_OP_plus_uconst: 24)
 <2><2e6>: Abbrev Number: 13 (DW_TAG_member)
  <2e7>     DW_AT_name        : bsrStackSize
  <2f4>     DW_AT_decl_file   : 4
  <2f5>     DW_AT_decl_line   : 302
  <2f7>     DW_AT_type        : <18e>
  <2fb>     DW_AT_data_member_location: 2 byte block: 23 1c     (DW_OP_plus_uconst: 28)
 <2><2fe>: Abbrev Number: 13 (DW_TAG_member)
  <2ff>     DW_AT_name        : bsrFifoDepth
  <30c>     DW_AT_decl_file   : 4
  <30d>     DW_AT_decl_line   : 312
  <30f>     DW_AT_type        : <18e>
  <313>     DW_AT_data_member_location: 2 byte block: 23 20     (DW_OP_plus_uconst: 32)
 <1><317>: Abbrev Number: 14 (DW_TAG_subroutine_type)
  <318>     DW_AT_prototyped  : 1
  <319>     DW_AT_type        : <17f>
 <1><31d>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <31e>     DW_AT_byte_size   : 4
  <31f>     DW_AT_type        : <317>
 <1><323>: Abbrev Number: 14 (DW_TAG_subroutine_type)
  <324>     DW_AT_prototyped  : 1
  <325>     DW_AT_type        : <18e>
 <1><329>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <32a>     DW_AT_byte_size   : 4
  <32b>     DW_AT_type        : <323>
 <1><32f>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <330>     DW_AT_prototyped  : 1
  <331>     DW_AT_sibling     : <33b>
 <2><335>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <336>     DW_AT_type        : <18e>
 <1><33b>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <33c>     DW_AT_byte_size   : 4
  <33d>     DW_AT_type        : <32f>
 <1><341>: Abbrev Number: 17 (DW_TAG_typedef)
  <342>     DW_AT_name        : FAPI_SYS_DriverT
  <353>     DW_AT_decl_file   : 4
  <354>     DW_AT_decl_line   : 313
  <356>     DW_AT_type        : <247>
 <1><35a>: Abbrev Number: 11 (DW_TAG_structure_type)
  <35b>     DW_AT_byte_size   : 76
  <35c>     DW_AT_decl_file   : 5
  <35d>     DW_AT_decl_line   : 247
  <35e>     DW_AT_sibling     : <59f>
 <2><362>: Abbrev Number: 12 (DW_TAG_member)
  <363>     DW_AT_name        : chConfig
  <36c>     DW_AT_decl_file   : 5
  <36d>     DW_AT_decl_line   : 248
  <36e>     DW_AT_type        : <18e>
  <372>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><375>: Abbrev Number: 12 (DW_TAG_member)
  <376>     DW_AT_name        : chLength
  <37f>     DW_AT_decl_file   : 5
  <380>     DW_AT_decl_line   : 249
  <381>     DW_AT_type        : <18e>
  <385>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><388>: Abbrev Number: 12 (DW_TAG_member)
  <389>     DW_AT_name        : chLladdr
  <392>     DW_AT_decl_file   : 5
  <393>     DW_AT_decl_line   : 250
  <394>     DW_AT_type        : <18e>
  <398>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><39b>: Abbrev Number: 12 (DW_TAG_member)
  <39c>     DW_AT_name        : chRdaddr_EndianSwap
  <3b0>     DW_AT_decl_file   : 5
  <3b1>     DW_AT_decl_line   : 251
  <3b2>     DW_AT_type        : <18e>
  <3b6>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <2><3b9>: Abbrev Number: 12 (DW_TAG_member)
  <3ba>     DW_AT_name        : chRdaddr_PeripheralAddress
  <3d5>     DW_AT_decl_file   : 5
  <3d6>     DW_AT_decl_line   : 252
  <3d7>     DW_AT_type        : <18e>
  <3db>     DW_AT_data_member_location: 2 byte block: 23 10     (DW_OP_plus_uconst: 16)
 <2><3de>: Abbrev Number: 12 (DW_TAG_member)
  <3df>     DW_AT_name        : chRdaddr_OffsetAddress
  <3f6>     DW_AT_decl_file   : 5
  <3f7>     DW_AT_decl_line   : 253
  <3f8>     DW_AT_type        : <18e>
  <3fc>     DW_AT_data_member_location: 2 byte block: 23 14     (DW_OP_plus_uconst: 20)
 <2><3ff>: Abbrev Number: 12 (DW_TAG_member)
  <400>     DW_AT_name        : chRdline_Lines
  <40f>     DW_AT_decl_file   : 5
  <410>     DW_AT_decl_line   : 254
  <411>     DW_AT_type        : <18e>
  <415>     DW_AT_data_member_location: 2 byte block: 23 18     (DW_OP_plus_uconst: 24)
 <2><418>: Abbrev Number: 12 (DW_TAG_member)
  <419>     DW_AT_name        : chRdline_LoopIncrement
  <430>     DW_AT_decl_file   : 5
  <431>     DW_AT_decl_line   : 255
  <432>     DW_AT_type        : <18e>
  <436>     DW_AT_data_member_location: 2 byte block: 23 1c     (DW_OP_plus_uconst: 28)
 <2><439>: Abbrev Number: 13 (DW_TAG_member)
  <43a>     DW_AT_name        : chRdinc_LineLength
  <44d>     DW_AT_decl_file   : 5
  <44e>     DW_AT_decl_line   : 256
  <450>     DW_AT_type        : <18e>
  <454>     DW_AT_data_member_location: 2 byte block: 23 20     (DW_OP_plus_uconst: 32)
 <2><457>: Abbrev Number: 13 (DW_TAG_member)
  <458>     DW_AT_name        : chRdinc_LineIncrement
  <46e>     DW_AT_decl_file   : 5
  <46f>     DW_AT_decl_line   : 257
  <471>     DW_AT_type        : <18e>
  <475>     DW_AT_data_member_location: 2 byte block: 23 24     (DW_OP_plus_uconst: 36)
 <2><478>: Abbrev Number: 13 (DW_TAG_member)
  <479>     DW_AT_name        : chRdlpaddr_LoopAddress
  <490>     DW_AT_decl_file   : 5
  <491>     DW_AT_decl_line   : 258
  <493>     DW_AT_type        : <18e>
  <497>     DW_AT_data_member_location: 2 byte block: 23 28     (DW_OP_plus_uconst: 40)
 <2><49a>: Abbrev Number: 13 (DW_TAG_member)
  <49b>     DW_AT_name        : chWraddr_EndianSwap
  <4af>     DW_AT_decl_file   : 5
  <4b0>     DW_AT_decl_line   : 259
  <4b2>     DW_AT_type        : <18e>
  <4b6>     DW_AT_data_member_location: 2 byte block: 23 2c     (DW_OP_plus_uconst: 44)
 <2><4b9>: Abbrev Number: 13 (DW_TAG_member)
  <4ba>     DW_AT_name        : chWraddr_PeripheralAddress
  <4d5>     DW_AT_decl_file   : 5
  <4d6>     DW_AT_decl_line   : 260
  <4d8>     DW_AT_type        : <18e>
  <4dc>     DW_AT_data_member_location: 2 byte block: 23 30     (DW_OP_plus_uconst: 48)
 <2><4df>: Abbrev Number: 13 (DW_TAG_member)
  <4e0>     DW_AT_name        : chWraddr_OffsetAddress
  <4f7>     DW_AT_decl_file   : 5
  <4f8>     DW_AT_decl_line   : 261
  <4fa>     DW_AT_type        : <18e>
  <4fe>     DW_AT_data_member_location: 2 byte block: 23 34     (DW_OP_plus_uconst: 52)
 <2><501>: Abbrev Number: 13 (DW_TAG_member)
  <502>     DW_AT_name        : chWrline_Lines
  <511>     DW_AT_decl_file   : 5
  <512>     DW_AT_decl_line   : 262
  <514>     DW_AT_type        : <18e>
  <518>     DW_AT_data_member_location: 2 byte block: 23 38     (DW_OP_plus_uconst: 56)
 <2><51b>: Abbrev Number: 13 (DW_TAG_member)
  <51c>     DW_AT_name        : chWrline_LoopIncrement
  <533>     DW_AT_decl_file   : 5
  <534>     DW_AT_decl_line   : 263
  <536>     DW_AT_type        : <18e>
  <53a>     DW_AT_data_member_location: 2 byte block: 23 3c     (DW_OP_plus_uconst: 60)
 <2><53d>: Abbrev Number: 13 (DW_TAG_member)
  <53e>     DW_AT_name        : chWrinc_LineLength
  <551>     DW_AT_decl_file   : 5
  <552>     DW_AT_decl_line   : 264
  <554>     DW_AT_type        : <18e>
  <558>     DW_AT_data_member_location: 2 byte block: 23 40     (DW_OP_plus_uconst: 64)
 <2><55b>: Abbrev Number: 13 (DW_TAG_member)
  <55c>     DW_AT_name        : chWrinc_LineIncrement
  <572>     DW_AT_decl_file   : 5
  <573>     DW_AT_decl_line   : 265
  <575>     DW_AT_type        : <18e>
  <579>     DW_AT_data_member_location: 2 byte block: 23 44     (DW_OP_plus_uconst: 68)
 <2><57c>: Abbrev Number: 13 (DW_TAG_member)
  <57d>     DW_AT_name        : chWrlpaddr_LoopAddress
  <594>     DW_AT_decl_file   : 5
  <595>     DW_AT_decl_line   : 266
  <597>     DW_AT_type        : <18e>
  <59b>     DW_AT_data_member_location: 2 byte block: 23 48     (DW_OP_plus_uconst: 72)
 <1><59f>: Abbrev Number: 17 (DW_TAG_typedef)
  <5a0>     DW_AT_name        : FAPI_DMA_ChannelConfigT
  <5b8>     DW_AT_decl_file   : 5
  <5b9>     DW_AT_decl_line   : 268
  <5bb>     DW_AT_type        : <35a>
 <1><5bf>: Abbrev Number: 17 (DW_TAG_typedef)
  <5c0>     DW_AT_name        : FAPI_DMA_RequestT
  <5d2>     DW_AT_decl_file   : 5
  <5d3>     DW_AT_decl_line   : 286
  <5d5>     DW_AT_type        : <5d9>
 <1><5d9>: Abbrev Number: 18 (DW_TAG_structure_type)
  <5da>     DW_AT_name        : FAPI_DMA_RequestS
  <5ec>     DW_AT_byte_size   : 140
  <5ed>     DW_AT_decl_file   : 5
  <5ee>     DW_AT_decl_line   : 285
  <5f0>     DW_AT_sibling     : <797>
 <2><5f4>: Abbrev Number: 13 (DW_TAG_member)
  <5f5>     DW_AT_name        : feature
  <5fd>     DW_AT_decl_file   : 5
  <5fe>     DW_AT_decl_line   : 331
  <600>     DW_AT_type        : <18e>
  <604>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><607>: Abbrev Number: 13 (DW_TAG_member)
  <608>     DW_AT_name        : status
  <60f>     DW_AT_decl_file   : 5
  <610>     DW_AT_decl_line   : 339
  <612>     DW_AT_type        : <18e>
  <616>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><619>: Abbrev Number: 13 (DW_TAG_member)
  <61a>     DW_AT_name        : channel
  <622>     DW_AT_decl_file   : 5
  <623>     DW_AT_decl_line   : 346
  <625>     DW_AT_type        : <18e>
  <629>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><62c>: Abbrev Number: 13 (DW_TAG_member)
  <62d>     DW_AT_name        : result
  <634>     DW_AT_decl_file   : 5
  <635>     DW_AT_decl_line   : 356
  <637>     DW_AT_type        : <17f>
  <63b>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <2><63e>: Abbrev Number: 13 (DW_TAG_member)
  <63f>     DW_AT_name        : selfDestroy
  <64b>     DW_AT_decl_file   : 5
  <64c>     DW_AT_decl_line   : 366
  <64e>     DW_AT_type        : <18e>
  <652>     DW_AT_data_member_location: 2 byte block: 23 10     (DW_OP_plus_uconst: 16)
 <2><655>: Abbrev Number: 13 (DW_TAG_member)
  <656>     DW_AT_name        : channelConfig
  <664>     DW_AT_decl_file   : 5
  <665>     DW_AT_decl_line   : 371
  <667>     DW_AT_type        : <59f>
  <66b>     DW_AT_data_member_location: 2 byte block: 23 14     (DW_OP_plus_uconst: 20)
 <2><66e>: Abbrev Number: 13 (DW_TAG_member)
  <66f>     DW_AT_name        : preEnableCallback
  <681>     DW_AT_decl_file   : 5
  <682>     DW_AT_decl_line   : 380
  <684>     DW_AT_type        : <797>
  <688>     DW_AT_data_member_location: 2 byte block: 23 60     (DW_OP_plus_uconst: 96)
 <2><68b>: Abbrev Number: 13 (DW_TAG_member)
  <68c>     DW_AT_name        : postEnableCallback
  <69f>     DW_AT_decl_file   : 5
  <6a0>     DW_AT_decl_line   : 389
  <6a2>     DW_AT_type        : <797>
  <6a6>     DW_AT_data_member_location: 2 byte block: 23 64     (DW_OP_plus_uconst: 100)
 <2><6a9>: Abbrev Number: 13 (DW_TAG_member)
  <6aa>     DW_AT_name        : postFinishCallback
  <6bd>     DW_AT_decl_file   : 5
  <6be>     DW_AT_decl_line   : 397
  <6c0>     DW_AT_type        : <797>
  <6c4>     DW_AT_data_member_location: 2 byte block: 23 68     (DW_OP_plus_uconst: 104)
 <2><6c7>: Abbrev Number: 13 (DW_TAG_member)
  <6c8>     DW_AT_name        : optHandle
  <6d2>     DW_AT_decl_file   : 5
  <6d3>     DW_AT_decl_line   : 402
  <6d5>     DW_AT_type        : <1b3>
  <6d9>     DW_AT_data_member_location: 2 byte block: 23 6c     (DW_OP_plus_uconst: 108)
 <2><6dc>: Abbrev Number: 13 (DW_TAG_member)
  <6dd>     DW_AT_name        : optData
  <6e5>     DW_AT_decl_file   : 5
  <6e6>     DW_AT_decl_line   : 410
  <6e8>     DW_AT_type        : <f1>
  <6ec>     DW_AT_data_member_location: 2 byte block: 23 70     (DW_OP_plus_uconst: 112)
 <2><6ef>: Abbrev Number: 13 (DW_TAG_member)
  <6f0>     DW_AT_name        : optFinishCallback
  <702>     DW_AT_decl_file   : 5
  <703>     DW_AT_decl_line   : 417
  <705>     DW_AT_type        : <7ca>
  <709>     DW_AT_data_member_location: 2 byte block: 23 74     (DW_OP_plus_uconst: 116)
 <2><70c>: Abbrev Number: 13 (DW_TAG_member)
  <70d>     DW_AT_name        : optChangeCallback
  <71f>     DW_AT_decl_file   : 5
  <720>     DW_AT_decl_line   : 426
  <722>     DW_AT_type        : <7ca>
  <726>     DW_AT_data_member_location: 2 byte block: 23 78     (DW_OP_plus_uconst: 120)
 <2><729>: Abbrev Number: 13 (DW_TAG_member)
  <72a>     DW_AT_name        : autoRestart
  <736>     DW_AT_decl_file   : 5
  <737>     DW_AT_decl_line   : 441
  <739>     DW_AT_type        : <18e>
  <73d>     DW_AT_data_member_location: 2 byte block: 23 7c     (DW_OP_plus_uconst: 124)
 <2><740>: Abbrev Number: 13 (DW_TAG_member)
  <741>     DW_AT_name        : optSplitCount
  <74f>     DW_AT_decl_file   : 5
  <750>     DW_AT_decl_line   : 447
  <752>     DW_AT_type        : <18e>
  <756>     DW_AT_data_member_location: 3 byte block: 23 80 1   (DW_OP_plus_uconst: 128)
 <2><75a>: Abbrev Number: 13 (DW_TAG_member)
  <75b>     DW_AT_name        : completeSplitCount
  <76e>     DW_AT_decl_file   : 5
  <76f>     DW_AT_decl_line   : 454
  <771>     DW_AT_type        : <18e>
  <775>     DW_AT_data_member_location: 3 byte block: 23 84 1   (DW_OP_plus_uconst: 132)
 <2><779>: Abbrev Number: 13 (DW_TAG_member)
  <77a>     DW_AT_name        : optSplitCallback
  <78b>     DW_AT_decl_file   : 5
  <78c>     DW_AT_decl_line   : 462
  <78e>     DW_AT_type        : <7ca>
  <792>     DW_AT_data_member_location: 3 byte block: 23 88 1   (DW_OP_plus_uconst: 136)
 <1><797>: Abbrev Number: 17 (DW_TAG_typedef)
  <798>     DW_AT_name        : FAPI_DMA_CallbackT
  <7ab>     DW_AT_decl_file   : 5
  <7ac>     DW_AT_decl_line   : 287
  <7ae>     DW_AT_type        : <7b2>
 <1><7b2>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <7b3>     DW_AT_byte_size   : 4
  <7b4>     DW_AT_type        : <7b8>
 <1><7b8>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <7b9>     DW_AT_prototyped  : 1
  <7ba>     DW_AT_sibling     : <7c4>
 <2><7be>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <7bf>     DW_AT_type        : <7c4>
 <1><7c4>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <7c5>     DW_AT_byte_size   : 4
  <7c6>     DW_AT_type        : <5bf>
 <1><7ca>: Abbrev Number: 17 (DW_TAG_typedef)
  <7cb>     DW_AT_name        : FAPI_DMA_OptCallbackT
  <7e1>     DW_AT_decl_file   : 5
  <7e2>     DW_AT_decl_line   : 305
  <7e4>     DW_AT_type        : <7e8>
 <1><7e8>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <7e9>     DW_AT_byte_size   : 4
  <7ea>     DW_AT_type        : <7ee>
 <1><7ee>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <7ef>     DW_AT_prototyped  : 1
  <7f0>     DW_AT_sibling     : <7ff>
 <2><7f4>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <7f5>     DW_AT_type        : <17f>
 <2><7f9>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <7fa>     DW_AT_type        : <18e>
 <1><7ff>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <800>     DW_AT_byte_size   : 4
  <801>     DW_AT_type        : <805>
 <1><805>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <806>     DW_AT_prototyped  : 1
  <807>     DW_AT_sibling     : <811>
 <2><80b>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <80c>     DW_AT_type        : <f1>
 <1><811>: Abbrev Number: 2 (DW_TAG_typedef)
  <812>     DW_AT_name        : MUSB_pfTimerExpired
  <826>     DW_AT_decl_file   : 6
  <827>     DW_AT_decl_line   : 88
  <828>     DW_AT_type        : <82c>
 <1><82c>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <82d>     DW_AT_byte_size   : 4
  <82e>     DW_AT_type        : <832>
 <1><832>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <833>     DW_AT_prototyped  : 1
  <834>     DW_AT_sibling     : <843>
 <2><838>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <839>     DW_AT_type        : <f1>
 <2><83d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <83e>     DW_AT_type        : <16f>
 <1><843>: Abbrev Number: 2 (DW_TAG_typedef)
  <844>     DW_AT_name        : MUSB_pfMessageString
  <859>     DW_AT_decl_file   : 6
  <85a>     DW_AT_decl_line   : 154
  <85b>     DW_AT_type        : <85f>
 <1><85f>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <860>     DW_AT_byte_size   : 4
  <861>     DW_AT_type        : <865>
 <1><865>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <866>     DW_AT_prototyped  : 1
  <867>     DW_AT_type        : <160>
  <86b>     DW_AT_sibling     : <87f>
 <2><86f>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <870>     DW_AT_type        : <108>
 <2><874>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <875>     DW_AT_type        : <16f>
 <2><879>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <87a>     DW_AT_type        : <116>
 <1><87f>: Abbrev Number: 2 (DW_TAG_typedef)
  <880>     DW_AT_name        : MUSB_pfMessageNumber
  <895>     DW_AT_decl_file   : 6
  <896>     DW_AT_decl_line   : 174
  <897>     DW_AT_type        : <89b>
 <1><89b>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <89c>     DW_AT_byte_size   : 4
  <89d>     DW_AT_type        : <8a1>
 <1><8a1>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <8a2>     DW_AT_prototyped  : 1
  <8a3>     DW_AT_type        : <160>
  <8a7>     DW_AT_sibling     : <8c5>
 <2><8ab>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <8ac>     DW_AT_type        : <108>
 <2><8b0>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <8b1>     DW_AT_type        : <16f>
 <2><8b5>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <8b6>     DW_AT_type        : <18e>
 <2><8ba>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <8bb>     DW_AT_type        : <160>
 <2><8bf>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <8c0>     DW_AT_type        : <160>
 <1><8c5>: Abbrev Number: 2 (DW_TAG_typedef)
  <8c6>     DW_AT_name        : MUSB_pfGetTime
  <8d5>     DW_AT_decl_file   : 6
  <8d6>     DW_AT_decl_line   : 184
  <8d7>     DW_AT_type        : <329>
 <1><8db>: Abbrev Number: 11 (DW_TAG_structure_type)
  <8dc>     DW_AT_byte_size   : 16
  <8dd>     DW_AT_decl_file   : 6
  <8de>     DW_AT_decl_line   : 208
  <8df>     DW_AT_sibling     : <93a>
 <2><8e3>: Abbrev Number: 20 (DW_TAG_member)
  <8e4>     DW_AT_name        : (indirect string, offset: 0x134): wVersion
  <8e8>     DW_AT_decl_file   : 6
  <8e9>     DW_AT_decl_line   : 209
  <8ea>     DW_AT_type        : <16f>
  <8ee>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><8f1>: Abbrev Number: 12 (DW_TAG_member)
  <8f2>     DW_AT_name        : pfMessageString
  <902>     DW_AT_decl_file   : 6
  <903>     DW_AT_decl_line   : 210
  <904>     DW_AT_type        : <843>
  <908>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><90b>: Abbrev Number: 12 (DW_TAG_member)
  <90c>     DW_AT_name        : pfMessageNumber
  <91c>     DW_AT_decl_file   : 6
  <91d>     DW_AT_decl_line   : 211
  <91e>     DW_AT_type        : <87f>
  <922>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><925>: Abbrev Number: 12 (DW_TAG_member)
  <926>     DW_AT_name        : pfGetTime
  <930>     DW_AT_decl_file   : 6
  <931>     DW_AT_decl_line   : 212
  <932>     DW_AT_type        : <8c5>
  <936>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <1><93a>: Abbrev Number: 2 (DW_TAG_typedef)
  <93b>     DW_AT_name        : MUSB_SystemUtils
  <94c>     DW_AT_decl_file   : 6
  <94d>     DW_AT_decl_line   : 213
  <94e>     DW_AT_type        : <8db>
 <1><952>: Abbrev Number: 2 (DW_TAG_typedef)
  <953>     DW_AT_name        : MUSB_pfSystemToBusAddress
  <96d>     DW_AT_decl_file   : 6
  <96e>     DW_AT_decl_line   : 225
  <96f>     DW_AT_type        : <973>
 <1><973>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <974>     DW_AT_byte_size   : 4
  <975>     DW_AT_type        : <979>
 <1><979>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <97a>     DW_AT_prototyped  : 1
  <97b>     DW_AT_type        : <f1>
  <97f>     DW_AT_sibling     : <98e>
 <2><983>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <984>     DW_AT_type        : <f1>
 <2><988>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <989>     DW_AT_type        : <98e>
 <1><98e>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <98f>     DW_AT_byte_size   : 4
  <990>     DW_AT_type        : <994>
 <1><994>: Abbrev Number: 21 (DW_TAG_const_type)
 <1><995>: Abbrev Number: 2 (DW_TAG_typedef)
  <996>     DW_AT_name        : MUSB_pfQueueBackgroundItem
  <9b1>     DW_AT_decl_file   : 6
  <9b2>     DW_AT_decl_line   : 238
  <9b3>     DW_AT_type        : <9b7>
 <1><9b7>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <9b8>     DW_AT_byte_size   : 4
  <9b9>     DW_AT_type        : <9bd>
 <1><9bd>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <9be>     DW_AT_prototyped  : 1
  <9bf>     DW_AT_type        : <160>
  <9c3>     DW_AT_sibling     : <9d2>
 <2><9c7>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <9c8>     DW_AT_type        : <f1>
 <2><9cc>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <9cd>     DW_AT_type        : <98e>
 <1><9d2>: Abbrev Number: 2 (DW_TAG_typedef)
  <9d3>     DW_AT_name        : MUSB_pfDequeueBackgroundItem
  <9f0>     DW_AT_decl_file   : 6
  <9f1>     DW_AT_decl_line   : 251
  <9f2>     DW_AT_type        : <9f6>
 <1><9f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <9f7>     DW_AT_byte_size   : 4
  <9f8>     DW_AT_type        : <9fc>
 <1><9fc>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <9fd>     DW_AT_prototyped  : 1
  <9fe>     DW_AT_type        : <160>
  <a02>     DW_AT_sibling     : <a11>
 <2><a06>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <a07>     DW_AT_type        : <f1>
 <2><a0b>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <a0c>     DW_AT_type        : <f1>
 <1><a11>: Abbrev Number: 17 (DW_TAG_typedef)
  <a12>     DW_AT_name        : MUSB_pfFlushBackgroundQueue
  <a2e>     DW_AT_decl_file   : 6
  <a2f>     DW_AT_decl_line   : 259
  <a31>     DW_AT_type        : <7ff>
 <1><a35>: Abbrev Number: 17 (DW_TAG_typedef)
  <a36>     DW_AT_name        : MUSB_pfArmTimer
  <a46>     DW_AT_decl_file   : 6
  <a47>     DW_AT_decl_line   : 274
  <a49>     DW_AT_type        : <a4d>
 <1><a4d>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <a4e>     DW_AT_byte_size   : 4
  <a4f>     DW_AT_type        : <a53>
 <1><a53>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <a54>     DW_AT_prototyped  : 1
  <a55>     DW_AT_type        : <160>
  <a59>     DW_AT_sibling     : <a77>
 <2><a5d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <a5e>     DW_AT_type        : <f1>
 <2><a62>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <a63>     DW_AT_type        : <16f>
 <2><a67>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <a68>     DW_AT_type        : <18e>
 <2><a6c>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <a6d>     DW_AT_type        : <160>
 <2><a71>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <a72>     DW_AT_type        : <811>
 <1><a77>: Abbrev Number: 17 (DW_TAG_typedef)
  <a78>     DW_AT_name        : MUSB_pfCancelTimer
  <a8b>     DW_AT_decl_file   : 6
  <a8c>     DW_AT_decl_line   : 285
  <a8e>     DW_AT_type        : <a92>
 <1><a92>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <a93>     DW_AT_byte_size   : 4
  <a94>     DW_AT_type        : <a98>
 <1><a98>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <a99>     DW_AT_prototyped  : 1
  <a9a>     DW_AT_type        : <160>
  <a9e>     DW_AT_sibling     : <aad>
 <2><aa2>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <aa3>     DW_AT_type        : <f1>
 <2><aa7>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <aa8>     DW_AT_type        : <16f>
 <1><aad>: Abbrev Number: 17 (DW_TAG_typedef)
  <aae>     DW_AT_name        : MUSB_pfLock
  <aba>     DW_AT_decl_file   : 6
  <abb>     DW_AT_decl_line   : 296
  <abd>     DW_AT_type        : <a92>
 <1><ac1>: Abbrev Number: 17 (DW_TAG_typedef)
  <ac2>     DW_AT_name        : MUSB_pfUnlock
  <ad0>     DW_AT_decl_file   : 6
  <ad1>     DW_AT_decl_line   : 307
  <ad3>     DW_AT_type        : <a92>
 <1><ad7>: Abbrev Number: 17 (DW_TAG_typedef)
  <ad8>     DW_AT_name        : MUSB_pfPrintDiag
  <ae9>     DW_AT_decl_file   : 6
  <aea>     DW_AT_decl_line   : 318
  <aec>     DW_AT_type        : <af0>
 <1><af0>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <af1>     DW_AT_byte_size   : 4
  <af2>     DW_AT_type        : <af6>
 <1><af6>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <af7>     DW_AT_prototyped  : 1
  <af8>     DW_AT_type        : <160>
  <afc>     DW_AT_sibling     : <b0b>
 <2><b00>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <b01>     DW_AT_type        : <f1>
 <2><b05>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <b06>     DW_AT_type        : <116>
 <1><b0b>: Abbrev Number: 17 (DW_TAG_typedef)
  <b0c>     DW_AT_name        : MUSB_pfNewPowerLoad
  <b20>     DW_AT_decl_file   : 6
  <b21>     DW_AT_decl_line   : 346
  <b23>     DW_AT_type        : <b27>
 <1><b27>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <b28>     DW_AT_byte_size   : 4
  <b29>     DW_AT_type        : <b2d>
 <1><b2d>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <b2e>     DW_AT_prototyped  : 1
  <b2f>     DW_AT_type        : <160>
  <b33>     DW_AT_sibling     : <b51>
 <2><b37>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <b38>     DW_AT_type        : <f1>
 <2><b3c>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <b3d>     DW_AT_type        : <16f>
 <2><b41>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <b42>     DW_AT_type        : <160>
 <2><b46>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <b47>     DW_AT_type        : <b51>
 <2><b4b>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <b4c>     DW_AT_type        : <160>
 <1><b51>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <b52>     DW_AT_byte_size   : 4
  <b53>     DW_AT_type        : <b57>
 <1><b57>: Abbrev Number: 8 (DW_TAG_const_type)
  <b58>     DW_AT_type        : <160>
 <1><b5c>: Abbrev Number: 17 (DW_TAG_typedef)
  <b5d>     DW_AT_name        : MUSB_pfRemovePowerLoad
  <b74>     DW_AT_decl_file   : 6
  <b75>     DW_AT_decl_line   : 366
  <b77>     DW_AT_type        : <b27>
 <1><b7b>: Abbrev Number: 22 (DW_TAG_structure_type)
  <b7c>     DW_AT_byte_size   : 52
  <b7d>     DW_AT_decl_file   : 6
  <b7e>     DW_AT_decl_line   : 403
  <b80>     DW_AT_sibling     : <ccc>
 <2><b84>: Abbrev Number: 23 (DW_TAG_member)
  <b85>     DW_AT_name        : (indirect string, offset: 0x134): wVersion
  <b89>     DW_AT_decl_file   : 6
  <b8a>     DW_AT_decl_line   : 404
  <b8c>     DW_AT_type        : <16f>
  <b90>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><b93>: Abbrev Number: 23 (DW_TAG_member)
  <b94>     DW_AT_name        : (indirect string, offset: 0x104): pPrivateData
  <b98>     DW_AT_decl_file   : 6
  <b99>     DW_AT_decl_line   : 405
  <b9b>     DW_AT_type        : <f1>
  <b9f>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><ba2>: Abbrev Number: 13 (DW_TAG_member)
  <ba3>     DW_AT_name        : pfSystemToBusAddress
  <bb8>     DW_AT_decl_file   : 6
  <bb9>     DW_AT_decl_line   : 406
  <bbb>     DW_AT_type        : <952>
  <bbf>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><bc2>: Abbrev Number: 13 (DW_TAG_member)
  <bc3>     DW_AT_name        : pfQueueBackgroundItem
  <bd9>     DW_AT_decl_file   : 6
  <bda>     DW_AT_decl_line   : 407
  <bdc>     DW_AT_type        : <995>
  <be0>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <2><be3>: Abbrev Number: 13 (DW_TAG_member)
  <be4>     DW_AT_name        : pfDequeueBackgroundItem
  <bfc>     DW_AT_decl_file   : 6
  <bfd>     DW_AT_decl_line   : 408
  <bff>     DW_AT_type        : <9d2>
  <c03>     DW_AT_data_member_location: 2 byte block: 23 10     (DW_OP_plus_uconst: 16)
 <2><c06>: Abbrev Number: 13 (DW_TAG_member)
  <c07>     DW_AT_name        : pfFlushBackgroundQueue
  <c1e>     DW_AT_decl_file   : 6
  <c1f>     DW_AT_decl_line   : 409
  <c21>     DW_AT_type        : <a11>
  <c25>     DW_AT_data_member_location: 2 byte block: 23 14     (DW_OP_plus_uconst: 20)
 <2><c28>: Abbrev Number: 13 (DW_TAG_member)
  <c29>     DW_AT_name        : pfArmTimer
  <c34>     DW_AT_decl_file   : 6
  <c35>     DW_AT_decl_line   : 410
  <c37>     DW_AT_type        : <a35>
  <c3b>     DW_AT_data_member_location: 2 byte block: 23 18     (DW_OP_plus_uconst: 24)
 <2><c3e>: Abbrev Number: 13 (DW_TAG_member)
  <c3f>     DW_AT_name        : pfCancelTimer
  <c4d>     DW_AT_decl_file   : 6
  <c4e>     DW_AT_decl_line   : 411
  <c50>     DW_AT_type        : <a77>
  <c54>     DW_AT_data_member_location: 2 byte block: 23 1c     (DW_OP_plus_uconst: 28)
 <2><c57>: Abbrev Number: 13 (DW_TAG_member)
  <c58>     DW_AT_name        : pfLock
  <c5f>     DW_AT_decl_file   : 6
  <c60>     DW_AT_decl_line   : 412
  <c62>     DW_AT_type        : <aad>
  <c66>     DW_AT_data_member_location: 2 byte block: 23 20     (DW_OP_plus_uconst: 32)
 <2><c69>: Abbrev Number: 13 (DW_TAG_member)
  <c6a>     DW_AT_name        : pfUnlock
  <c73>     DW_AT_decl_file   : 6
  <c74>     DW_AT_decl_line   : 413
  <c76>     DW_AT_type        : <ac1>
  <c7a>     DW_AT_data_member_location: 2 byte block: 23 24     (DW_OP_plus_uconst: 36)
 <2><c7d>: Abbrev Number: 13 (DW_TAG_member)
  <c7e>     DW_AT_name        : pfPrintDiag
  <c8a>     DW_AT_decl_file   : 6
  <c8b>     DW_AT_decl_line   : 414
  <c8d>     DW_AT_type        : <ad7>
  <c91>     DW_AT_data_member_location: 2 byte block: 23 28     (DW_OP_plus_uconst: 40)
 <2><c94>: Abbrev Number: 13 (DW_TAG_member)
  <c95>     DW_AT_name        : pfNewPowerLoad
  <ca4>     DW_AT_decl_file   : 6
  <ca5>     DW_AT_decl_line   : 415
  <ca7>     DW_AT_type        : <b0b>
  <cab>     DW_AT_data_member_location: 2 byte block: 23 2c     (DW_OP_plus_uconst: 44)
 <2><cae>: Abbrev Number: 13 (DW_TAG_member)
  <caf>     DW_AT_name        : pfRemovePowerLoad
  <cc1>     DW_AT_decl_file   : 6
  <cc2>     DW_AT_decl_line   : 416
  <cc4>     DW_AT_type        : <b5c>
  <cc8>     DW_AT_data_member_location: 2 byte block: 23 30     (DW_OP_plus_uconst: 48)
 <1><ccc>: Abbrev Number: 17 (DW_TAG_typedef)
  <ccd>     DW_AT_name        : MUSB_SystemServices
  <ce1>     DW_AT_decl_file   : 6
  <ce2>     DW_AT_decl_line   : 417
  <ce4>     DW_AT_type        : <b7b>
 <1><ce8>: Abbrev Number: 11 (DW_TAG_structure_type)
  <ce9>     DW_AT_byte_size   : 8
  <cea>     DW_AT_decl_file   : 7
  <ceb>     DW_AT_decl_line   : 173
  <cec>     DW_AT_sibling     : <d4d>
 <2><cf0>: Abbrev Number: 12 (DW_TAG_member)
  <cf1>     DW_AT_name        : bmRequestType
  <cff>     DW_AT_decl_file   : 7
  <d00>     DW_AT_decl_line   : 174
  <d01>     DW_AT_type        : <160>
  <d05>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><d08>: Abbrev Number: 12 (DW_TAG_member)
  <d09>     DW_AT_name        : bRequest
  <d12>     DW_AT_decl_file   : 7
  <d13>     DW_AT_decl_line   : 175
  <d14>     DW_AT_type        : <160>
  <d18>     DW_AT_data_member_location: 2 byte block: 23 1  (DW_OP_plus_uconst: 1)
 <2><d1b>: Abbrev Number: 12 (DW_TAG_member)
  <d1c>     DW_AT_name        : wValue
  <d23>     DW_AT_decl_file   : 7
  <d24>     DW_AT_decl_line   : 176
  <d25>     DW_AT_type        : <16f>
  <d29>     DW_AT_data_member_location: 2 byte block: 23 2  (DW_OP_plus_uconst: 2)
 <2><d2c>: Abbrev Number: 20 (DW_TAG_member)
  <d2d>     DW_AT_name        : (indirect string, offset: 0xba): wIndex
  <d31>     DW_AT_decl_file   : 7
  <d32>     DW_AT_decl_line   : 177
  <d33>     DW_AT_type        : <16f>
  <d37>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><d3a>: Abbrev Number: 12 (DW_TAG_member)
  <d3b>     DW_AT_name        : wLength
  <d43>     DW_AT_decl_file   : 7
  <d44>     DW_AT_decl_line   : 178
  <d45>     DW_AT_type        : <16f>
  <d49>     DW_AT_data_member_location: 2 byte block: 23 6  (DW_OP_plus_uconst: 6)
 <1><d4d>: Abbrev Number: 2 (DW_TAG_typedef)
  <d4e>     DW_AT_name        : MUSB_DeviceRequest
  <d61>     DW_AT_decl_file   : 7
  <d62>     DW_AT_decl_line   : 179
  <d63>     DW_AT_type        : <ce8>
 <1><d67>: Abbrev Number: 11 (DW_TAG_structure_type)
  <d68>     DW_AT_byte_size   : 20
  <d69>     DW_AT_decl_file   : 7
  <d6a>     DW_AT_decl_line   : 194
  <d6b>     DW_AT_sibling     : <e9d>
 <2><d6f>: Abbrev Number: 20 (DW_TAG_member)
  <d70>     DW_AT_name        : (indirect string, offset: 0x12c): bLength
  <d74>     DW_AT_decl_file   : 7
  <d75>     DW_AT_decl_line   : 195
  <d76>     DW_AT_type        : <160>
  <d7a>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><d7d>: Abbrev Number: 20 (DW_TAG_member)
  <d7e>     DW_AT_name        : (indirect string, offset: 0x146): bDescriptorType
  <d82>     DW_AT_decl_file   : 7
  <d83>     DW_AT_decl_line   : 196
  <d84>     DW_AT_type        : <160>
  <d88>     DW_AT_data_member_location: 2 byte block: 23 1  (DW_OP_plus_uconst: 1)
 <2><d8b>: Abbrev Number: 12 (DW_TAG_member)
  <d8c>     DW_AT_name        : bcdUSB
  <d93>     DW_AT_decl_file   : 7
  <d94>     DW_AT_decl_line   : 197
  <d95>     DW_AT_type        : <16f>
  <d99>     DW_AT_data_member_location: 2 byte block: 23 2  (DW_OP_plus_uconst: 2)
 <2><d9c>: Abbrev Number: 12 (DW_TAG_member)
  <d9d>     DW_AT_name        : bDeviceClass
  <daa>     DW_AT_decl_file   : 7
  <dab>     DW_AT_decl_line   : 198
  <dac>     DW_AT_type        : <160>
  <db0>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><db3>: Abbrev Number: 12 (DW_TAG_member)
  <db4>     DW_AT_name        : bDeviceSubClass
  <dc4>     DW_AT_decl_file   : 7
  <dc5>     DW_AT_decl_line   : 199
  <dc6>     DW_AT_type        : <160>
  <dca>     DW_AT_data_member_location: 2 byte block: 23 5  (DW_OP_plus_uconst: 5)
 <2><dcd>: Abbrev Number: 12 (DW_TAG_member)
  <dce>     DW_AT_name        : bDeviceProtocol
  <dde>     DW_AT_decl_file   : 7
  <ddf>     DW_AT_decl_line   : 200
  <de0>     DW_AT_type        : <160>
  <de4>     DW_AT_data_member_location: 2 byte block: 23 6  (DW_OP_plus_uconst: 6)
 <2><de7>: Abbrev Number: 12 (DW_TAG_member)
  <de8>     DW_AT_name        : bMaxPacketSize0
  <df8>     DW_AT_decl_file   : 7
  <df9>     DW_AT_decl_line   : 201
  <dfa>     DW_AT_type        : <160>
  <dfe>     DW_AT_data_member_location: 2 byte block: 23 7  (DW_OP_plus_uconst: 7)
 <2><e01>: Abbrev Number: 12 (DW_TAG_member)
  <e02>     DW_AT_name        : idVendor
  <e0b>     DW_AT_decl_file   : 7
  <e0c>     DW_AT_decl_line   : 202
  <e0d>     DW_AT_type        : <16f>
  <e11>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><e14>: Abbrev Number: 12 (DW_TAG_member)
  <e15>     DW_AT_name        : idProduct
  <e1f>     DW_AT_decl_file   : 7
  <e20>     DW_AT_decl_line   : 203
  <e21>     DW_AT_type        : <16f>
  <e25>     DW_AT_data_member_location: 2 byte block: 23 a  (DW_OP_plus_uconst: 10)
 <2><e28>: Abbrev Number: 12 (DW_TAG_member)
  <e29>     DW_AT_name        : bcdDevice
  <e33>     DW_AT_decl_file   : 7
  <e34>     DW_AT_decl_line   : 204
  <e35>     DW_AT_type        : <16f>
  <e39>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <2><e3c>: Abbrev Number: 12 (DW_TAG_member)
  <e3d>     DW_AT_name        : iManufacturer
  <e4b>     DW_AT_decl_file   : 7
  <e4c>     DW_AT_decl_line   : 205
  <e4d>     DW_AT_type        : <160>
  <e51>     DW_AT_data_member_location: 2 byte block: 23 e  (DW_OP_plus_uconst: 14)
 <2><e54>: Abbrev Number: 12 (DW_TAG_member)
  <e55>     DW_AT_name        : iProduct
  <e5e>     DW_AT_decl_file   : 7
  <e5f>     DW_AT_decl_line   : 206
  <e60>     DW_AT_type        : <160>
  <e64>     DW_AT_data_member_location: 2 byte block: 23 f  (DW_OP_plus_uconst: 15)
 <2><e67>: Abbrev Number: 12 (DW_TAG_member)
  <e68>     DW_AT_name        : iSerialNumber
  <e76>     DW_AT_decl_file   : 7
  <e77>     DW_AT_decl_line   : 207
  <e78>     DW_AT_type        : <160>
  <e7c>     DW_AT_data_member_location: 2 byte block: 23 10     (DW_OP_plus_uconst: 16)
 <2><e7f>: Abbrev Number: 12 (DW_TAG_member)
  <e80>     DW_AT_name        : bNumConfigurations
  <e93>     DW_AT_decl_file   : 7
  <e94>     DW_AT_decl_line   : 208
  <e95>     DW_AT_type        : <160>
  <e99>     DW_AT_data_member_location: 2 byte block: 23 11     (DW_OP_plus_uconst: 17)
 <1><e9d>: Abbrev Number: 2 (DW_TAG_typedef)
  <e9e>     DW_AT_name        : MUSB_DeviceDescriptor
  <eb4>     DW_AT_decl_file   : 7
  <eb5>     DW_AT_decl_line   : 209
  <eb6>     DW_AT_type        : <d67>
 <1><eba>: Abbrev Number: 11 (DW_TAG_structure_type)
  <ebb>     DW_AT_byte_size   : 8
  <ebc>     DW_AT_decl_file   : 7
  <ebd>     DW_AT_decl_line   : 215
  <ebe>     DW_AT_sibling     : <f24>
 <2><ec2>: Abbrev Number: 20 (DW_TAG_member)
  <ec3>     DW_AT_name        : (indirect string, offset: 0x12c): bLength
  <ec7>     DW_AT_decl_file   : 7
  <ec8>     DW_AT_decl_line   : 216
  <ec9>     DW_AT_type        : <160>
  <ecd>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><ed0>: Abbrev Number: 20 (DW_TAG_member)
  <ed1>     DW_AT_name        : (indirect string, offset: 0x146): bDescriptorType
  <ed5>     DW_AT_decl_file   : 7
  <ed6>     DW_AT_decl_line   : 217
  <ed7>     DW_AT_type        : <160>
  <edb>     DW_AT_data_member_location: 2 byte block: 23 1  (DW_OP_plus_uconst: 1)
 <2><ede>: Abbrev Number: 12 (DW_TAG_member)
  <edf>     DW_AT_name        : bEndpointAddress
  <ef0>     DW_AT_decl_file   : 7
  <ef1>     DW_AT_decl_line   : 218
  <ef2>     DW_AT_type        : <160>
  <ef6>     DW_AT_data_member_location: 2 byte block: 23 2  (DW_OP_plus_uconst: 2)
 <2><ef9>: Abbrev Number: 20 (DW_TAG_member)
  <efa>     DW_AT_name        : (indirect string, offset: 0x1b1): bmAttributes
  <efe>     DW_AT_decl_file   : 7
  <eff>     DW_AT_decl_line   : 219
  <f00>     DW_AT_type        : <160>
  <f04>     DW_AT_data_member_location: 2 byte block: 23 3  (DW_OP_plus_uconst: 3)
 <2><f07>: Abbrev Number: 20 (DW_TAG_member)
  <f08>     DW_AT_name        : (indirect string, offset: 0x11d): wMaxPacketSize
  <f0c>     DW_AT_decl_file   : 7
  <f0d>     DW_AT_decl_line   : 220
  <f0e>     DW_AT_type        : <16f>
  <f12>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><f15>: Abbrev Number: 20 (DW_TAG_member)
  <f16>     DW_AT_name        : (indirect string, offset: 0x39): bInterval
  <f1a>     DW_AT_decl_file   : 7
  <f1b>     DW_AT_decl_line   : 221
  <f1c>     DW_AT_type        : <160>
  <f20>     DW_AT_data_member_location: 2 byte block: 23 6  (DW_OP_plus_uconst: 6)
 <1><f24>: Abbrev Number: 2 (DW_TAG_typedef)
  <f25>     DW_AT_name        : MUSB_EndpointDescriptor
  <f3d>     DW_AT_decl_file   : 7
  <f3e>     DW_AT_decl_line   : 222
  <f3f>     DW_AT_type        : <eba>
 <1><f43>: Abbrev Number: 11 (DW_TAG_structure_type)
  <f44>     DW_AT_byte_size   : 12
  <f45>     DW_AT_decl_file   : 7
  <f46>     DW_AT_decl_line   : 244
  <f47>     DW_AT_sibling     : <ff1>
 <2><f4b>: Abbrev Number: 20 (DW_TAG_member)
  <f4c>     DW_AT_name        : (indirect string, offset: 0x12c): bLength
  <f50>     DW_AT_decl_file   : 7
  <f51>     DW_AT_decl_line   : 245
  <f52>     DW_AT_type        : <160>
  <f56>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><f59>: Abbrev Number: 20 (DW_TAG_member)
  <f5a>     DW_AT_name        : (indirect string, offset: 0x146): bDescriptorType
  <f5e>     DW_AT_decl_file   : 7
  <f5f>     DW_AT_decl_line   : 246
  <f60>     DW_AT_type        : <160>
  <f64>     DW_AT_data_member_location: 2 byte block: 23 1  (DW_OP_plus_uconst: 1)
 <2><f67>: Abbrev Number: 12 (DW_TAG_member)
  <f68>     DW_AT_name        : wTotalLength
  <f75>     DW_AT_decl_file   : 7
  <f76>     DW_AT_decl_line   : 247
  <f77>     DW_AT_type        : <16f>
  <f7b>     DW_AT_data_member_location: 2 byte block: 23 2  (DW_OP_plus_uconst: 2)
 <2><f7e>: Abbrev Number: 12 (DW_TAG_member)
  <f7f>     DW_AT_name        : bNumInterfaces
  <f8e>     DW_AT_decl_file   : 7
  <f8f>     DW_AT_decl_line   : 248
  <f90>     DW_AT_type        : <160>
  <f94>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><f97>: Abbrev Number: 12 (DW_TAG_member)
  <f98>     DW_AT_name        : bConfigurationValue
  <fac>     DW_AT_decl_file   : 7
  <fad>     DW_AT_decl_line   : 249
  <fae>     DW_AT_type        : <160>
  <fb2>     DW_AT_data_member_location: 2 byte block: 23 5  (DW_OP_plus_uconst: 5)
 <2><fb5>: Abbrev Number: 12 (DW_TAG_member)
  <fb6>     DW_AT_name        : iConfiguration
  <fc5>     DW_AT_decl_file   : 7
  <fc6>     DW_AT_decl_line   : 250
  <fc7>     DW_AT_type        : <160>
  <fcb>     DW_AT_data_member_location: 2 byte block: 23 6  (DW_OP_plus_uconst: 6)
 <2><fce>: Abbrev Number: 20 (DW_TAG_member)
  <fcf>     DW_AT_name        : (indirect string, offset: 0x1b1): bmAttributes
  <fd3>     DW_AT_decl_file   : 7
  <fd4>     DW_AT_decl_line   : 251
  <fd5>     DW_AT_type        : <160>
  <fd9>     DW_AT_data_member_location: 2 byte block: 23 7  (DW_OP_plus_uconst: 7)
 <2><fdc>: Abbrev Number: 12 (DW_TAG_member)
  <fdd>     DW_AT_name        : bMaxPower
  <fe7>     DW_AT_decl_file   : 7
  <fe8>     DW_AT_decl_line   : 252
  <fe9>     DW_AT_type        : <160>
  <fed>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <1><ff1>: Abbrev Number: 2 (DW_TAG_typedef)
  <ff2>     DW_AT_name        : MUSB_ConfigurationDescriptor
  <100f>     DW_AT_decl_file   : 7
  <1010>     DW_AT_decl_line   : 253
  <1011>     DW_AT_type        : <f43>
 <1><1015>: Abbrev Number: 22 (DW_TAG_structure_type)
  <1016>     DW_AT_byte_size   : 4
  <1017>     DW_AT_decl_file   : 7
  <1018>     DW_AT_decl_line   : 269
  <101a>     DW_AT_sibling     : <104c>
 <2><101e>: Abbrev Number: 23 (DW_TAG_member)
  <101f>     DW_AT_name        : (indirect string, offset: 0x12c): bLength
  <1023>     DW_AT_decl_file   : 7
  <1024>     DW_AT_decl_line   : 270
  <1026>     DW_AT_type        : <160>
  <102a>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><102d>: Abbrev Number: 23 (DW_TAG_member)
  <102e>     DW_AT_name        : (indirect string, offset: 0x146): bDescriptorType
  <1032>     DW_AT_decl_file   : 7
  <1033>     DW_AT_decl_line   : 271
  <1035>     DW_AT_type        : <160>
  <1039>     DW_AT_data_member_location: 2 byte block: 23 1     (DW_OP_plus_uconst: 1)
 <2><103c>: Abbrev Number: 23 (DW_TAG_member)
  <103d>     DW_AT_name        : (indirect string, offset: 0x1b1): bmAttributes
  <1041>     DW_AT_decl_file   : 7
  <1042>     DW_AT_decl_line   : 272
  <1044>     DW_AT_type        : <160>
  <1048>     DW_AT_data_member_location: 2 byte block: 23 2     (DW_OP_plus_uconst: 2)
 <1><104c>: Abbrev Number: 17 (DW_TAG_typedef)
  <104d>     DW_AT_name        : MUSB_OtgDescriptor
  <1060>     DW_AT_decl_file   : 7
  <1061>     DW_AT_decl_line   : 273
  <1063>     DW_AT_type        : <1015>
 <1><1067>: Abbrev Number: 9 (DW_TAG_enumeration_type)
  <1068>     DW_AT_byte_size   : 4
  <1069>     DW_AT_decl_file   : 8
  <106a>     DW_AT_decl_line   : 36
  <106b>     DW_AT_sibling     : <10c9>
 <2><106f>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1070>     DW_AT_name        : MUSB_PORT_UNKNOWN
  <1082>     DW_AT_const_value : 0
 <2><1083>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1084>     DW_AT_name        : MUSB_PORT_TYPE_FUNCTION
  <109c>     DW_AT_const_value : 1
 <2><109d>: Abbrev Number: 10 (DW_TAG_enumerator)
  <109e>     DW_AT_name        : MUSB_PORT_TYPE_HOST
  <10b2>     DW_AT_const_value : 2
 <2><10b3>: Abbrev Number: 10 (DW_TAG_enumerator)
  <10b4>     DW_AT_name        : MUSB_PORT_TYPE_OTG
  <10c7>     DW_AT_const_value : 3
 <1><10c9>: Abbrev Number: 2 (DW_TAG_typedef)
  <10ca>     DW_AT_name        : MUSB_PortType
  <10d8>     DW_AT_decl_file   : 8
  <10d9>     DW_AT_decl_line   : 45
  <10da>     DW_AT_type        : <1067>
 <1><10de>: Abbrev Number: 9 (DW_TAG_enumeration_type)
  <10df>     DW_AT_byte_size   : 4
  <10e0>     DW_AT_decl_file   : 8
  <10e1>     DW_AT_decl_line   : 52
  <10e2>     DW_AT_sibling     : <1145>
 <2><10e6>: Abbrev Number: 10 (DW_TAG_enumerator)
  <10e7>     DW_AT_name        : MUSB_PORT_SPEED_UNKNOWN
  <10ff>     DW_AT_const_value : 0
 <2><1100>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1101>     DW_AT_name        : MUSB_PORT_SPEED_LOW
  <1115>     DW_AT_const_value : 1
 <2><1116>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1117>     DW_AT_name        : MUSB_PORT_SPEED_FULL
  <112c>     DW_AT_const_value : 2
 <2><112d>: Abbrev Number: 10 (DW_TAG_enumerator)
  <112e>     DW_AT_name        : MUSB_PORT_SPEED_HIGH
  <1143>     DW_AT_const_value : 3
 <1><1145>: Abbrev Number: 2 (DW_TAG_typedef)
  <1146>     DW_AT_name        : MUSB_PortSpeed
  <1155>     DW_AT_decl_file   : 8
  <1156>     DW_AT_decl_line   : 61
  <1157>     DW_AT_type        : <10de>
 <1><115b>: Abbrev Number: 9 (DW_TAG_enumeration_type)
  <115c>     DW_AT_byte_size   : 4
  <115d>     DW_AT_decl_file   : 8
  <115e>     DW_AT_decl_line   : 68
  <115f>     DW_AT_sibling     : <11c5>
 <2><1163>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1164>     DW_AT_name        : MUSB_POWER_OFF
  <1173>     DW_AT_const_value : 0
 <2><1174>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1175>     DW_AT_name        : MUSB_POWERED
  <1182>     DW_AT_const_value : 1
 <2><1183>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1184>     DW_AT_name        : MUSB_DEFAULT
  <1191>     DW_AT_const_value : 2
 <2><1192>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1193>     DW_AT_name        : MUSB_ADDRESS
  <11a0>     DW_AT_const_value : 3
 <2><11a1>: Abbrev Number: 10 (DW_TAG_enumerator)
  <11a2>     DW_AT_name        : MUSB_CONFIGURED
  <11b2>     DW_AT_const_value : 4
 <2><11b3>: Abbrev Number: 10 (DW_TAG_enumerator)
  <11b4>     DW_AT_name        : MUSB_SUSPENDED
  <11c3>     DW_AT_const_value : 5
 <1><11c5>: Abbrev Number: 2 (DW_TAG_typedef)
  <11c6>     DW_AT_name        : MUSB_State
  <11d1>     DW_AT_decl_file   : 8
  <11d2>     DW_AT_decl_line   : 81
  <11d3>     DW_AT_type        : <115b>
 <1><11d7>: Abbrev Number: 9 (DW_TAG_enumeration_type)
  <11d8>     DW_AT_byte_size   : 4
  <11d9>     DW_AT_decl_file   : 8
  <11da>     DW_AT_decl_line   : 88
  <11db>     DW_AT_sibling     : <12a2>
 <2><11df>: Abbrev Number: 10 (DW_TAG_enumerator)
  <11e0>     DW_AT_name        : MUSB_AB_IDLE
  <11ed>     DW_AT_const_value : 0
 <2><11ee>: Abbrev Number: 10 (DW_TAG_enumerator)
  <11ef>     DW_AT_name        : MUSB_WAIT_VRISE
  <11ff>     DW_AT_const_value : 1
 <2><1200>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1201>     DW_AT_name        : MUSB_B_PERIPHERAL
  <1213>     DW_AT_const_value : 17
 <2><1214>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1215>     DW_AT_name        : MUSB_B_WAIT_ACON
  <1226>     DW_AT_const_value : 18
 <2><1227>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1228>     DW_AT_name        : MUSB_B_HOST
  <1234>     DW_AT_const_value : 19
 <2><1235>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1236>     DW_AT_name        : MUSB_B_SRP_INIT
  <1246>     DW_AT_const_value : 20
 <2><1247>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1248>     DW_AT_name        : MUSB_A_PERIPHERAL
  <125a>     DW_AT_const_value : 33
 <2><125b>: Abbrev Number: 10 (DW_TAG_enumerator)
  <125c>     DW_AT_name        : MUSB_A_WAIT_BCON
  <126d>     DW_AT_const_value : 34
 <2><126e>: Abbrev Number: 10 (DW_TAG_enumerator)
  <126f>     DW_AT_name        : MUSB_A_HOST
  <127b>     DW_AT_const_value : 35
 <2><127c>: Abbrev Number: 10 (DW_TAG_enumerator)
  <127d>     DW_AT_name        : MUSB_A_SUSPEND
  <128c>     DW_AT_const_value : 36
 <2><128d>: Abbrev Number: 10 (DW_TAG_enumerator)
  <128e>     DW_AT_name        : MUSB_S_TRANSITION
  <12a0>     DW_AT_const_value : 48
 <1><12a2>: Abbrev Number: 2 (DW_TAG_typedef)
  <12a3>     DW_AT_name        : MUSB_OtgState
  <12b1>     DW_AT_decl_file   : 8
  <12b2>     DW_AT_decl_line   : 111
  <12b3>     DW_AT_type        : <11d7>
 <1><12b7>: Abbrev Number: 9 (DW_TAG_enumeration_type)
  <12b8>     DW_AT_byte_size   : 4
  <12b9>     DW_AT_decl_file   : 8
  <12ba>     DW_AT_decl_line   : 118
  <12bb>     DW_AT_sibling     : <1336>
 <2><12bf>: Abbrev Number: 10 (DW_TAG_enumerator)
  <12c0>     DW_AT_name        : MUSB_CONNECTION_SPEED_UNKNOWN
  <12de>     DW_AT_const_value : 0
 <2><12df>: Abbrev Number: 10 (DW_TAG_enumerator)
  <12e0>     DW_AT_name        : MUSB_CONNECTION_SPEED_LOW
  <12fa>     DW_AT_const_value : 1
 <2><12fb>: Abbrev Number: 10 (DW_TAG_enumerator)
  <12fc>     DW_AT_name        : MUSB_CONNECTION_SPEED_FULL
  <1317>     DW_AT_const_value : 2
 <2><1318>: Abbrev Number: 10 (DW_TAG_enumerator)
  <1319>     DW_AT_name        : MUSB_CONNECTION_SPEED_HIGH
  <1334>     DW_AT_const_value : 3
 <1><1336>: Abbrev Number: 2 (DW_TAG_typedef)
  <1337>     DW_AT_name        : MUSB_ConnectionSpeed
  <134c>     DW_AT_decl_file   : 8
  <134d>     DW_AT_decl_line   : 127
  <134e>     DW_AT_type        : <12b7>
 <1><1352>: Abbrev Number: 11 (DW_TAG_structure_type)
  <1353>     DW_AT_byte_size   : 16
  <1354>     DW_AT_decl_file   : 8
  <1355>     DW_AT_decl_line   : 228
  <1356>     DW_AT_sibling     : <139c>
 <2><135a>: Abbrev Number: 20 (DW_TAG_member)
  <135b>     DW_AT_name        : (indirect string, offset: 0x104): pPrivateData
  <135f>     DW_AT_decl_file   : 8
  <1360>     DW_AT_decl_line   : 229
  <1361>     DW_AT_type        : <f1>
  <1365>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1368>: Abbrev Number: 12 (DW_TAG_member)
  <1369>     DW_AT_name        : bcdCdiRev
  <1373>     DW_AT_decl_file   : 8
  <1374>     DW_AT_decl_line   : 230
  <1375>     DW_AT_type        : <16f>
  <1379>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><137c>: Abbrev Number: 12 (DW_TAG_member)
  <137d>     DW_AT_name        : Type
  <1382>     DW_AT_decl_file   : 8
  <1383>     DW_AT_decl_line   : 231
  <1384>     DW_AT_type        : <10c9>
  <1388>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><138b>: Abbrev Number: 12 (DW_TAG_member)
  <138c>     DW_AT_name        : Speed
  <1392>     DW_AT_decl_file   : 8
  <1393>     DW_AT_decl_line   : 232
  <1394>     DW_AT_type        : <1145>
  <1398>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <1><139c>: Abbrev Number: 2 (DW_TAG_typedef)
  <139d>     DW_AT_name        : MUSB_Port
  <13a7>     DW_AT_decl_file   : 8
  <13a8>     DW_AT_decl_line   : 233
  <13a9>     DW_AT_type        : <1352>
 <1><13ad>: Abbrev Number: 24 (DW_TAG_structure_type)
  <13ae>     DW_AT_name        : _MUSB_Device
  <13bb>     DW_AT_byte_size   : 64
  <13bc>     DW_AT_decl_file   : 8
  <13bd>     DW_AT_decl_line   : 235
  <13be>     DW_AT_sibling     : <14d1>
 <2><13c2>: Abbrev Number: 23 (DW_TAG_member)
  <13c3>     DW_AT_name        : (indirect string, offset: 0x17a): pPort
  <13c7>     DW_AT_decl_file   : 8
  <13c8>     DW_AT_decl_line   : 270
  <13ca>     DW_AT_type        : <14d1>
  <13ce>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><13d1>: Abbrev Number: 23 (DW_TAG_member)
  <13d2>     DW_AT_name        : (indirect string, offset: 0x104): pPrivateData
  <13d6>     DW_AT_decl_file   : 8
  <13d7>     DW_AT_decl_line   : 271
  <13d9>     DW_AT_type        : <f1>
  <13dd>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><13e0>: Abbrev Number: 13 (DW_TAG_member)
  <13e1>     DW_AT_name        : pDriverPrivateData
  <13f4>     DW_AT_decl_file   : 8
  <13f5>     DW_AT_decl_line   : 272
  <13f7>     DW_AT_type        : <f1>
  <13fb>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><13fe>: Abbrev Number: 13 (DW_TAG_member)
  <13ff>     DW_AT_name        : DeviceDescriptor
  <1410>     DW_AT_decl_file   : 8
  <1411>     DW_AT_decl_line   : 273
  <1413>     DW_AT_type        : <e9d>
  <1417>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><141a>: Abbrev Number: 13 (DW_TAG_member)
  <141b>     DW_AT_name        : pCurrentConfiguration
  <1431>     DW_AT_decl_file   : 8
  <1432>     DW_AT_decl_line   : 274
  <1434>     DW_AT_type        : <14d7>
  <1438>     DW_AT_data_member_location: 2 byte block: 23 20    (DW_OP_plus_uconst: 32)
 <2><143b>: Abbrev Number: 23 (DW_TAG_member)
  <143c>     DW_AT_name        : (indirect string, offset: 0x9b): apConfigDescriptors
  <1440>     DW_AT_decl_file   : 8
  <1441>     DW_AT_decl_line   : 275
  <1443>     DW_AT_type        : <14dd>
  <1447>     DW_AT_data_member_location: 2 byte block: 23 24    (DW_OP_plus_uconst: 36)
 <2><144a>: Abbrev Number: 13 (DW_TAG_member)
  <144b>     DW_AT_name        : pDescriptorBuffer
  <145d>     DW_AT_decl_file   : 8
  <145e>     DW_AT_decl_line   : 276
  <1460>     DW_AT_type        : <14e3>
  <1464>     DW_AT_data_member_location: 2 byte block: 23 28    (DW_OP_plus_uconst: 40)
 <2><1467>: Abbrev Number: 23 (DW_TAG_member)
  <1468>     DW_AT_name        : (indirect string, offset: 0x191): wDescriptorBufferLength
  <146c>     DW_AT_decl_file   : 8
  <146d>     DW_AT_decl_line   : 277
  <146f>     DW_AT_type        : <16f>
  <1473>     DW_AT_data_member_location: 2 byte block: 23 2c    (DW_OP_plus_uconst: 44)
 <2><1476>: Abbrev Number: 13 (DW_TAG_member)
  <1477>     DW_AT_name        : ConnectionSpeed
  <1487>     DW_AT_decl_file   : 8
  <1488>     DW_AT_decl_line   : 278
  <148a>     DW_AT_type        : <1336>
  <148e>     DW_AT_data_member_location: 2 byte block: 23 30    (DW_OP_plus_uconst: 48)
 <2><1491>: Abbrev Number: 23 (DW_TAG_member)
  <1492>     DW_AT_name        : (indirect string, offset: 0x24): bBusAddress
  <1496>     DW_AT_decl_file   : 8
  <1497>     DW_AT_decl_line   : 279
  <1499>     DW_AT_type        : <160>
  <149d>     DW_AT_data_member_location: 2 byte block: 23 34    (DW_OP_plus_uconst: 52)
 <2><14a0>: Abbrev Number: 13 (DW_TAG_member)
  <14a1>     DW_AT_name        : pParentUsbDevice
  <14b2>     DW_AT_decl_file   : 8
  <14b3>     DW_AT_decl_line   : 280
  <14b5>     DW_AT_type        : <14e9>
  <14b9>     DW_AT_data_member_location: 2 byte block: 23 38    (DW_OP_plus_uconst: 56)
 <2><14bc>: Abbrev Number: 13 (DW_TAG_member)
  <14bd>     DW_AT_name        : bHubPort
  <14c6>     DW_AT_decl_file   : 8
  <14c7>     DW_AT_decl_line   : 281
  <14c9>     DW_AT_type        : <160>
  <14cd>     DW_AT_data_member_location: 2 byte block: 23 3c    (DW_OP_plus_uconst: 60)
 <1><14d1>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <14d2>     DW_AT_byte_size   : 4
  <14d3>     DW_AT_type        : <139c>
 <1><14d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <14d8>     DW_AT_byte_size   : 4
  <14d9>     DW_AT_type        : <ff1>
 <1><14dd>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <14de>     DW_AT_byte_size   : 4
  <14df>     DW_AT_type        : <14d7>
 <1><14e3>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <14e4>     DW_AT_byte_size   : 4
  <14e5>     DW_AT_type        : <160>
 <1><14e9>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <14ea>     DW_AT_byte_size   : 4
  <14eb>     DW_AT_type        : <13ad>
 <1><14ef>: Abbrev Number: 17 (DW_TAG_typedef)
  <14f0>     DW_AT_name        : MUSB_Device
  <14fc>     DW_AT_decl_file   : 8
  <14fd>     DW_AT_decl_line   : 282
  <14ff>     DW_AT_type        : <13ad>
 <1><1503>: Abbrev Number: 17 (DW_TAG_typedef)
  <1504>     DW_AT_name        : MUSB_BusHandle
  <1513>     DW_AT_decl_file   : 8
  <1514>     DW_AT_decl_line   : 285
  <1516>     DW_AT_type        : <f1>
 <1><151a>: Abbrev Number: 22 (DW_TAG_structure_type)
  <151b>     DW_AT_byte_size   : 16
  <151c>     DW_AT_decl_file   : 8
  <151d>     DW_AT_decl_line   : 301
  <151f>     DW_AT_sibling     : <1561>
 <2><1523>: Abbrev Number: 23 (DW_TAG_member)
  <1524>     DW_AT_name        : (indirect string, offset: 0x180): pDevice
  <1528>     DW_AT_decl_file   : 8
  <1529>     DW_AT_decl_line   : 302
  <152b>     DW_AT_type        : <1561>
  <152f>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1532>: Abbrev Number: 13 (DW_TAG_member)
  <1533>     DW_AT_name        : UsbDescriptor
  <1541>     DW_AT_decl_file   : 8
  <1542>     DW_AT_decl_line   : 303
  <1544>     DW_AT_type        : <f24>
  <1548>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><154b>: Abbrev Number: 13 (DW_TAG_member)
  <154c>     DW_AT_name        : wNakLimit
  <1556>     DW_AT_decl_file   : 8
  <1557>     DW_AT_decl_line   : 304
  <1559>     DW_AT_type        : <16f>
  <155d>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <1><1561>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1562>     DW_AT_byte_size   : 4
  <1563>     DW_AT_type        : <1567>
 <1><1567>: Abbrev Number: 8 (DW_TAG_const_type)
  <1568>     DW_AT_type        : <14ef>
 <1><156c>: Abbrev Number: 17 (DW_TAG_typedef)
  <156d>     DW_AT_name        : MUSB_DeviceEndpoint
  <1581>     DW_AT_decl_file   : 8
  <1582>     DW_AT_decl_line   : 305
  <1584>     DW_AT_type        : <151a>
 <1><1588>: Abbrev Number: 22 (DW_TAG_structure_type)
  <1589>     DW_AT_byte_size   : 12
  <158a>     DW_AT_decl_file   : 8
  <158b>     DW_AT_decl_line   : 321
  <158d>     DW_AT_sibling     : <15cc>
 <2><1591>: Abbrev Number: 13 (DW_TAG_member)
  <1592>     DW_AT_name        : dwBufferSize
  <159f>     DW_AT_decl_file   : 8
  <15a0>     DW_AT_decl_line   : 322
  <15a2>     DW_AT_type        : <18e>
  <15a6>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><15a9>: Abbrev Number: 13 (DW_TAG_member)
  <15aa>     DW_AT_name        : bmFlags
  <15b2>     DW_AT_decl_file   : 8
  <15b3>     DW_AT_decl_line   : 323
  <15b5>     DW_AT_type        : <18e>
  <15b9>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><15bc>: Abbrev Number: 23 (DW_TAG_member)
  <15bd>     DW_AT_name        : (indirect string, offset: 0x104): pPrivateData
  <15c1>     DW_AT_decl_file   : 8
  <15c2>     DW_AT_decl_line   : 324
  <15c4>     DW_AT_type        : <f1>
  <15c8>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <1><15cc>: Abbrev Number: 17 (DW_TAG_typedef)
  <15cd>     DW_AT_name        : MUSB_EndpointResource
  <15e3>     DW_AT_decl_file   : 8
  <15e4>     DW_AT_decl_line   : 325
  <15e6>     DW_AT_type        : <1588>
 <1><15ea>: Abbrev Number: 17 (DW_TAG_typedef)
  <15eb>     DW_AT_name        : MUSB_Pipe
  <15f5>     DW_AT_decl_file   : 8
  <15f6>     DW_AT_decl_line   : 338
  <15f8>     DW_AT_type        : <f1>
 <1><15fc>: Abbrev Number: 17 (DW_TAG_typedef)
  <15fd>     DW_AT_name        : MUSB_pfControlIrpComplete
  <1617>     DW_AT_decl_file   : 8
  <1618>     DW_AT_decl_line   : 348
  <161a>     DW_AT_type        : <161e>
 <1><161e>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <161f>     DW_AT_byte_size   : 4
  <1620>     DW_AT_type        : <1624>
 <1><1624>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <1625>     DW_AT_prototyped  : 1
  <1626>     DW_AT_sibling     : <1635>
 <2><162a>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <162b>     DW_AT_type        : <f1>
 <2><162f>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1630>     DW_AT_type        : <1635>
 <1><1635>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1636>     DW_AT_byte_size   : 4
  <1637>     DW_AT_type        : <163b>
 <1><163b>: Abbrev Number: 18 (DW_TAG_structure_type)
  <163c>     DW_AT_name        : _MUSB_ControlIrp
  <164d>     DW_AT_byte_size   : 44
  <164e>     DW_AT_decl_file   : 8
  <164f>     DW_AT_decl_line   : 340
  <1651>     DW_AT_sibling     : <1732>
 <2><1655>: Abbrev Number: 23 (DW_TAG_member)
  <1656>     DW_AT_name        : (indirect string, offset: 0x180): pDevice
  <165a>     DW_AT_decl_file   : 8
  <165b>     DW_AT_decl_line   : 379
  <165d>     DW_AT_type        : <1561>
  <1661>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1664>: Abbrev Number: 13 (DW_TAG_member)
  <1665>     DW_AT_name        : pOutBuffer
  <1670>     DW_AT_decl_file   : 8
  <1671>     DW_AT_decl_line   : 380
  <1673>     DW_AT_type        : <b51>
  <1677>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><167a>: Abbrev Number: 13 (DW_TAG_member)
  <167b>     DW_AT_name        : dwOutLength
  <1687>     DW_AT_decl_file   : 8
  <1688>     DW_AT_decl_line   : 381
  <168a>     DW_AT_type        : <18e>
  <168e>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><1691>: Abbrev Number: 13 (DW_TAG_member)
  <1692>     DW_AT_name        : pInBuffer
  <169c>     DW_AT_decl_file   : 8
  <169d>     DW_AT_decl_line   : 382
  <169f>     DW_AT_type        : <14e3>
  <16a3>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><16a6>: Abbrev Number: 13 (DW_TAG_member)
  <16a7>     DW_AT_name        : dwInLength
  <16b2>     DW_AT_decl_file   : 8
  <16b3>     DW_AT_decl_line   : 383
  <16b5>     DW_AT_type        : <18e>
  <16b9>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><16bc>: Abbrev Number: 23 (DW_TAG_member)
  <16bd>     DW_AT_name        : (indirect string, offset: 0x30): dwStatus
  <16c1>     DW_AT_decl_file   : 8
  <16c2>     DW_AT_decl_line   : 384
  <16c4>     DW_AT_type        : <18e>
  <16c8>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <2><16cb>: Abbrev Number: 13 (DW_TAG_member)
  <16cc>     DW_AT_name        : dwActualOutLength
  <16de>     DW_AT_decl_file   : 8
  <16df>     DW_AT_decl_line   : 385
  <16e1>     DW_AT_type        : <18e>
  <16e5>     DW_AT_data_member_location: 2 byte block: 23 18    (DW_OP_plus_uconst: 24)
 <2><16e8>: Abbrev Number: 13 (DW_TAG_member)
  <16e9>     DW_AT_name        : dwActualInLength
  <16fa>     DW_AT_decl_file   : 8
  <16fb>     DW_AT_decl_line   : 386
  <16fd>     DW_AT_type        : <18e>
  <1701>     DW_AT_data_member_location: 2 byte block: 23 1c    (DW_OP_plus_uconst: 28)
 <2><1704>: Abbrev Number: 23 (DW_TAG_member)
  <1705>     DW_AT_name        : (indirect string, offset: 0x1c6): pfIrpComplete
  <1709>     DW_AT_decl_file   : 8
  <170a>     DW_AT_decl_line   : 387
  <170c>     DW_AT_type        : <15fc>
  <1710>     DW_AT_data_member_location: 2 byte block: 23 20    (DW_OP_plus_uconst: 32)
 <2><1713>: Abbrev Number: 23 (DW_TAG_member)
  <1714>     DW_AT_name        : (indirect string, offset: 0xc): pCompleteParam
  <1718>     DW_AT_decl_file   : 8
  <1719>     DW_AT_decl_line   : 388
  <171b>     DW_AT_type        : <f1>
  <171f>     DW_AT_data_member_location: 2 byte block: 23 24    (DW_OP_plus_uconst: 36)
 <2><1722>: Abbrev Number: 23 (DW_TAG_member)
  <1723>     DW_AT_name        : (indirect string, offset: 0xf0): bAllowDma
  <1727>     DW_AT_decl_file   : 8
  <1728>     DW_AT_decl_line   : 389
  <172a>     DW_AT_type        : <160>
  <172e>     DW_AT_data_member_location: 2 byte block: 23 28    (DW_OP_plus_uconst: 40)
 <1><1732>: Abbrev Number: 17 (DW_TAG_typedef)
  <1733>     DW_AT_name        : MUSB_ControlIrp
  <1743>     DW_AT_decl_file   : 8
  <1744>     DW_AT_decl_line   : 390
  <1746>     DW_AT_type        : <163b>
 <1><174a>: Abbrev Number: 17 (DW_TAG_typedef)
  <174b>     DW_AT_name        : MUSB_pfIrpComplete
  <175e>     DW_AT_decl_file   : 8
  <175f>     DW_AT_decl_line   : 400
  <1761>     DW_AT_type        : <1765>
 <1><1765>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1766>     DW_AT_byte_size   : 4
  <1767>     DW_AT_type        : <176b>
 <1><176b>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <176c>     DW_AT_prototyped  : 1
  <176d>     DW_AT_sibling     : <177c>
 <2><1771>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1772>     DW_AT_type        : <f1>
 <2><1776>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1777>     DW_AT_type        : <177c>
 <1><177c>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <177d>     DW_AT_byte_size   : 4
  <177e>     DW_AT_type        : <1782>
 <1><1782>: Abbrev Number: 18 (DW_TAG_structure_type)
  <1783>     DW_AT_name        : _MUSB_Irp
  <178d>     DW_AT_byte_size   : 32
  <178e>     DW_AT_decl_file   : 8
  <178f>     DW_AT_decl_line   : 392
  <1791>     DW_AT_sibling     : <1847>
 <2><1795>: Abbrev Number: 13 (DW_TAG_member)
  <1796>     DW_AT_name        : hPipe
  <179c>     DW_AT_decl_file   : 8
  <179d>     DW_AT_decl_line   : 431
  <179f>     DW_AT_type        : <15ea>
  <17a3>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><17a6>: Abbrev Number: 13 (DW_TAG_member)
  <17a7>     DW_AT_name        : pBuffer
  <17af>     DW_AT_decl_file   : 8
  <17b0>     DW_AT_decl_line   : 432
  <17b2>     DW_AT_type        : <14e3>
  <17b6>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><17b9>: Abbrev Number: 13 (DW_TAG_member)
  <17ba>     DW_AT_name        : dwLength
  <17c3>     DW_AT_decl_file   : 8
  <17c4>     DW_AT_decl_line   : 433
  <17c6>     DW_AT_type        : <18e>
  <17ca>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><17cd>: Abbrev Number: 23 (DW_TAG_member)
  <17ce>     DW_AT_name        : (indirect string, offset: 0x30): dwStatus
  <17d2>     DW_AT_decl_file   : 8
  <17d3>     DW_AT_decl_line   : 434
  <17d5>     DW_AT_type        : <18e>
  <17d9>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><17dc>: Abbrev Number: 23 (DW_TAG_member)
  <17dd>     DW_AT_name        : (indirect string, offset: 0x156): dwActualLength
  <17e1>     DW_AT_decl_file   : 8
  <17e2>     DW_AT_decl_line   : 435
  <17e4>     DW_AT_type        : <18e>
  <17e8>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><17eb>: Abbrev Number: 23 (DW_TAG_member)
  <17ec>     DW_AT_name        : (indirect string, offset: 0x1c6): pfIrpComplete
  <17f0>     DW_AT_decl_file   : 8
  <17f1>     DW_AT_decl_line   : 436
  <17f3>     DW_AT_type        : <174a>
  <17f7>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <2><17fa>: Abbrev Number: 23 (DW_TAG_member)
  <17fb>     DW_AT_name        : (indirect string, offset: 0xc): pCompleteParam
  <17ff>     DW_AT_decl_file   : 8
  <1800>     DW_AT_decl_line   : 437
  <1802>     DW_AT_type        : <f1>
  <1806>     DW_AT_data_member_location: 2 byte block: 23 18    (DW_OP_plus_uconst: 24)
 <2><1809>: Abbrev Number: 13 (DW_TAG_member)
  <180a>     DW_AT_name        : bAllowShortTransfer
  <181e>     DW_AT_decl_file   : 8
  <181f>     DW_AT_decl_line   : 438
  <1821>     DW_AT_type        : <160>
  <1825>     DW_AT_data_member_location: 2 byte block: 23 1c    (DW_OP_plus_uconst: 28)
 <2><1828>: Abbrev Number: 23 (DW_TAG_member)
  <1829>     DW_AT_name        : (indirect string, offset: 0x43): bIsrCallback
  <182d>     DW_AT_decl_file   : 8
  <182e>     DW_AT_decl_line   : 439
  <1830>     DW_AT_type        : <160>
  <1834>     DW_AT_data_member_location: 2 byte block: 23 1d    (DW_OP_plus_uconst: 29)
 <2><1837>: Abbrev Number: 23 (DW_TAG_member)
  <1838>     DW_AT_name        : (indirect string, offset: 0xf0): bAllowDma
  <183c>     DW_AT_decl_file   : 8
  <183d>     DW_AT_decl_line   : 440
  <183f>     DW_AT_type        : <160>
  <1843>     DW_AT_data_member_location: 2 byte block: 23 1e    (DW_OP_plus_uconst: 30)
 <1><1847>: Abbrev Number: 17 (DW_TAG_typedef)
  <1848>     DW_AT_name        : MUSB_Irp
  <1851>     DW_AT_decl_file   : 8
  <1852>     DW_AT_decl_line   : 441
  <1854>     DW_AT_type        : <1782>
 <1><1858>: Abbrev Number: 17 (DW_TAG_typedef)
  <1859>     DW_AT_name        : MUSB_pfIsochIrpComplete
  <1871>     DW_AT_decl_file   : 8
  <1872>     DW_AT_decl_line   : 451
  <1874>     DW_AT_type        : <1878>
 <1><1878>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1879>     DW_AT_byte_size   : 4
  <187a>     DW_AT_type        : <187e>
 <1><187e>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <187f>     DW_AT_prototyped  : 1
  <1880>     DW_AT_sibling     : <188f>
 <2><1884>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1885>     DW_AT_type        : <f1>
 <2><1889>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <188a>     DW_AT_type        : <188f>
 <1><188f>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1890>     DW_AT_byte_size   : 4
  <1891>     DW_AT_type        : <1895>
 <1><1895>: Abbrev Number: 18 (DW_TAG_structure_type)
  <1896>     DW_AT_name        : _MUSB_IsochIrp
  <18a5>     DW_AT_byte_size   : 36
  <18a6>     DW_AT_decl_file   : 8
  <18a7>     DW_AT_decl_line   : 443
  <18a9>     DW_AT_sibling     : <19a0>
 <2><18ad>: Abbrev Number: 13 (DW_TAG_member)
  <18ae>     DW_AT_name        : hPipe
  <18b4>     DW_AT_decl_file   : 8
  <18b5>     DW_AT_decl_line   : 488
  <18b7>     DW_AT_type        : <15ea>
  <18bb>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><18be>: Abbrev Number: 13 (DW_TAG_member)
  <18bf>     DW_AT_name        : pBuffer
  <18c7>     DW_AT_decl_file   : 8
  <18c8>     DW_AT_decl_line   : 489
  <18ca>     DW_AT_type        : <14e3>
  <18ce>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><18d1>: Abbrev Number: 13 (DW_TAG_member)
  <18d2>     DW_AT_name        : adwLength
  <18dc>     DW_AT_decl_file   : 8
  <18dd>     DW_AT_decl_line   : 490
  <18df>     DW_AT_type        : <19a0>
  <18e3>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><18e6>: Abbrev Number: 13 (DW_TAG_member)
  <18e7>     DW_AT_name        : adwStatus
  <18f1>     DW_AT_decl_file   : 8
  <18f2>     DW_AT_decl_line   : 491
  <18f4>     DW_AT_type        : <19a0>
  <18f8>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><18fb>: Abbrev Number: 13 (DW_TAG_member)
  <18fc>     DW_AT_name        : adwActualLength
  <190c>     DW_AT_decl_file   : 8
  <190d>     DW_AT_decl_line   : 492
  <190f>     DW_AT_type        : <19a0>
  <1913>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><1916>: Abbrev Number: 23 (DW_TAG_member)
  <1917>     DW_AT_name        : (indirect string, offset: 0x1c6): pfIrpComplete
  <191b>     DW_AT_decl_file   : 8
  <191c>     DW_AT_decl_line   : 493
  <191e>     DW_AT_type        : <1858>
  <1922>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <2><1925>: Abbrev Number: 23 (DW_TAG_member)
  <1926>     DW_AT_name        : (indirect string, offset: 0xc): pCompleteParam
  <192a>     DW_AT_decl_file   : 8
  <192b>     DW_AT_decl_line   : 494
  <192d>     DW_AT_type        : <f1>
  <1931>     DW_AT_data_member_location: 2 byte block: 23 18    (DW_OP_plus_uconst: 24)
 <2><1934>: Abbrev Number: 13 (DW_TAG_member)
  <1935>     DW_AT_name        : wFrameCount
  <1941>     DW_AT_decl_file   : 8
  <1942>     DW_AT_decl_line   : 495
  <1944>     DW_AT_type        : <16f>
  <1948>     DW_AT_data_member_location: 2 byte block: 23 1c    (DW_OP_plus_uconst: 28)
 <2><194b>: Abbrev Number: 13 (DW_TAG_member)
  <194c>     DW_AT_name        : wCurrentFrame
  <195a>     DW_AT_decl_file   : 8
  <195b>     DW_AT_decl_line   : 496
  <195d>     DW_AT_type        : <16f>
  <1961>     DW_AT_data_member_location: 2 byte block: 23 1e    (DW_OP_plus_uconst: 30)
 <2><1964>: Abbrev Number: 13 (DW_TAG_member)
  <1965>     DW_AT_name        : wCallbackInterval
  <1977>     DW_AT_decl_file   : 8
  <1978>     DW_AT_decl_line   : 497
  <197a>     DW_AT_type        : <16f>
  <197e>     DW_AT_data_member_location: 2 byte block: 23 20    (DW_OP_plus_uconst: 32)
 <2><1981>: Abbrev Number: 23 (DW_TAG_member)
  <1982>     DW_AT_name        : (indirect string, offset: 0x43): bIsrCallback
  <1986>     DW_AT_decl_file   : 8
  <1987>     DW_AT_decl_line   : 498
  <1989>     DW_AT_type        : <160>
  <198d>     DW_AT_data_member_location: 2 byte block: 23 22    (DW_OP_plus_uconst: 34)
 <2><1990>: Abbrev Number: 23 (DW_TAG_member)
  <1991>     DW_AT_name        : (indirect string, offset: 0xf0): bAllowDma
  <1995>     DW_AT_decl_file   : 8
  <1996>     DW_AT_decl_line   : 499
  <1998>     DW_AT_type        : <160>
  <199c>     DW_AT_data_member_location: 2 byte block: 23 23    (DW_OP_plus_uconst: 35)
 <1><19a0>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <19a1>     DW_AT_byte_size   : 4
  <19a2>     DW_AT_type        : <18e>
 <1><19a6>: Abbrev Number: 17 (DW_TAG_typedef)
  <19a7>     DW_AT_name        : MUSB_IsochIrp
  <19b5>     DW_AT_decl_file   : 8
  <19b6>     DW_AT_decl_line   : 500
  <19b8>     DW_AT_type        : <1895>
 <1><19bc>: Abbrev Number: 17 (DW_TAG_typedef)
  <19bd>     DW_AT_name        : MUSB_pfNewUsbState
  <19d0>     DW_AT_decl_file   : 8
  <19d1>     DW_AT_decl_line   : 515
  <19d3>     DW_AT_type        : <19d7>
 <1><19d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <19d8>     DW_AT_byte_size   : 4
  <19d9>     DW_AT_type        : <19dd>
 <1><19dd>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <19de>     DW_AT_prototyped  : 1
  <19df>     DW_AT_sibling     : <19f3>
 <2><19e3>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <19e4>     DW_AT_type        : <f1>
 <2><19e8>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <19e9>     DW_AT_type        : <1503>
 <2><19ed>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <19ee>     DW_AT_type        : <11c5>
 <1><19f3>: Abbrev Number: 17 (DW_TAG_typedef)
  <19f4>     DW_AT_name        : MUSB_pfDeviceRequest
  <1a09>     DW_AT_decl_file   : 8
  <1a0a>     DW_AT_decl_line   : 537
  <1a0c>     DW_AT_type        : <1a10>
 <1><1a10>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1a11>     DW_AT_byte_size   : 4
  <1a12>     DW_AT_type        : <1a16>
 <1><1a16>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <1a17>     DW_AT_prototyped  : 1
  <1a18>     DW_AT_type        : <160>
  <1a1c>     DW_AT_sibling     : <1a3a>
 <2><1a20>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1a21>     DW_AT_type        : <f1>
 <2><1a25>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1a26>     DW_AT_type        : <1503>
 <2><1a2a>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1a2b>     DW_AT_type        : <18e>
 <2><1a2f>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1a30>     DW_AT_type        : <b51>
 <2><1a34>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1a35>     DW_AT_type        : <16f>
 <1><1a3a>: Abbrev Number: 17 (DW_TAG_typedef)
  <1a3b>     DW_AT_name        : MUSB_pfDeviceConfigSelected
  <1a57>     DW_AT_decl_file   : 8
  <1a58>     DW_AT_decl_line   : 567
  <1a5a>     DW_AT_type        : <1a5e>
 <1><1a5e>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1a5f>     DW_AT_byte_size   : 4
  <1a60>     DW_AT_type        : <1a64>
 <1><1a64>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <1a65>     DW_AT_prototyped  : 1
  <1a66>     DW_AT_type        : <160>
  <1a6a>     DW_AT_sibling     : <1a83>
 <2><1a6e>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1a6f>     DW_AT_type        : <f1>
 <2><1a73>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1a74>     DW_AT_type        : <1503>
 <2><1a78>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1a79>     DW_AT_type        : <160>
 <2><1a7d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1a7e>     DW_AT_type        : <1a83>
 <1><1a83>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1a84>     DW_AT_byte_size   : 4
  <1a85>     DW_AT_type        : <15ea>
 <1><1a89>: Abbrev Number: 17 (DW_TAG_typedef)
  <1a8a>     DW_AT_name        : MUSB_pfInterfaceSet
  <1a9e>     DW_AT_decl_file   : 8
  <1a9f>     DW_AT_decl_line   : 598
  <1aa1>     DW_AT_type        : <1aa5>
 <1><1aa5>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1aa6>     DW_AT_byte_size   : 4
  <1aa7>     DW_AT_type        : <1aab>
 <1><1aab>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <1aac>     DW_AT_prototyped  : 1
  <1aad>     DW_AT_type        : <160>
  <1ab1>     DW_AT_sibling     : <1acf>
 <2><1ab5>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1ab6>     DW_AT_type        : <f1>
 <2><1aba>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1abb>     DW_AT_type        : <1503>
 <2><1abf>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1ac0>     DW_AT_type        : <160>
 <2><1ac4>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1ac5>     DW_AT_type        : <160>
 <2><1ac9>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1aca>     DW_AT_type        : <1a83>
 <1><1acf>: Abbrev Number: 22 (DW_TAG_structure_type)
  <1ad0>     DW_AT_byte_size   : 44
  <1ad1>     DW_AT_decl_file   : 8
  <1ad2>     DW_AT_decl_line   : 654
  <1ad4>     DW_AT_sibling     : <1c40>
 <2><1ad8>: Abbrev Number: 23 (DW_TAG_member)
  <1ad9>     DW_AT_name        : (indirect string, offset: 0x104): pPrivateData
  <1add>     DW_AT_decl_file   : 8
  <1ade>     DW_AT_decl_line   : 655
  <1ae0>     DW_AT_type        : <f1>
  <1ae4>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1ae7>: Abbrev Number: 13 (DW_TAG_member)
  <1ae8>     DW_AT_name        : pStandardDescriptors
  <1afd>     DW_AT_decl_file   : 8
  <1afe>     DW_AT_decl_line   : 656
  <1b00>     DW_AT_type        : <b51>
  <1b04>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><1b07>: Abbrev Number: 23 (DW_TAG_member)
  <1b08>     DW_AT_name        : (indirect string, offset: 0x191): wDescriptorBufferLength
  <1b0c>     DW_AT_decl_file   : 8
  <1b0d>     DW_AT_decl_line   : 657
  <1b0f>     DW_AT_type        : <16f>
  <1b13>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><1b16>: Abbrev Number: 13 (DW_TAG_member)
  <1b17>     DW_AT_name        : wStringDescriptorCount
  <1b2e>     DW_AT_decl_file   : 8
  <1b2f>     DW_AT_decl_line   : 658
  <1b31>     DW_AT_type        : <16f>
  <1b35>     DW_AT_data_member_location: 2 byte block: 23 a     (DW_OP_plus_uconst: 10)
 <2><1b38>: Abbrev Number: 13 (DW_TAG_member)
  <1b39>     DW_AT_name        : pHighSpeedDescriptors
  <1b4f>     DW_AT_decl_file   : 8
  <1b50>     DW_AT_decl_line   : 659
  <1b52>     DW_AT_type        : <b51>
  <1b56>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><1b59>: Abbrev Number: 13 (DW_TAG_member)
  <1b5a>     DW_AT_name        : wHighSpeedDescriptorLength
  <1b75>     DW_AT_decl_file   : 8
  <1b76>     DW_AT_decl_line   : 660
  <1b78>     DW_AT_type        : <16f>
  <1b7c>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><1b7f>: Abbrev Number: 13 (DW_TAG_member)
  <1b80>     DW_AT_name        : wControlBufferLength
  <1b95>     DW_AT_decl_file   : 8
  <1b96>     DW_AT_decl_line   : 661
  <1b98>     DW_AT_type        : <16f>
  <1b9c>     DW_AT_data_member_location: 2 byte block: 23 12    (DW_OP_plus_uconst: 18)
 <2><1b9f>: Abbrev Number: 13 (DW_TAG_member)
  <1ba0>     DW_AT_name        : pControlBuffer
  <1baf>     DW_AT_decl_file   : 8
  <1bb0>     DW_AT_decl_line   : 662
  <1bb2>     DW_AT_type        : <14e3>
  <1bb6>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <2><1bb9>: Abbrev Number: 13 (DW_TAG_member)
  <1bba>     DW_AT_name        : pbSelfPowered
  <1bc8>     DW_AT_decl_file   : 8
  <1bc9>     DW_AT_decl_line   : 663
  <1bcb>     DW_AT_type        : <14e3>
  <1bcf>     DW_AT_data_member_location: 2 byte block: 23 18    (DW_OP_plus_uconst: 24)
 <2><1bd2>: Abbrev Number: 13 (DW_TAG_member)
  <1bd3>     DW_AT_name        : pfDeviceRequest
  <1be3>     DW_AT_decl_file   : 8
  <1be4>     DW_AT_decl_line   : 664
  <1be6>     DW_AT_type        : <19f3>
  <1bea>     DW_AT_data_member_location: 2 byte block: 23 1c    (DW_OP_plus_uconst: 28)
 <2><1bed>: Abbrev Number: 13 (DW_TAG_member)
  <1bee>     DW_AT_name        : pfDeviceConfigSelected
  <1c05>     DW_AT_decl_file   : 8
  <1c06>     DW_AT_decl_line   : 665
  <1c08>     DW_AT_type        : <1a3a>
  <1c0c>     DW_AT_data_member_location: 2 byte block: 23 20    (DW_OP_plus_uconst: 32)
 <2><1c0f>: Abbrev Number: 13 (DW_TAG_member)
  <1c10>     DW_AT_name        : pfInterfaceSet
  <1c1f>     DW_AT_decl_file   : 8
  <1c20>     DW_AT_decl_line   : 666
  <1c22>     DW_AT_type        : <1a89>
  <1c26>     DW_AT_data_member_location: 2 byte block: 23 24    (DW_OP_plus_uconst: 36)
 <2><1c29>: Abbrev Number: 13 (DW_TAG_member)
  <1c2a>     DW_AT_name        : pfUsbState
  <1c35>     DW_AT_decl_file   : 8
  <1c36>     DW_AT_decl_line   : 667
  <1c38>     DW_AT_type        : <19bc>
  <1c3c>     DW_AT_data_member_location: 2 byte block: 23 28    (DW_OP_plus_uconst: 40)
 <1><1c40>: Abbrev Number: 17 (DW_TAG_typedef)
  <1c41>     DW_AT_name        : MUSB_FunctionClient
  <1c55>     DW_AT_decl_file   : 8
  <1c56>     DW_AT_decl_line   : 668
  <1c58>     DW_AT_type        : <1acf>
 <1><1c5c>: Abbrev Number: 17 (DW_TAG_typedef)
  <1c5d>     DW_AT_name        : MUSB_pfDeviceConnected
  <1c74>     DW_AT_decl_file   : 8
  <1c75>     DW_AT_decl_line   : 684
  <1c77>     DW_AT_type        : <1c7b>
 <1><1c7b>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1c7c>     DW_AT_byte_size   : 4
  <1c7d>     DW_AT_type        : <1c81>
 <1><1c81>: Abbrev Number: 19 (DW_TAG_subroutine_type)
  <1c82>     DW_AT_prototyped  : 1
  <1c83>     DW_AT_type        : <160>
  <1c87>     DW_AT_sibling     : <1ca0>
 <2><1c8b>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1c8c>     DW_AT_type        : <f1>
 <2><1c90>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1c91>     DW_AT_type        : <1503>
 <2><1c95>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1c96>     DW_AT_type        : <1ca0>
 <2><1c9a>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1c9b>     DW_AT_type        : <b51>
 <1><1ca0>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1ca1>     DW_AT_byte_size   : 4
  <1ca2>     DW_AT_type        : <14ef>
 <1><1ca6>: Abbrev Number: 17 (DW_TAG_typedef)
  <1ca7>     DW_AT_name        : MUSB_pfDeviceDisconnected
  <1cc1>     DW_AT_decl_file   : 8
  <1cc2>     DW_AT_decl_line   : 694
  <1cc4>     DW_AT_type        : <1cc8>
 <1><1cc8>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1cc9>     DW_AT_byte_size   : 4
  <1cca>     DW_AT_type        : <1cce>
 <1><1cce>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <1ccf>     DW_AT_prototyped  : 1
  <1cd0>     DW_AT_sibling     : <1ce4>
 <2><1cd4>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1cd5>     DW_AT_type        : <f1>
 <2><1cd9>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1cda>     DW_AT_type        : <1503>
 <2><1cde>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1cdf>     DW_AT_type        : <1ca0>
 <1><1ce4>: Abbrev Number: 17 (DW_TAG_typedef)
  <1ce5>     DW_AT_name        : MUSB_pfDriverTimerExpired
  <1cff>     DW_AT_decl_file   : 8
  <1d00>     DW_AT_decl_line   : 702
  <1d02>     DW_AT_type        : <1d06>
 <1><1d06>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1d07>     DW_AT_byte_size   : 4
  <1d08>     DW_AT_type        : <1d0c>
 <1><1d0c>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <1d0d>     DW_AT_prototyped  : 1
  <1d0e>     DW_AT_sibling     : <1d1d>
 <2><1d12>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1d13>     DW_AT_type        : <f1>
 <2><1d17>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1d18>     DW_AT_type        : <1503>
 <1><1d1d>: Abbrev Number: 17 (DW_TAG_typedef)
  <1d1e>     DW_AT_name        : MUSB_pfBusSuspended
  <1d32>     DW_AT_decl_file   : 8
  <1d33>     DW_AT_decl_line   : 710
  <1d35>     DW_AT_type        : <1d06>
 <1><1d39>: Abbrev Number: 17 (DW_TAG_typedef)
  <1d3a>     DW_AT_name        : MUSB_pfBusResumed
  <1d4c>     DW_AT_decl_file   : 8
  <1d4d>     DW_AT_decl_line   : 718
  <1d4f>     DW_AT_type        : <1d06>
 <1><1d53>: Abbrev Number: 18 (DW_TAG_structure_type)
  <1d54>     DW_AT_name        : _MUSB_DeviceDriver
  <1d67>     DW_AT_byte_size   : 28
  <1d68>     DW_AT_decl_file   : 8
  <1d69>     DW_AT_decl_line   : 740
  <1d6b>     DW_AT_sibling     : <1e24>
 <2><1d6f>: Abbrev Number: 23 (DW_TAG_member)
  <1d70>     DW_AT_name        : (indirect string, offset: 0x104): pPrivateData
  <1d74>     DW_AT_decl_file   : 8
  <1d75>     DW_AT_decl_line   : 741
  <1d77>     DW_AT_type        : <f1>
  <1d7b>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1d7e>: Abbrev Number: 13 (DW_TAG_member)
  <1d7f>     DW_AT_name        : bTimerCount
  <1d8b>     DW_AT_decl_file   : 8
  <1d8c>     DW_AT_decl_line   : 742
  <1d8e>     DW_AT_type        : <160>
  <1d92>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><1d95>: Abbrev Number: 13 (DW_TAG_member)
  <1d96>     DW_AT_name        : adwTimerResolutions
  <1daa>     DW_AT_decl_file   : 8
  <1dab>     DW_AT_decl_line   : 743
  <1dad>     DW_AT_type        : <19a0>
  <1db1>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><1db4>: Abbrev Number: 13 (DW_TAG_member)
  <1db5>     DW_AT_name        : pfDeviceConnected
  <1dc7>     DW_AT_decl_file   : 8
  <1dc8>     DW_AT_decl_line   : 744
  <1dca>     DW_AT_type        : <1c5c>
  <1dce>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><1dd1>: Abbrev Number: 13 (DW_TAG_member)
  <1dd2>     DW_AT_name        : pfDeviceDisconnected
  <1de7>     DW_AT_decl_file   : 8
  <1de8>     DW_AT_decl_line   : 745
  <1dea>     DW_AT_type        : <1ca6>
  <1dee>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><1df1>: Abbrev Number: 13 (DW_TAG_member)
  <1df2>     DW_AT_name        : pfBusSuspended
  <1e01>     DW_AT_decl_file   : 8
  <1e02>     DW_AT_decl_line   : 746
  <1e04>     DW_AT_type        : <1d1d>
  <1e08>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <2><1e0b>: Abbrev Number: 13 (DW_TAG_member)
  <1e0c>     DW_AT_name        : pfBusResumed
  <1e19>     DW_AT_decl_file   : 8
  <1e1a>     DW_AT_decl_line   : 747
  <1e1c>     DW_AT_type        : <1d39>
  <1e20>     DW_AT_data_member_location: 2 byte block: 23 18    (DW_OP_plus_uconst: 24)
 <1><1e24>: Abbrev Number: 17 (DW_TAG_typedef)
  <1e25>     DW_AT_name        : MUSB_DeviceDriver
  <1e37>     DW_AT_decl_file   : 8
  <1e38>     DW_AT_decl_line   : 748
  <1e3a>     DW_AT_type        : <1d53>
 <1><1e3e>: Abbrev Number: 22 (DW_TAG_structure_type)
  <1e3f>     DW_AT_byte_size   : 16
  <1e40>     DW_AT_decl_file   : 8
  <1e41>     DW_AT_decl_line   : 765
  <1e43>     DW_AT_sibling     : <1ec4>
 <2><1e47>: Abbrev Number: 13 (DW_TAG_member)
  <1e48>     DW_AT_name        : pPeripheralList
  <1e58>     DW_AT_decl_file   : 8
  <1e59>     DW_AT_decl_line   : 766
  <1e5b>     DW_AT_type        : <b51>
  <1e5f>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1e62>: Abbrev Number: 13 (DW_TAG_member)
  <1e63>     DW_AT_name        : wPeripheralListLength
  <1e79>     DW_AT_decl_file   : 8
  <1e7a>     DW_AT_decl_line   : 767
  <1e7c>     DW_AT_type        : <16f>
  <1e80>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><1e83>: Abbrev Number: 13 (DW_TAG_member)
  <1e84>     DW_AT_name        : aDeviceDriverList
  <1e96>     DW_AT_decl_file   : 8
  <1e97>     DW_AT_decl_line   : 768
  <1e99>     DW_AT_type        : <1ec4>
  <1e9d>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><1ea0>: Abbrev Number: 13 (DW_TAG_member)
  <1ea1>     DW_AT_name        : bDeviceDriverListLength
  <1eb9>     DW_AT_decl_file   : 8
  <1eba>     DW_AT_decl_line   : 769
  <1ebc>     DW_AT_type        : <160>
  <1ec0>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <1><1ec4>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1ec5>     DW_AT_byte_size   : 4
  <1ec6>     DW_AT_type        : <1e24>
 <1><1eca>: Abbrev Number: 17 (DW_TAG_typedef)
  <1ecb>     DW_AT_name        : MUSB_HostClient
  <1edb>     DW_AT_decl_file   : 8
  <1edc>     DW_AT_decl_line   : 770
  <1ede>     DW_AT_type        : <1e3e>
 <1><1ee2>: Abbrev Number: 17 (DW_TAG_typedef)
  <1ee3>     DW_AT_name        : MUSB_pfNewOtgState
  <1ef6>     DW_AT_decl_file   : 8
  <1ef7>     DW_AT_decl_line   : 780
  <1ef9>     DW_AT_type        : <1efd>
 <1><1efd>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1efe>     DW_AT_byte_size   : 4
  <1eff>     DW_AT_type        : <1f03>
 <1><1f03>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <1f04>     DW_AT_prototyped  : 1
  <1f05>     DW_AT_sibling     : <1f19>
 <2><1f09>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1f0a>     DW_AT_type        : <f1>
 <2><1f0e>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1f0f>     DW_AT_type        : <1503>
 <2><1f13>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1f14>     DW_AT_type        : <12a2>
 <1><1f19>: Abbrev Number: 17 (DW_TAG_typedef)
  <1f1a>     DW_AT_name        : MUSB_pfOtgError
  <1f2a>     DW_AT_decl_file   : 8
  <1f2b>     DW_AT_decl_line   : 791
  <1f2d>     DW_AT_type        : <1f31>
 <1><1f31>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1f32>     DW_AT_byte_size   : 4
  <1f33>     DW_AT_type        : <1f37>
 <1><1f37>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <1f38>     DW_AT_prototyped  : 1
  <1f39>     DW_AT_sibling     : <1f4d>
 <2><1f3d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1f3e>     DW_AT_type        : <f1>
 <2><1f42>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1f43>     DW_AT_type        : <1503>
 <2><1f47>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1f48>     DW_AT_type        : <18e>
 <1><1f4d>: Abbrev Number: 22 (DW_TAG_structure_type)
  <1f4e>     DW_AT_byte_size   : 16
  <1f4f>     DW_AT_decl_file   : 8
  <1f50>     DW_AT_decl_line   : 809
  <1f52>     DW_AT_sibling     : <1fae>
 <2><1f56>: Abbrev Number: 23 (DW_TAG_member)
  <1f57>     DW_AT_name        : (indirect string, offset: 0x104): pPrivateData
  <1f5b>     DW_AT_decl_file   : 8
  <1f5c>     DW_AT_decl_line   : 810
  <1f5e>     DW_AT_type        : <f1>
  <1f62>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1f65>: Abbrev Number: 13 (DW_TAG_member)
  <1f66>     DW_AT_name        : pbDesireHostRole
  <1f77>     DW_AT_decl_file   : 8
  <1f78>     DW_AT_decl_line   : 811
  <1f7a>     DW_AT_type        : <14e3>
  <1f7e>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><1f81>: Abbrev Number: 13 (DW_TAG_member)
  <1f82>     DW_AT_name        : pfOtgState
  <1f8d>     DW_AT_decl_file   : 8
  <1f8e>     DW_AT_decl_line   : 812
  <1f90>     DW_AT_type        : <1ee2>
  <1f94>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><1f97>: Abbrev Number: 13 (DW_TAG_member)
  <1f98>     DW_AT_name        : pfOtgError
  <1fa3>     DW_AT_decl_file   : 8
  <1fa4>     DW_AT_decl_line   : 813
  <1fa6>     DW_AT_type        : <1f19>
  <1faa>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <1><1fae>: Abbrev Number: 17 (DW_TAG_typedef)
  <1faf>     DW_AT_name        : MUSB_OtgClient
  <1fbe>     DW_AT_decl_file   : 8
  <1fbf>     DW_AT_decl_line   : 814
  <1fc1>     DW_AT_type        : <1f4d>
 <1><1fc5>: Abbrev Number: 17 (DW_TAG_typedef)
  <1fc6>     DW_AT_name        : MUSB_pfHubEnumerationComplete
  <1fe4>     DW_AT_decl_file   : 8
  <1fe5>     DW_AT_decl_line   : 825
  <1fe7>     DW_AT_type        : <1feb>
 <1><1feb>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1fec>     DW_AT_byte_size   : 4
  <1fed>     DW_AT_type        : <1ff1>
 <1><1ff1>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <1ff2>     DW_AT_prototyped  : 1
  <1ff3>     DW_AT_sibling     : <2002>
 <2><1ff7>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1ff8>     DW_AT_type        : <1ca0>
 <2><1ffc>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <1ffd>     DW_AT_type        : <1ca0>
 <1><2002>: Abbrev Number: 11 (DW_TAG_structure_type)
  <2003>     DW_AT_byte_size   : 24
  <2004>     DW_AT_decl_file   : 9
  <2005>     DW_AT_decl_line   : 43
  <2006>     DW_AT_sibling     : <209c>
