
#include <string.h>
#include <fapi/sys_services.h>
#include <fapi/reg_dma.h>
#include <fapi/drv_dma.h>
#include <fapi/drv_usb.h>
#include "musb/usb_ch9.h"
#include "musb/musbhdrc.h"
#include "musb/musbdefs.h"
#include "musb/list_49cd8c.h"
#include "musb/musb_dma.h"
#include "musb/musb.h"


#if 0
 The File Name Table:
  Entry Dir Time    Size    Name
  1 1   0   0   mu_hdr.c
  2 2   0   0   stddef.h
  3 3   0   0   stdint.h
  4 4   0   0   mu_dsi.h
  5 4   0   0   mu_dev.h
  6 4   0   0   mu_cdi.h
  7 4   0   0   mu_list.h
  8 4   0   0   mu_hset.h
  9 4   0   0   mu_dci.h
  10    1   0   0   mu_impl.h
  11    5   0   0   sys_driver.h
  12    5   0   0   sys_services.h
#endif

#if 0
  16076       MGC_HdrcInit
  16192       MGC_HdrcDynamicFifoLocation
  16365       MGC_HdrcIsr
  16588       MGC_HdrcStart
  16689       MGC_HdrcStop
  16775       MGC_HdrcDestroy
  16848       MGC_HdrcReadBusState
  16992       MGC_HdrcProgramBusState
  17175       MGC_HdrcBindEndpoint
  17431       MGC_HdrcStartRx
  17771       MGC_HdrcStartTx
  18154       MGC_HdrcFlushEndpoint
  18343       MGC_HdrcHaltEndpoint
  18514       MGC_HdrcDefaultEndResponse
  18683       MGC_HdrcServiceDefaultEnd
  18901       MGC_HdrcServiceTransmitAvail
  19108       MGC_HdrcServiceReceiveReady
  19566       MGC_HdrcSetPortTestMode
  19707       MGC_HdrcLoadFifo
  19928       MGC_HdrcUnloadFifo
  20130       MGC_HdrcUlpiVbusControl
  20289       MGC_HdrcReadUlpiReg
  20447       MGC_HdrcWriteUlpiReg

  <90>     DW_AT_type        : <94>
 <1><94>: Abbrev Number: 3 (DW_TAG_base_type)
  <95>     DW_AT_byte_size   : 4
  <96>     DW_AT_encoding    : 7    (unsigned)
  <97>     DW_AT_name        : long unsigned int
 <1><a9>: Abbrev Number: 3 (DW_TAG_base_type)
  <aa>     DW_AT_byte_size   : 4
  <ab>     DW_AT_encoding    : 5    (signed)
  <ac>     DW_AT_name        : int
 <1><b0>: Abbrev Number: 3 (DW_TAG_base_type)
  <b1>     DW_AT_byte_size   : 4
  <b2>     DW_AT_encoding    : 5    (signed)
  <b3>     DW_AT_name        : long int
 <1><bc>: Abbrev Number: 3 (DW_TAG_base_type)
  <bd>     DW_AT_byte_size   : 8
  <be>     DW_AT_encoding    : 5    (signed)
  <bf>     DW_AT_name        : long long int
 <1><cd>: Abbrev Number: 3 (DW_TAG_base_type)
  <ce>     DW_AT_byte_size   : 4
  <cf>     DW_AT_encoding    : 7    (unsigned)
  <d0>     DW_AT_name        : unsigned int
 <1><dd>: Abbrev Number: 4 (DW_TAG_base_type)
  <de>     DW_AT_byte_size   : 4
  <df>     DW_AT_encoding    : 7    (unsigned)
 <1><e0>: Abbrev Number: 3 (DW_TAG_base_type)
  <e1>     DW_AT_byte_size   : 1
  <e2>     DW_AT_encoding    : 8    (unsigned char)
  <e3>     DW_AT_name        : unsigned char
 <1><f1>: Abbrev Number: 5 (DW_TAG_pointer_type)
  <f2>     DW_AT_byte_size   : 4
 <1><f3>: Abbrev Number: 6 (DW_TAG_subroutine_type)
  <f4>     DW_AT_prototyped  : 1
 <1><f5>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <f6>     DW_AT_byte_size   : 4
  <f7>     DW_AT_type        : <f3>
 <1><fb>: Abbrev Number: 3 (DW_TAG_base_type)
  <fc>     DW_AT_byte_size   : 2
  <fd>     DW_AT_encoding    : 5    (signed)
  <fe>     DW_AT_name        : short int
 <1><108>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <109>     DW_AT_byte_size   : 4
  <10a>     DW_AT_type        : <10e>
 <1><10e>: Abbrev Number: 3 (DW_TAG_base_type)
  <10f>     DW_AT_byte_size   : 1
  <110>     DW_AT_encoding    : 8   (unsigned char)
  <111>     DW_AT_name        : char
 <1><116>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <117>     DW_AT_byte_size   : 4
  <118>     DW_AT_type        : <11c>
 <1><11c>: Abbrev Number: 8 (DW_TAG_const_type)
  <11d>     DW_AT_type        : <10e>
 <1><121>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <122>     DW_AT_prototyped  : 1
  <123>     DW_AT_type        : <a9>
  <127>     DW_AT_sibling     : <131>
 <2><12b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <12c>     DW_AT_type        : <f1>
 <1><131>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <132>     DW_AT_byte_size   : 4
  <133>     DW_AT_type        : <121>
 <1><137>: Abbrev Number: 3 (DW_TAG_base_type)
  <138>     DW_AT_byte_size   : 2
  <139>     DW_AT_encoding    : 7   (unsigned)
  <13a>     DW_AT_name        : short unsigned int
 <1><14d>: Abbrev Number: 3 (DW_TAG_base_type)
  <14e>     DW_AT_byte_size   : 8
  <14f>     DW_AT_encoding    : 7   (unsigned)
  <150>     DW_AT_name        : long long unsigned int
 <1><167>: Abbrev Number: 3 (DW_TAG_base_type)
  <168>     DW_AT_byte_size   : 1
  <169>     DW_AT_encoding    : 6   (signed char)
  <16a>     DW_AT_name        : signed char
 <1><176>: Abbrev Number: 2 (DW_TAG_typedef)
  <177>     DW_AT_name        : uint8_t
  <17f>     DW_AT_decl_file   : 3
  <180>     DW_AT_decl_line   : 46
  <181>     DW_AT_type        : <e0>
 <1><185>: Abbrev Number: 2 (DW_TAG_typedef)
  <186>     DW_AT_name        : uint16_t
  <18f>     DW_AT_decl_file   : 3
  <190>     DW_AT_decl_line   : 58
  <191>     DW_AT_type        : <137>
 <1><195>: Abbrev Number: 2 (DW_TAG_typedef)
  <196>     DW_AT_name        : int32_t
  <19e>     DW_AT_decl_file   : 3
  <19f>     DW_AT_decl_line   : 83
  <1a0>     DW_AT_type        : <b0>
 <1><1a4>: Abbrev Number: 2 (DW_TAG_typedef)
  <1a5>     DW_AT_name        : uint32_t
  <1ae>     DW_AT_decl_file   : 3
  <1af>     DW_AT_decl_line   : 84
  <1b0>     DW_AT_type        : <94>
 <1><1b4>: Abbrev Number: 2 (DW_TAG_typedef)
  <1b5>     DW_AT_name        : uint64_t
  <1be>     DW_AT_decl_file   : 3
  <1bf>     DW_AT_decl_line   : 124
  <1c0>     DW_AT_type        : <14d>
 <1><1c4>: Abbrev Number: 2 (DW_TAG_typedef)
  <1c5>     DW_AT_name        : uint_fast16_t
  <1d3>     DW_AT_decl_file   : 3
  <1d4>     DW_AT_decl_line   : 170
  <1d5>     DW_AT_type        : <cd>
 <1><1d9>: Abbrev Number: 2 (DW_TAG_typedef)
  <1da>     DW_AT_name        : MUSB_pfControllerIsr
  <1ef>     DW_AT_decl_file   : 4
  <1f0>     DW_AT_decl_line   : 64
  <1f1>     DW_AT_type        : <131>
 <1><1f5>: Abbrev Number: 2 (DW_TAG_typedef)
  <1f6>     DW_AT_name        : MUSB_pfControllerBsr
  <20b>     DW_AT_decl_file   : 4
  <20c>     DW_AT_decl_line   : 75
  <20d>     DW_AT_type        : <211>
 <1><211>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <212>     DW_AT_byte_size   : 4
  <213>     DW_AT_type        : <217>
 <1><217>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <218>     DW_AT_prototyped  : 1
  <219>     DW_AT_sibling     : <223>
 <2><21d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <21e>     DW_AT_type        : <f1>
 <1><223>: Abbrev Number: 2 (DW_TAG_typedef)
  <224>     DW_AT_name        : MUSB_pfTimerExpired
  <238>     DW_AT_decl_file   : 4
  <239>     DW_AT_decl_line   : 88
  <23a>     DW_AT_type        : <23e>
 <1><23e>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <23f>     DW_AT_byte_size   : 4
  <240>     DW_AT_type        : <244>
 <1><244>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <245>     DW_AT_prototyped  : 1
  <246>     DW_AT_sibling     : <255>
 <2><24a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <24b>     DW_AT_type        : <f1>
 <2><24f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <250>     DW_AT_type        : <185>
 <1><255>: Abbrev Number: 12 (DW_TAG_structure_type)
  <256>     DW_AT_byte_size   : 40
  <257>     DW_AT_decl_file   : 4
  <258>     DW_AT_decl_line   : 126
  <259>     DW_AT_sibling     : <32b>
 <2><25d>: Abbrev Number: 13 (DW_TAG_member)
  <25e>     DW_AT_name        : (indirect string, offset: 0x90): wVersion
  <262>     DW_AT_decl_file   : 4
  <263>     DW_AT_decl_line   : 127
  <264>     DW_AT_type        : <185>
  <268>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><26b>: Abbrev Number: 13 (DW_TAG_member)
  <26c>     DW_AT_name        : (indirect string, offset: 0xee): pPrivateData
  <270>     DW_AT_decl_file   : 4
  <271>     DW_AT_decl_line   : 128
  <272>     DW_AT_type        : <f1>
  <276>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><279>: Abbrev Number: 14 (DW_TAG_member)
  <27a>     DW_AT_name        : wQueueLength
  <287>     DW_AT_decl_file   : 4
  <288>     DW_AT_decl_line   : 129
  <289>     DW_AT_type        : <185>
  <28d>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><290>: Abbrev Number: 14 (DW_TAG_member)
  <291>     DW_AT_name        : wQueueItemSize
  <2a0>     DW_AT_decl_file   : 4
  <2a1>     DW_AT_decl_line   : 130
  <2a2>     DW_AT_type        : <185>
  <2a6>     DW_AT_data_member_location: 2 byte block: 23 a  (DW_OP_plus_uconst: 10)
 <2><2a9>: Abbrev Number: 14 (DW_TAG_member)
  <2aa>     DW_AT_name        : wTimerCount
  <2b6>     DW_AT_decl_file   : 4
  <2b7>     DW_AT_decl_line   : 131
  <2b8>     DW_AT_type        : <185>
  <2bc>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <2><2bf>: Abbrev Number: 13 (DW_TAG_member)
  <2c0>     DW_AT_name        : (indirect string, offset: 0x15c): adwTimerResolutions
  <2c4>     DW_AT_decl_file   : 4
  <2c5>     DW_AT_decl_line   : 132
  <2c6>     DW_AT_type        : <32b>
  <2ca>     DW_AT_data_member_location: 2 byte block: 23 10     (DW_OP_plus_uconst: 16)
 <2><2cd>: Abbrev Number: 14 (DW_TAG_member)
  <2ce>     DW_AT_name        : wLockCount
  <2d9>     DW_AT_decl_file   : 4
  <2da>     DW_AT_decl_line   : 133
  <2db>     DW_AT_type        : <185>
  <2df>     DW_AT_data_member_location: 2 byte block: 23 14     (DW_OP_plus_uconst: 20)
 <2><2e2>: Abbrev Number: 14 (DW_TAG_member)
  <2e3>     DW_AT_name        : pfIsr
  <2e9>     DW_AT_decl_file   : 4
  <2ea>     DW_AT_decl_line   : 134
  <2eb>     DW_AT_type        : <1d9>
  <2ef>     DW_AT_data_member_location: 2 byte block: 23 18     (DW_OP_plus_uconst: 24)
 <2><2f2>: Abbrev Number: 14 (DW_TAG_member)
  <2f3>     DW_AT_name        : pIsrParam
  <2fd>     DW_AT_decl_file   : 4
  <2fe>     DW_AT_decl_line   : 135
  <2ff>     DW_AT_type        : <f1>
  <303>     DW_AT_data_member_location: 2 byte block: 23 1c     (DW_OP_plus_uconst: 28)
 <2><306>: Abbrev Number: 14 (DW_TAG_member)
  <307>     DW_AT_name        : pfBsr
  <30d>     DW_AT_decl_file   : 4
  <30e>     DW_AT_decl_line   : 136
  <30f>     DW_AT_type        : <1f5>
  <313>     DW_AT_data_member_location: 2 byte block: 23 20     (DW_OP_plus_uconst: 32)
 <2><316>: Abbrev Number: 14 (DW_TAG_member)
  <317>     DW_AT_name        : pBsrParam
  <321>     DW_AT_decl_file   : 4
  <322>     DW_AT_decl_line   : 137
  <323>     DW_AT_type        : <f1>
  <327>     DW_AT_data_member_location: 2 byte block: 23 24     (DW_OP_plus_uconst: 36)
 <1><32b>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <32c>     DW_AT_byte_size   : 4
  <32d>     DW_AT_type        : <331>
 <1><331>: Abbrev Number: 8 (DW_TAG_const_type)
  <332>     DW_AT_type        : <1a4>
 <1><336>: Abbrev Number: 2 (DW_TAG_typedef)
  <337>     DW_AT_name        : MUSB_Controller
  <347>     DW_AT_decl_file   : 4
  <348>     DW_AT_decl_line   : 138
  <349>     DW_AT_type        : <255>
 <1><34d>: Abbrev Number: 2 (DW_TAG_typedef)
  <34e>     DW_AT_name        : MUSB_pfMessageString
  <363>     DW_AT_decl_file   : 4
  <364>     DW_AT_decl_line   : 154
  <365>     DW_AT_type        : <369>
 <1><369>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <36a>     DW_AT_byte_size   : 4
  <36b>     DW_AT_type        : <36f>
 <1><36f>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <370>     DW_AT_prototyped  : 1
  <371>     DW_AT_type        : <176>
  <375>     DW_AT_sibling     : <389>
 <2><379>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <37a>     DW_AT_type        : <108>
 <2><37e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <37f>     DW_AT_type        : <185>
 <2><383>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <384>     DW_AT_type        : <116>
 <1><389>: Abbrev Number: 2 (DW_TAG_typedef)
  <38a>     DW_AT_name        : MUSB_pfMessageNumber
  <39f>     DW_AT_decl_file   : 4
  <3a0>     DW_AT_decl_line   : 174
  <3a1>     DW_AT_type        : <3a5>
 <1><3a5>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <3a6>     DW_AT_byte_size   : 4
  <3a7>     DW_AT_type        : <3ab>
 <1><3ab>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <3ac>     DW_AT_prototyped  : 1
  <3ad>     DW_AT_type        : <176>
  <3b1>     DW_AT_sibling     : <3cf>
 <2><3b5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <3b6>     DW_AT_type        : <108>
 <2><3ba>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <3bb>     DW_AT_type        : <185>
 <2><3bf>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <3c0>     DW_AT_type        : <1a4>
 <2><3c4>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <3c5>     DW_AT_type        : <176>
 <2><3c9>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <3ca>     DW_AT_type        : <176>
 <1><3cf>: Abbrev Number: 2 (DW_TAG_typedef)
  <3d0>     DW_AT_name        : MUSB_pfGetTime
  <3df>     DW_AT_decl_file   : 4
  <3e0>     DW_AT_decl_line   : 184
  <3e1>     DW_AT_type        : <3e5>
 <1><3e5>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <3e6>     DW_AT_byte_size   : 4
  <3e7>     DW_AT_type        : <3eb>
 <1><3eb>: Abbrev Number: 15 (DW_TAG_subroutine_type)
  <3ec>     DW_AT_prototyped  : 1
  <3ed>     DW_AT_type        : <1a4>
 <1><3f1>: Abbrev Number: 12 (DW_TAG_structure_type)
  <3f2>     DW_AT_byte_size   : 16
  <3f3>     DW_AT_decl_file   : 4
  <3f4>     DW_AT_decl_line   : 208
  <3f5>     DW_AT_sibling     : <450>
 <2><3f9>: Abbrev Number: 13 (DW_TAG_member)
  <3fa>     DW_AT_name        : (indirect string, offset: 0x90): wVersion
  <3fe>     DW_AT_decl_file   : 4
  <3ff>     DW_AT_decl_line   : 209
  <400>     DW_AT_type        : <185>
  <404>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><407>: Abbrev Number: 14 (DW_TAG_member)
  <408>     DW_AT_name        : pfMessageString
  <418>     DW_AT_decl_file   : 4
  <419>     DW_AT_decl_line   : 210
  <41a>     DW_AT_type        : <34d>
  <41e>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><421>: Abbrev Number: 14 (DW_TAG_member)
  <422>     DW_AT_name        : pfMessageNumber
  <432>     DW_AT_decl_file   : 4
  <433>     DW_AT_decl_line   : 211
  <434>     DW_AT_type        : <389>
  <438>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><43b>: Abbrev Number: 14 (DW_TAG_member)
  <43c>     DW_AT_name        : pfGetTime
  <446>     DW_AT_decl_file   : 4
  <447>     DW_AT_decl_line   : 212
  <448>     DW_AT_type        : <3cf>
  <44c>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <1><450>: Abbrev Number: 2 (DW_TAG_typedef)
  <451>     DW_AT_name        : MUSB_SystemUtils
  <462>     DW_AT_decl_file   : 4
  <463>     DW_AT_decl_line   : 213
  <464>     DW_AT_type        : <3f1>
 <1><468>: Abbrev Number: 2 (DW_TAG_typedef)
  <469>     DW_AT_name        : MUSB_pfSystemToBusAddress
  <483>     DW_AT_decl_file   : 4
  <484>     DW_AT_decl_line   : 225
  <485>     DW_AT_type        : <489>
 <1><489>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <48a>     DW_AT_byte_size   : 4
  <48b>     DW_AT_type        : <48f>
 <1><48f>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <490>     DW_AT_prototyped  : 1
  <491>     DW_AT_type        : <f1>
  <495>     DW_AT_sibling     : <4a4>
 <2><499>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <49a>     DW_AT_type        : <f1>
 <2><49e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <49f>     DW_AT_type        : <4a4>
 <1><4a4>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <4a5>     DW_AT_byte_size   : 4
  <4a6>     DW_AT_type        : <4aa>
 <1><4aa>: Abbrev Number: 16 (DW_TAG_const_type)
 <1><4ab>: Abbrev Number: 2 (DW_TAG_typedef)
  <4ac>     DW_AT_name        : MUSB_pfQueueBackgroundItem
  <4c7>     DW_AT_decl_file   : 4
  <4c8>     DW_AT_decl_line   : 238
  <4c9>     DW_AT_type        : <4cd>
 <1><4cd>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <4ce>     DW_AT_byte_size   : 4
  <4cf>     DW_AT_type        : <4d3>
 <1><4d3>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <4d4>     DW_AT_prototyped  : 1
  <4d5>     DW_AT_type        : <176>
  <4d9>     DW_AT_sibling     : <4e8>
 <2><4dd>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <4de>     DW_AT_type        : <f1>
 <2><4e2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <4e3>     DW_AT_type        : <4a4>
 <1><4e8>: Abbrev Number: 2 (DW_TAG_typedef)
  <4e9>     DW_AT_name        : MUSB_pfDequeueBackgroundItem
  <506>     DW_AT_decl_file   : 4
  <507>     DW_AT_decl_line   : 251
  <508>     DW_AT_type        : <50c>
 <1><50c>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <50d>     DW_AT_byte_size   : 4
  <50e>     DW_AT_type        : <512>
 <1><512>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <513>     DW_AT_prototyped  : 1
  <514>     DW_AT_type        : <176>
  <518>     DW_AT_sibling     : <527>
 <2><51c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <51d>     DW_AT_type        : <f1>
 <2><521>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <522>     DW_AT_type        : <f1>
 <1><527>: Abbrev Number: 17 (DW_TAG_typedef)
  <528>     DW_AT_name        : MUSB_pfFlushBackgroundQueue
  <544>     DW_AT_decl_file   : 4
  <545>     DW_AT_decl_line   : 259
  <547>     DW_AT_type        : <211>
 <1><54b>: Abbrev Number: 17 (DW_TAG_typedef)
  <54c>     DW_AT_name        : MUSB_pfArmTimer
  <55c>     DW_AT_decl_file   : 4
  <55d>     DW_AT_decl_line   : 274
  <55f>     DW_AT_type        : <563>
 <1><563>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <564>     DW_AT_byte_size   : 4
  <565>     DW_AT_type        : <569>
 <1><569>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <56a>     DW_AT_prototyped  : 1
  <56b>     DW_AT_type        : <176>
  <56f>     DW_AT_sibling     : <58d>
 <2><573>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <574>     DW_AT_type        : <f1>
 <2><578>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <579>     DW_AT_type        : <185>
 <2><57d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <57e>     DW_AT_type        : <1a4>
 <2><582>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <583>     DW_AT_type        : <176>
 <2><587>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <588>     DW_AT_type        : <223>
 <1><58d>: Abbrev Number: 17 (DW_TAG_typedef)
  <58e>     DW_AT_name        : MUSB_pfCancelTimer
  <5a1>     DW_AT_decl_file   : 4
  <5a2>     DW_AT_decl_line   : 285
  <5a4>     DW_AT_type        : <5a8>
 <1><5a8>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <5a9>     DW_AT_byte_size   : 4
  <5aa>     DW_AT_type        : <5ae>
 <1><5ae>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <5af>     DW_AT_prototyped  : 1
  <5b0>     DW_AT_type        : <176>
  <5b4>     DW_AT_sibling     : <5c3>
 <2><5b8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <5b9>     DW_AT_type        : <f1>
 <2><5bd>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <5be>     DW_AT_type        : <185>
 <1><5c3>: Abbrev Number: 17 (DW_TAG_typedef)
  <5c4>     DW_AT_name        : MUSB_pfLock
  <5d0>     DW_AT_decl_file   : 4
  <5d1>     DW_AT_decl_line   : 296
  <5d3>     DW_AT_type        : <5a8>
 <1><5d7>: Abbrev Number: 17 (DW_TAG_typedef)
  <5d8>     DW_AT_name        : MUSB_pfUnlock
  <5e6>     DW_AT_decl_file   : 4
  <5e7>     DW_AT_decl_line   : 307
  <5e9>     DW_AT_type        : <5a8>
 <1><5ed>: Abbrev Number: 17 (DW_TAG_typedef)
  <5ee>     DW_AT_name        : MUSB_pfPrintDiag
  <5ff>     DW_AT_decl_file   : 4
  <600>     DW_AT_decl_line   : 318
  <602>     DW_AT_type        : <606>
 <1><606>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <607>     DW_AT_byte_size   : 4
  <608>     DW_AT_type        : <60c>
 <1><60c>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <60d>     DW_AT_prototyped  : 1
  <60e>     DW_AT_type        : <176>
  <612>     DW_AT_sibling     : <621>
 <2><616>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <617>     DW_AT_type        : <f1>
 <2><61b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <61c>     DW_AT_type        : <116>
 <1><621>: Abbrev Number: 17 (DW_TAG_typedef)
  <622>     DW_AT_name        : MUSB_pfNewPowerLoad
  <636>     DW_AT_decl_file   : 4
  <637>     DW_AT_decl_line   : 346
  <639>     DW_AT_type        : <63d>
 <1><63d>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <63e>     DW_AT_byte_size   : 4
  <63f>     DW_AT_type        : <643>
 <1><643>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <644>     DW_AT_prototyped  : 1
  <645>     DW_AT_type        : <176>
  <649>     DW_AT_sibling     : <667>
 <2><64d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <64e>     DW_AT_type        : <f1>
 <2><652>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <653>     DW_AT_type        : <185>
 <2><657>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <658>     DW_AT_type        : <176>
 <2><65c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <65d>     DW_AT_type        : <667>
 <2><661>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <662>     DW_AT_type        : <176>
 <1><667>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <668>     DW_AT_byte_size   : 4
  <669>     DW_AT_type        : <66d>
 <1><66d>: Abbrev Number: 8 (DW_TAG_const_type)
  <66e>     DW_AT_type        : <176>
 <1><672>: Abbrev Number: 17 (DW_TAG_typedef)
  <673>     DW_AT_name        : MUSB_pfRemovePowerLoad
  <68a>     DW_AT_decl_file   : 4
  <68b>     DW_AT_decl_line   : 366
  <68d>     DW_AT_type        : <63d>
 <1><691>: Abbrev Number: 18 (DW_TAG_structure_type)
  <692>     DW_AT_byte_size   : 52
  <693>     DW_AT_decl_file   : 4
  <694>     DW_AT_decl_line   : 403
  <696>     DW_AT_sibling     : <7e2>
 <2><69a>: Abbrev Number: 19 (DW_TAG_member)
  <69b>     DW_AT_name        : (indirect string, offset: 0x90): wVersion
  <69f>     DW_AT_decl_file   : 4
  <6a0>     DW_AT_decl_line   : 404
  <6a2>     DW_AT_type        : <185>
  <6a6>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><6a9>: Abbrev Number: 19 (DW_TAG_member)
  <6aa>     DW_AT_name        : (indirect string, offset: 0xee): pPrivateData
  <6ae>     DW_AT_decl_file   : 4
  <6af>     DW_AT_decl_line   : 405
  <6b1>     DW_AT_type        : <f1>
  <6b5>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><6b8>: Abbrev Number: 20 (DW_TAG_member)
  <6b9>     DW_AT_name        : pfSystemToBusAddress
  <6ce>     DW_AT_decl_file   : 4
  <6cf>     DW_AT_decl_line   : 406
  <6d1>     DW_AT_type        : <468>
  <6d5>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><6d8>: Abbrev Number: 20 (DW_TAG_member)
  <6d9>     DW_AT_name        : pfQueueBackgroundItem
  <6ef>     DW_AT_decl_file   : 4
  <6f0>     DW_AT_decl_line   : 407
  <6f2>     DW_AT_type        : <4ab>
  <6f6>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <2><6f9>: Abbrev Number: 20 (DW_TAG_member)
  <6fa>     DW_AT_name        : pfDequeueBackgroundItem
  <712>     DW_AT_decl_file   : 4
  <713>     DW_AT_decl_line   : 408
  <715>     DW_AT_type        : <4e8>
  <719>     DW_AT_data_member_location: 2 byte block: 23 10     (DW_OP_plus_uconst: 16)
 <2><71c>: Abbrev Number: 20 (DW_TAG_member)
  <71d>     DW_AT_name        : pfFlushBackgroundQueue
  <734>     DW_AT_decl_file   : 4
  <735>     DW_AT_decl_line   : 409
  <737>     DW_AT_type        : <527>
  <73b>     DW_AT_data_member_location: 2 byte block: 23 14     (DW_OP_plus_uconst: 20)
 <2><73e>: Abbrev Number: 20 (DW_TAG_member)
  <73f>     DW_AT_name        : pfArmTimer
  <74a>     DW_AT_decl_file   : 4
  <74b>     DW_AT_decl_line   : 410
  <74d>     DW_AT_type        : <54b>
  <751>     DW_AT_data_member_location: 2 byte block: 23 18     (DW_OP_plus_uconst: 24)
 <2><754>: Abbrev Number: 20 (DW_TAG_member)
  <755>     DW_AT_name        : pfCancelTimer
  <763>     DW_AT_decl_file   : 4
  <764>     DW_AT_decl_line   : 411
  <766>     DW_AT_type        : <58d>
  <76a>     DW_AT_data_member_location: 2 byte block: 23 1c     (DW_OP_plus_uconst: 28)
 <2><76d>: Abbrev Number: 20 (DW_TAG_member)
  <76e>     DW_AT_name        : pfLock
  <775>     DW_AT_decl_file   : 4
  <776>     DW_AT_decl_line   : 412
  <778>     DW_AT_type        : <5c3>
  <77c>     DW_AT_data_member_location: 2 byte block: 23 20     (DW_OP_plus_uconst: 32)
 <2><77f>: Abbrev Number: 20 (DW_TAG_member)
  <780>     DW_AT_name        : pfUnlock
  <789>     DW_AT_decl_file   : 4
  <78a>     DW_AT_decl_line   : 413
  <78c>     DW_AT_type        : <5d7>
  <790>     DW_AT_data_member_location: 2 byte block: 23 24     (DW_OP_plus_uconst: 36)
 <2><793>: Abbrev Number: 20 (DW_TAG_member)
  <794>     DW_AT_name        : pfPrintDiag
  <7a0>     DW_AT_decl_file   : 4
  <7a1>     DW_AT_decl_line   : 414
  <7a3>     DW_AT_type        : <5ed>
  <7a7>     DW_AT_data_member_location: 2 byte block: 23 28     (DW_OP_plus_uconst: 40)
 <2><7aa>: Abbrev Number: 20 (DW_TAG_member)
  <7ab>     DW_AT_name        : pfNewPowerLoad
  <7ba>     DW_AT_decl_file   : 4
  <7bb>     DW_AT_decl_line   : 415
  <7bd>     DW_AT_type        : <621>
  <7c1>     DW_AT_data_member_location: 2 byte block: 23 2c     (DW_OP_plus_uconst: 44)
 <2><7c4>: Abbrev Number: 20 (DW_TAG_member)
  <7c5>     DW_AT_name        : pfRemovePowerLoad
  <7d7>     DW_AT_decl_file   : 4
  <7d8>     DW_AT_decl_line   : 416
  <7da>     DW_AT_type        : <672>
  <7de>     DW_AT_data_member_location: 2 byte block: 23 30     (DW_OP_plus_uconst: 48)
 <1><7e2>: Abbrev Number: 17 (DW_TAG_typedef)
  <7e3>     DW_AT_name        : MUSB_SystemServices
  <7f7>     DW_AT_decl_file   : 4
  <7f8>     DW_AT_decl_line   : 417
  <7fa>     DW_AT_type        : <691>
 <1><7fe>: Abbrev Number: 12 (DW_TAG_structure_type)
  <7ff>     DW_AT_byte_size   : 20
  <800>     DW_AT_decl_file   : 5
  <801>     DW_AT_decl_line   : 194
  <802>     DW_AT_sibling     : <934>
 <2><806>: Abbrev Number: 13 (DW_TAG_member)
  <807>     DW_AT_name        : (indirect string, offset: 0x17): bLength
  <80b>     DW_AT_decl_file   : 5
  <80c>     DW_AT_decl_line   : 195
  <80d>     DW_AT_type        : <176>
  <811>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><814>: Abbrev Number: 13 (DW_TAG_member)
  <815>     DW_AT_name        : (indirect string, offset: 0xca): bDescriptorType
  <819>     DW_AT_decl_file   : 5
  <81a>     DW_AT_decl_line   : 196
  <81b>     DW_AT_type        : <176>
  <81f>     DW_AT_data_member_location: 2 byte block: 23 1  (DW_OP_plus_uconst: 1)
 <2><822>: Abbrev Number: 14 (DW_TAG_member)
  <823>     DW_AT_name        : bcdUSB
  <82a>     DW_AT_decl_file   : 5
  <82b>     DW_AT_decl_line   : 197
  <82c>     DW_AT_type        : <185>
  <830>     DW_AT_data_member_location: 2 byte block: 23 2  (DW_OP_plus_uconst: 2)
 <2><833>: Abbrev Number: 14 (DW_TAG_member)
  <834>     DW_AT_name        : bDeviceClass
  <841>     DW_AT_decl_file   : 5
  <842>     DW_AT_decl_line   : 198
  <843>     DW_AT_type        : <176>
  <847>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><84a>: Abbrev Number: 14 (DW_TAG_member)
  <84b>     DW_AT_name        : bDeviceSubClass
  <85b>     DW_AT_decl_file   : 5
  <85c>     DW_AT_decl_line   : 199
  <85d>     DW_AT_type        : <176>
  <861>     DW_AT_data_member_location: 2 byte block: 23 5  (DW_OP_plus_uconst: 5)
 <2><864>: Abbrev Number: 14 (DW_TAG_member)
  <865>     DW_AT_name        : bDeviceProtocol
  <875>     DW_AT_decl_file   : 5
  <876>     DW_AT_decl_line   : 200
  <877>     DW_AT_type        : <176>
  <87b>     DW_AT_data_member_location: 2 byte block: 23 6  (DW_OP_plus_uconst: 6)
 <2><87e>: Abbrev Number: 14 (DW_TAG_member)
  <87f>     DW_AT_name        : bMaxPacketSize0
  <88f>     DW_AT_decl_file   : 5
  <890>     DW_AT_decl_line   : 201
  <891>     DW_AT_type        : <176>
  <895>     DW_AT_data_member_location: 2 byte block: 23 7  (DW_OP_plus_uconst: 7)
 <2><898>: Abbrev Number: 14 (DW_TAG_member)
  <899>     DW_AT_name        : idVendor
  <8a2>     DW_AT_decl_file   : 5
  <8a3>     DW_AT_decl_line   : 202
  <8a4>     DW_AT_type        : <185>
  <8a8>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><8ab>: Abbrev Number: 14 (DW_TAG_member)
  <8ac>     DW_AT_name        : idProduct
  <8b6>     DW_AT_decl_file   : 5
  <8b7>     DW_AT_decl_line   : 203
  <8b8>     DW_AT_type        : <185>
  <8bc>     DW_AT_data_member_location: 2 byte block: 23 a  (DW_OP_plus_uconst: 10)
 <2><8bf>: Abbrev Number: 14 (DW_TAG_member)
  <8c0>     DW_AT_name        : bcdDevice
  <8ca>     DW_AT_decl_file   : 5
  <8cb>     DW_AT_decl_line   : 204
  <8cc>     DW_AT_type        : <185>
  <8d0>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <2><8d3>: Abbrev Number: 14 (DW_TAG_member)
  <8d4>     DW_AT_name        : iManufacturer
  <8e2>     DW_AT_decl_file   : 5
  <8e3>     DW_AT_decl_line   : 205
  <8e4>     DW_AT_type        : <176>
  <8e8>     DW_AT_data_member_location: 2 byte block: 23 e  (DW_OP_plus_uconst: 14)
 <2><8eb>: Abbrev Number: 14 (DW_TAG_member)
  <8ec>     DW_AT_name        : iProduct
  <8f5>     DW_AT_decl_file   : 5
  <8f6>     DW_AT_decl_line   : 206
  <8f7>     DW_AT_type        : <176>
  <8fb>     DW_AT_data_member_location: 2 byte block: 23 f  (DW_OP_plus_uconst: 15)
 <2><8fe>: Abbrev Number: 14 (DW_TAG_member)
  <8ff>     DW_AT_name        : iSerialNumber
  <90d>     DW_AT_decl_file   : 5
  <90e>     DW_AT_decl_line   : 207
  <90f>     DW_AT_type        : <176>
  <913>     DW_AT_data_member_location: 2 byte block: 23 10     (DW_OP_plus_uconst: 16)
 <2><916>: Abbrev Number: 14 (DW_TAG_member)
  <917>     DW_AT_name        : bNumConfigurations
  <92a>     DW_AT_decl_file   : 5
  <92b>     DW_AT_decl_line   : 208
  <92c>     DW_AT_type        : <176>
  <930>     DW_AT_data_member_location: 2 byte block: 23 11     (DW_OP_plus_uconst: 17)
 <1><934>: Abbrev Number: 2 (DW_TAG_typedef)
  <935>     DW_AT_name        : MUSB_DeviceDescriptor
  <94b>     DW_AT_decl_file   : 5
  <94c>     DW_AT_decl_line   : 209
  <94d>     DW_AT_type        : <7fe>
 <1><951>: Abbrev Number: 12 (DW_TAG_structure_type)
  <952>     DW_AT_byte_size   : 8
  <953>     DW_AT_decl_file   : 5
  <954>     DW_AT_decl_line   : 215
  <955>     DW_AT_sibling     : <9bb>
 <2><959>: Abbrev Number: 13 (DW_TAG_member)
  <95a>     DW_AT_name        : (indirect string, offset: 0x17): bLength
  <95e>     DW_AT_decl_file   : 5
  <95f>     DW_AT_decl_line   : 216
  <960>     DW_AT_type        : <176>
  <964>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><967>: Abbrev Number: 13 (DW_TAG_member)
  <968>     DW_AT_name        : (indirect string, offset: 0xca): bDescriptorType
  <96c>     DW_AT_decl_file   : 5
  <96d>     DW_AT_decl_line   : 217
  <96e>     DW_AT_type        : <176>
  <972>     DW_AT_data_member_location: 2 byte block: 23 1  (DW_OP_plus_uconst: 1)
 <2><975>: Abbrev Number: 14 (DW_TAG_member)
  <976>     DW_AT_name        : bEndpointAddress
  <987>     DW_AT_decl_file   : 5
  <988>     DW_AT_decl_line   : 218
  <989>     DW_AT_type        : <176>
  <98d>     DW_AT_data_member_location: 2 byte block: 23 2  (DW_OP_plus_uconst: 2)
 <2><990>: Abbrev Number: 13 (DW_TAG_member)
  <991>     DW_AT_name        : (indirect string, offset: 0x3d): bmAttributes
  <995>     DW_AT_decl_file   : 5
  <996>     DW_AT_decl_line   : 219
  <997>     DW_AT_type        : <176>
  <99b>     DW_AT_data_member_location: 2 byte block: 23 3  (DW_OP_plus_uconst: 3)
 <2><99e>: Abbrev Number: 13 (DW_TAG_member)
  <99f>     DW_AT_name        : (indirect string, offset: 0x2e): wMaxPacketSize
  <9a3>     DW_AT_decl_file   : 5
  <9a4>     DW_AT_decl_line   : 220
  <9a5>     DW_AT_type        : <185>
  <9a9>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><9ac>: Abbrev Number: 13 (DW_TAG_member)
  <9ad>     DW_AT_name        : (indirect string, offset: 0x86): bInterval
  <9b1>     DW_AT_decl_file   : 5
  <9b2>     DW_AT_decl_line   : 221
  <9b3>     DW_AT_type        : <176>
  <9b7>     DW_AT_data_member_location: 2 byte block: 23 6  (DW_OP_plus_uconst: 6)
 <1><9bb>: Abbrev Number: 2 (DW_TAG_typedef)
  <9bc>     DW_AT_name        : MUSB_EndpointDescriptor
  <9d4>     DW_AT_decl_file   : 5
  <9d5>     DW_AT_decl_line   : 222
  <9d6>     DW_AT_type        : <951>
 <1><9da>: Abbrev Number: 12 (DW_TAG_structure_type)
  <9db>     DW_AT_byte_size   : 12
  <9dc>     DW_AT_decl_file   : 5
  <9dd>     DW_AT_decl_line   : 244
  <9de>     DW_AT_sibling     : <a88>
 <2><9e2>: Abbrev Number: 13 (DW_TAG_member)
  <9e3>     DW_AT_name        : (indirect string, offset: 0x17): bLength
  <9e7>     DW_AT_decl_file   : 5
  <9e8>     DW_AT_decl_line   : 245
  <9e9>     DW_AT_type        : <176>
  <9ed>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><9f0>: Abbrev Number: 13 (DW_TAG_member)
  <9f1>     DW_AT_name        : (indirect string, offset: 0xca): bDescriptorType
  <9f5>     DW_AT_decl_file   : 5
  <9f6>     DW_AT_decl_line   : 246
  <9f7>     DW_AT_type        : <176>
  <9fb>     DW_AT_data_member_location: 2 byte block: 23 1  (DW_OP_plus_uconst: 1)
 <2><9fe>: Abbrev Number: 14 (DW_TAG_member)
  <9ff>     DW_AT_name        : wTotalLength
  <a0c>     DW_AT_decl_file   : 5
  <a0d>     DW_AT_decl_line   : 247
  <a0e>     DW_AT_type        : <185>
  <a12>     DW_AT_data_member_location: 2 byte block: 23 2  (DW_OP_plus_uconst: 2)
 <2><a15>: Abbrev Number: 14 (DW_TAG_member)
  <a16>     DW_AT_name        : bNumInterfaces
  <a25>     DW_AT_decl_file   : 5
  <a26>     DW_AT_decl_line   : 248
  <a27>     DW_AT_type        : <176>
  <a2b>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><a2e>: Abbrev Number: 14 (DW_TAG_member)
  <a2f>     DW_AT_name        : bConfigurationValue
  <a43>     DW_AT_decl_file   : 5
  <a44>     DW_AT_decl_line   : 249
  <a45>     DW_AT_type        : <176>
  <a49>     DW_AT_data_member_location: 2 byte block: 23 5  (DW_OP_plus_uconst: 5)
 <2><a4c>: Abbrev Number: 14 (DW_TAG_member)
  <a4d>     DW_AT_name        : iConfiguration
  <a5c>     DW_AT_decl_file   : 5
  <a5d>     DW_AT_decl_line   : 250
  <a5e>     DW_AT_type        : <176>
  <a62>     DW_AT_data_member_location: 2 byte block: 23 6  (DW_OP_plus_uconst: 6)
 <2><a65>: Abbrev Number: 13 (DW_TAG_member)
  <a66>     DW_AT_name        : (indirect string, offset: 0x3d): bmAttributes
  <a6a>     DW_AT_decl_file   : 5
  <a6b>     DW_AT_decl_line   : 251
  <a6c>     DW_AT_type        : <176>
  <a70>     DW_AT_data_member_location: 2 byte block: 23 7  (DW_OP_plus_uconst: 7)
 <2><a73>: Abbrev Number: 14 (DW_TAG_member)
  <a74>     DW_AT_name        : bMaxPower
  <a7e>     DW_AT_decl_file   : 5
  <a7f>     DW_AT_decl_line   : 252
  <a80>     DW_AT_type        : <176>
  <a84>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <1><a88>: Abbrev Number: 2 (DW_TAG_typedef)
  <a89>     DW_AT_name        : MUSB_ConfigurationDescriptor
  <aa6>     DW_AT_decl_file   : 5
  <aa7>     DW_AT_decl_line   : 253
  <aa8>     DW_AT_type        : <9da>
 <1><aac>: Abbrev Number: 21 (DW_TAG_enumeration_type)
  <aad>     DW_AT_byte_size   : 4
  <aae>     DW_AT_decl_file   : 6
  <aaf>     DW_AT_decl_line   : 36
  <ab0>     DW_AT_sibling     : <b0e>
 <2><ab4>: Abbrev Number: 22 (DW_TAG_enumerator)
  <ab5>     DW_AT_name        : MUSB_PORT_UNKNOWN
  <ac7>     DW_AT_const_value : 0
 <2><ac8>: Abbrev Number: 22 (DW_TAG_enumerator)
  <ac9>     DW_AT_name        : MUSB_PORT_TYPE_FUNCTION
  <ae1>     DW_AT_const_value : 1
 <2><ae2>: Abbrev Number: 22 (DW_TAG_enumerator)
  <ae3>     DW_AT_name        : MUSB_PORT_TYPE_HOST
  <af7>     DW_AT_const_value : 2
 <2><af8>: Abbrev Number: 22 (DW_TAG_enumerator)
  <af9>     DW_AT_name        : MUSB_PORT_TYPE_OTG
  <b0c>     DW_AT_const_value : 3
 <1><b0e>: Abbrev Number: 2 (DW_TAG_typedef)
  <b0f>     DW_AT_name        : MUSB_PortType
  <b1d>     DW_AT_decl_file   : 6
  <b1e>     DW_AT_decl_line   : 45
  <b1f>     DW_AT_type        : <aac>
 <1><b23>: Abbrev Number: 21 (DW_TAG_enumeration_type)
  <b24>     DW_AT_byte_size   : 4
  <b25>     DW_AT_decl_file   : 6
  <b26>     DW_AT_decl_line   : 52
  <b27>     DW_AT_sibling     : <b8a>
 <2><b2b>: Abbrev Number: 22 (DW_TAG_enumerator)
  <b2c>     DW_AT_name        : MUSB_PORT_SPEED_UNKNOWN
  <b44>     DW_AT_const_value : 0
 <2><b45>: Abbrev Number: 22 (DW_TAG_enumerator)
  <b46>     DW_AT_name        : MUSB_PORT_SPEED_LOW
  <b5a>     DW_AT_const_value : 1
 <2><b5b>: Abbrev Number: 22 (DW_TAG_enumerator)
  <b5c>     DW_AT_name        : MUSB_PORT_SPEED_FULL
  <b71>     DW_AT_const_value : 2
 <2><b72>: Abbrev Number: 22 (DW_TAG_enumerator)
  <b73>     DW_AT_name        : MUSB_PORT_SPEED_HIGH
  <b88>     DW_AT_const_value : 3
 <1><b8a>: Abbrev Number: 2 (DW_TAG_typedef)
  <b8b>     DW_AT_name        : MUSB_PortSpeed
  <b9a>     DW_AT_decl_file   : 6
  <b9b>     DW_AT_decl_line   : 61
  <b9c>     DW_AT_type        : <b23>
 <1><ba0>: Abbrev Number: 21 (DW_TAG_enumeration_type)
  <ba1>     DW_AT_byte_size   : 4
  <ba2>     DW_AT_decl_file   : 6
  <ba3>     DW_AT_decl_line   : 68
  <ba4>     DW_AT_sibling     : <c0a>
 <2><ba8>: Abbrev Number: 22 (DW_TAG_enumerator)
  <ba9>     DW_AT_name        : MUSB_POWER_OFF
  <bb8>     DW_AT_const_value : 0
 <2><bb9>: Abbrev Number: 22 (DW_TAG_enumerator)
  <bba>     DW_AT_name        : MUSB_POWERED
  <bc7>     DW_AT_const_value : 1
 <2><bc8>: Abbrev Number: 22 (DW_TAG_enumerator)
  <bc9>     DW_AT_name        : MUSB_DEFAULT
  <bd6>     DW_AT_const_value : 2
 <2><bd7>: Abbrev Number: 22 (DW_TAG_enumerator)
  <bd8>     DW_AT_name        : MUSB_ADDRESS
  <be5>     DW_AT_const_value : 3
 <2><be6>: Abbrev Number: 22 (DW_TAG_enumerator)
  <be7>     DW_AT_name        : MUSB_CONFIGURED
  <bf7>     DW_AT_const_value : 4
 <2><bf8>: Abbrev Number: 22 (DW_TAG_enumerator)
  <bf9>     DW_AT_name        : MUSB_SUSPENDED
  <c08>     DW_AT_const_value : 5
 <1><c0a>: Abbrev Number: 2 (DW_TAG_typedef)
  <c0b>     DW_AT_name        : MUSB_State
  <c16>     DW_AT_decl_file   : 6
  <c17>     DW_AT_decl_line   : 81
  <c18>     DW_AT_type        : <ba0>
 <1><c1c>: Abbrev Number: 21 (DW_TAG_enumeration_type)
  <c1d>     DW_AT_byte_size   : 4
  <c1e>     DW_AT_decl_file   : 6
  <c1f>     DW_AT_decl_line   : 88
  <c20>     DW_AT_sibling     : <ce7>
 <2><c24>: Abbrev Number: 22 (DW_TAG_enumerator)
  <c25>     DW_AT_name        : MUSB_AB_IDLE
  <c32>     DW_AT_const_value : 0
 <2><c33>: Abbrev Number: 22 (DW_TAG_enumerator)
  <c34>     DW_AT_name        : MUSB_WAIT_VRISE
  <c44>     DW_AT_const_value : 1
 <2><c45>: Abbrev Number: 22 (DW_TAG_enumerator)
  <c46>     DW_AT_name        : MUSB_B_PERIPHERAL
  <c58>     DW_AT_const_value : 17
 <2><c59>: Abbrev Number: 22 (DW_TAG_enumerator)
  <c5a>     DW_AT_name        : MUSB_B_WAIT_ACON
  <c6b>     DW_AT_const_value : 18
 <2><c6c>: Abbrev Number: 22 (DW_TAG_enumerator)
  <c6d>     DW_AT_name        : MUSB_B_HOST
  <c79>     DW_AT_const_value : 19
 <2><c7a>: Abbrev Number: 22 (DW_TAG_enumerator)
  <c7b>     DW_AT_name        : MUSB_B_SRP_INIT
  <c8b>     DW_AT_const_value : 20
 <2><c8c>: Abbrev Number: 22 (DW_TAG_enumerator)
  <c8d>     DW_AT_name        : MUSB_A_PERIPHERAL
  <c9f>     DW_AT_const_value : 33
 <2><ca0>: Abbrev Number: 22 (DW_TAG_enumerator)
  <ca1>     DW_AT_name        : MUSB_A_WAIT_BCON
  <cb2>     DW_AT_const_value : 34
 <2><cb3>: Abbrev Number: 22 (DW_TAG_enumerator)
  <cb4>     DW_AT_name        : MUSB_A_HOST
  <cc0>     DW_AT_const_value : 35
 <2><cc1>: Abbrev Number: 22 (DW_TAG_enumerator)
  <cc2>     DW_AT_name        : MUSB_A_SUSPEND
  <cd1>     DW_AT_const_value : 36
 <2><cd2>: Abbrev Number: 22 (DW_TAG_enumerator)
  <cd3>     DW_AT_name        : MUSB_S_TRANSITION
  <ce5>     DW_AT_const_value : 48
 <1><ce7>: Abbrev Number: 2 (DW_TAG_typedef)
  <ce8>     DW_AT_name        : MUSB_OtgState
  <cf6>     DW_AT_decl_file   : 6
  <cf7>     DW_AT_decl_line   : 111
  <cf8>     DW_AT_type        : <c1c>
 <1><cfc>: Abbrev Number: 21 (DW_TAG_enumeration_type)
  <cfd>     DW_AT_byte_size   : 4
  <cfe>     DW_AT_decl_file   : 6
  <cff>     DW_AT_decl_line   : 118
  <d00>     DW_AT_sibling     : <d7b>
 <2><d04>: Abbrev Number: 22 (DW_TAG_enumerator)
  <d05>     DW_AT_name        : MUSB_CONNECTION_SPEED_UNKNOWN
  <d23>     DW_AT_const_value : 0
 <2><d24>: Abbrev Number: 22 (DW_TAG_enumerator)
  <d25>     DW_AT_name        : MUSB_CONNECTION_SPEED_LOW
  <d3f>     DW_AT_const_value : 1
 <2><d40>: Abbrev Number: 22 (DW_TAG_enumerator)
  <d41>     DW_AT_name        : MUSB_CONNECTION_SPEED_FULL
  <d5c>     DW_AT_const_value : 2
 <2><d5d>: Abbrev Number: 22 (DW_TAG_enumerator)
  <d5e>     DW_AT_name        : MUSB_CONNECTION_SPEED_HIGH
  <d79>     DW_AT_const_value : 3
 <1><d7b>: Abbrev Number: 2 (DW_TAG_typedef)
  <d7c>     DW_AT_name        : MUSB_ConnectionSpeed
  <d91>     DW_AT_decl_file   : 6
  <d92>     DW_AT_decl_line   : 127
  <d93>     DW_AT_type        : <cfc>
 <1><d97>: Abbrev Number: 12 (DW_TAG_structure_type)
  <d98>     DW_AT_byte_size   : 16
  <d99>     DW_AT_decl_file   : 6
  <d9a>     DW_AT_decl_line   : 228
  <d9b>     DW_AT_sibling     : <de1>
 <2><d9f>: Abbrev Number: 13 (DW_TAG_member)
  <da0>     DW_AT_name        : (indirect string, offset: 0xee): pPrivateData
  <da4>     DW_AT_decl_file   : 6
  <da5>     DW_AT_decl_line   : 229
  <da6>     DW_AT_type        : <f1>
  <daa>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><dad>: Abbrev Number: 14 (DW_TAG_member)
  <dae>     DW_AT_name        : bcdCdiRev
  <db8>     DW_AT_decl_file   : 6
  <db9>     DW_AT_decl_line   : 230
  <dba>     DW_AT_type        : <185>
  <dbe>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><dc1>: Abbrev Number: 14 (DW_TAG_member)
  <dc2>     DW_AT_name        : Type
  <dc7>     DW_AT_decl_file   : 6
  <dc8>     DW_AT_decl_line   : 231
  <dc9>     DW_AT_type        : <b0e>
  <dcd>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><dd0>: Abbrev Number: 14 (DW_TAG_member)
  <dd1>     DW_AT_name        : Speed
  <dd7>     DW_AT_decl_file   : 6
  <dd8>     DW_AT_decl_line   : 232
  <dd9>     DW_AT_type        : <b8a>
  <ddd>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <1><de1>: Abbrev Number: 2 (DW_TAG_typedef)
  <de2>     DW_AT_name        : MUSB_Port
  <dec>     DW_AT_decl_file   : 6
  <ded>     DW_AT_decl_line   : 233
  <dee>     DW_AT_type        : <d97>
 <1><df2>: Abbrev Number: 23 (DW_TAG_structure_type)
  <df3>     DW_AT_name        : _MUSB_Device
  <e00>     DW_AT_byte_size   : 64
  <e01>     DW_AT_decl_file   : 6
  <e02>     DW_AT_decl_line   : 235
  <e03>     DW_AT_sibling     : <f16>
 <2><e07>: Abbrev Number: 19 (DW_TAG_member)
  <e08>     DW_AT_name        : (indirect string, offset: 0x4a): pPort
  <e0c>     DW_AT_decl_file   : 6
  <e0d>     DW_AT_decl_line   : 270
  <e0f>     DW_AT_type        : <f16>
  <e13>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><e16>: Abbrev Number: 19 (DW_TAG_member)
  <e17>     DW_AT_name        : (indirect string, offset: 0xee): pPrivateData
  <e1b>     DW_AT_decl_file   : 6
  <e1c>     DW_AT_decl_line   : 271
  <e1e>     DW_AT_type        : <f1>
  <e22>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><e25>: Abbrev Number: 20 (DW_TAG_member)
  <e26>     DW_AT_name        : pDriverPrivateData
  <e39>     DW_AT_decl_file   : 6
  <e3a>     DW_AT_decl_line   : 272
  <e3c>     DW_AT_type        : <f1>
  <e40>     DW_AT_data_member_location: 2 byte block: 23 8  (DW_OP_plus_uconst: 8)
 <2><e43>: Abbrev Number: 20 (DW_TAG_member)
  <e44>     DW_AT_name        : DeviceDescriptor
  <e55>     DW_AT_decl_file   : 6
  <e56>     DW_AT_decl_line   : 273
  <e58>     DW_AT_type        : <934>
  <e5c>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <2><e5f>: Abbrev Number: 20 (DW_TAG_member)
  <e60>     DW_AT_name        : pCurrentConfiguration
  <e76>     DW_AT_decl_file   : 6
  <e77>     DW_AT_decl_line   : 274
  <e79>     DW_AT_type        : <f1c>
  <e7d>     DW_AT_data_member_location: 2 byte block: 23 20     (DW_OP_plus_uconst: 32)
 <2><e80>: Abbrev Number: 19 (DW_TAG_member)
  <e81>     DW_AT_name        : (indirect string, offset: 0x191): apConfigDescriptors
  <e85>     DW_AT_decl_file   : 6
  <e86>     DW_AT_decl_line   : 275
  <e88>     DW_AT_type        : <f22>
  <e8c>     DW_AT_data_member_location: 2 byte block: 23 24     (DW_OP_plus_uconst: 36)
 <2><e8f>: Abbrev Number: 20 (DW_TAG_member)
  <e90>     DW_AT_name        : pDescriptorBuffer
  <ea2>     DW_AT_decl_file   : 6
  <ea3>     DW_AT_decl_line   : 276
  <ea5>     DW_AT_type        : <f28>
  <ea9>     DW_AT_data_member_location: 2 byte block: 23 28     (DW_OP_plus_uconst: 40)
 <2><eac>: Abbrev Number: 19 (DW_TAG_member)
  <ead>     DW_AT_name        : (indirect string, offset: 0x1ae): wDescriptorBufferLength
  <eb1>     DW_AT_decl_file   : 6
  <eb2>     DW_AT_decl_line   : 277
  <eb4>     DW_AT_type        : <185>
  <eb8>     DW_AT_data_member_location: 2 byte block: 23 2c     (DW_OP_plus_uconst: 44)
 <2><ebb>: Abbrev Number: 20 (DW_TAG_member)
  <ebc>     DW_AT_name        : ConnectionSpeed
  <ecc>     DW_AT_decl_file   : 6
  <ecd>     DW_AT_decl_line   : 278
  <ecf>     DW_AT_type        : <d7b>
  <ed3>     DW_AT_data_member_location: 2 byte block: 23 30     (DW_OP_plus_uconst: 48)
 <2><ed6>: Abbrev Number: 19 (DW_TAG_member)
  <ed7>     DW_AT_name        : (indirect string, offset: 0x11b): bBusAddress
  <edb>     DW_AT_decl_file   : 6
  <edc>     DW_AT_decl_line   : 279
  <ede>     DW_AT_type        : <176>
  <ee2>     DW_AT_data_member_location: 2 byte block: 23 34     (DW_OP_plus_uconst: 52)
 <2><ee5>: Abbrev Number: 20 (DW_TAG_member)
  <ee6>     DW_AT_name        : pParentUsbDevice
  <ef7>     DW_AT_decl_file   : 6
  <ef8>     DW_AT_decl_line   : 280
  <efa>     DW_AT_type        : <f2e>
  <efe>     DW_AT_data_member_location: 2 byte block: 23 38     (DW_OP_plus_uconst: 56)
 <2><f01>: Abbrev Number: 20 (DW_TAG_member)
  <f02>     DW_AT_name        : bHubPort
  <f0b>     DW_AT_decl_file   : 6
  <f0c>     DW_AT_decl_line   : 281
  <f0e>     DW_AT_type        : <176>
  <f12>     DW_AT_data_member_location: 2 byte block: 23 3c     (DW_OP_plus_uconst: 60)
 <1><f16>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <f17>     DW_AT_byte_size   : 4
  <f18>     DW_AT_type        : <de1>
 <1><f1c>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <f1d>     DW_AT_byte_size   : 4
  <f1e>     DW_AT_type        : <a88>
 <1><f22>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <f23>     DW_AT_byte_size   : 4
  <f24>     DW_AT_type        : <f1c>
 <1><f28>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <f29>     DW_AT_byte_size   : 4
  <f2a>     DW_AT_type        : <176>
 <1><f2e>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <f2f>     DW_AT_byte_size   : 4
  <f30>     DW_AT_type        : <df2>
 <1><f34>: Abbrev Number: 17 (DW_TAG_typedef)
  <f35>     DW_AT_name        : MUSB_Device
  <f41>     DW_AT_decl_file   : 6
  <f42>     DW_AT_decl_line   : 282
  <f44>     DW_AT_type        : <df2>
 <1><f48>: Abbrev Number: 17 (DW_TAG_typedef)
  <f49>     DW_AT_name        : MUSB_BusHandle
  <f58>     DW_AT_decl_file   : 6
  <f59>     DW_AT_decl_line   : 285
  <f5b>     DW_AT_type        : <f1>
 <1><f5f>: Abbrev Number: 18 (DW_TAG_structure_type)
  <f60>     DW_AT_byte_size   : 16
  <f61>     DW_AT_decl_file   : 6
  <f62>     DW_AT_decl_line   : 301
  <f64>     DW_AT_sibling     : <fa6>
 <2><f68>: Abbrev Number: 19 (DW_TAG_member)
  <f69>     DW_AT_name        : (indirect string, offset: 0x1db): pDevice
  <f6d>     DW_AT_decl_file   : 6
  <f6e>     DW_AT_decl_line   : 302
  <f70>     DW_AT_type        : <fa6>
  <f74>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><f77>: Abbrev Number: 20 (DW_TAG_member)
  <f78>     DW_AT_name        : UsbDescriptor
  <f86>     DW_AT_decl_file   : 6
  <f87>     DW_AT_decl_line   : 303
  <f89>     DW_AT_type        : <9bb>
  <f8d>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><f90>: Abbrev Number: 20 (DW_TAG_member)
  <f91>     DW_AT_name        : wNakLimit
  <f9b>     DW_AT_decl_file   : 6
  <f9c>     DW_AT_decl_line   : 304
  <f9e>     DW_AT_type        : <185>
  <fa2>     DW_AT_data_member_location: 2 byte block: 23 c  (DW_OP_plus_uconst: 12)
 <1><fa6>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <fa7>     DW_AT_byte_size   : 4
  <fa8>     DW_AT_type        : <fac>
 <1><fac>: Abbrev Number: 8 (DW_TAG_const_type)
  <fad>     DW_AT_type        : <f34>
 <1><fb1>: Abbrev Number: 17 (DW_TAG_typedef)
  <fb2>     DW_AT_name        : MUSB_DeviceEndpoint
  <fc6>     DW_AT_decl_file   : 6
  <fc7>     DW_AT_decl_line   : 305
  <fc9>     DW_AT_type        : <f5f>
 <1><fcd>: Abbrev Number: 18 (DW_TAG_structure_type)
  <fce>     DW_AT_byte_size   : 12
  <fcf>     DW_AT_decl_file   : 6
  <fd0>     DW_AT_decl_line   : 321
  <fd2>     DW_AT_sibling     : <1011>
 <2><fd6>: Abbrev Number: 20 (DW_TAG_member)
  <fd7>     DW_AT_name        : dwBufferSize
  <fe4>     DW_AT_decl_file   : 6
  <fe5>     DW_AT_decl_line   : 322
  <fe7>     DW_AT_type        : <1a4>
  <feb>     DW_AT_data_member_location: 2 byte block: 23 0  (DW_OP_plus_uconst: 0)
 <2><fee>: Abbrev Number: 20 (DW_TAG_member)
  <fef>     DW_AT_name        : bmFlags
  <ff7>     DW_AT_decl_file   : 6
  <ff8>     DW_AT_decl_line   : 323
  <ffa>     DW_AT_type        : <1a4>
  <ffe>     DW_AT_data_member_location: 2 byte block: 23 4  (DW_OP_plus_uconst: 4)
 <2><1001>: Abbrev Number: 19 (DW_TAG_member)
  <1002>     DW_AT_name        : (indirect string, offset: 0xee): pPrivateData
  <1006>     DW_AT_decl_file   : 6
  <1007>     DW_AT_decl_line   : 324
  <1009>     DW_AT_type        : <f1>
  <100d>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <1><1011>: Abbrev Number: 17 (DW_TAG_typedef)
  <1012>     DW_AT_name        : MUSB_EndpointResource
  <1028>     DW_AT_decl_file   : 6
  <1029>     DW_AT_decl_line   : 325
  <102b>     DW_AT_type        : <fcd>
 <1><102f>: Abbrev Number: 17 (DW_TAG_typedef)
  <1030>     DW_AT_name        : MUSB_Pipe
  <103a>     DW_AT_decl_file   : 6
  <103b>     DW_AT_decl_line   : 338
  <103d>     DW_AT_type        : <f1>
 <1><1041>: Abbrev Number: 17 (DW_TAG_typedef)
  <1042>     DW_AT_name        : MUSB_pfControlIrpComplete
  <105c>     DW_AT_decl_file   : 6
  <105d>     DW_AT_decl_line   : 348
  <105f>     DW_AT_type        : <1063>
 <1><1063>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1064>     DW_AT_byte_size   : 4
  <1065>     DW_AT_type        : <1069>
 <1><1069>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <106a>     DW_AT_prototyped  : 1
  <106b>     DW_AT_sibling     : <107a>
 <2><106f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1070>     DW_AT_type        : <f1>
 <2><1074>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1075>     DW_AT_type        : <107a>
 <1><107a>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <107b>     DW_AT_byte_size   : 4
  <107c>     DW_AT_type        : <1080>
 <1><1080>: Abbrev Number: 24 (DW_TAG_structure_type)
  <1081>     DW_AT_name        : _MUSB_ControlIrp
  <1092>     DW_AT_byte_size   : 44
  <1093>     DW_AT_decl_file   : 6
  <1094>     DW_AT_decl_line   : 340
  <1096>     DW_AT_sibling     : <1177>
 <2><109a>: Abbrev Number: 19 (DW_TAG_member)
  <109b>     DW_AT_name        : (indirect string, offset: 0x1db): pDevice
  <109f>     DW_AT_decl_file   : 6
  <10a0>     DW_AT_decl_line   : 379
  <10a2>     DW_AT_type        : <fa6>
  <10a6>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><10a9>: Abbrev Number: 20 (DW_TAG_member)
  <10aa>     DW_AT_name        : pOutBuffer
  <10b5>     DW_AT_decl_file   : 6
  <10b6>     DW_AT_decl_line   : 380
  <10b8>     DW_AT_type        : <667>
  <10bc>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><10bf>: Abbrev Number: 20 (DW_TAG_member)
  <10c0>     DW_AT_name        : dwOutLength
  <10cc>     DW_AT_decl_file   : 6
  <10cd>     DW_AT_decl_line   : 381
  <10cf>     DW_AT_type        : <1a4>
  <10d3>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><10d6>: Abbrev Number: 20 (DW_TAG_member)
  <10d7>     DW_AT_name        : pInBuffer
  <10e1>     DW_AT_decl_file   : 6
  <10e2>     DW_AT_decl_line   : 382
  <10e4>     DW_AT_type        : <f28>
  <10e8>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><10eb>: Abbrev Number: 20 (DW_TAG_member)
  <10ec>     DW_AT_name        : dwInLength
  <10f7>     DW_AT_decl_file   : 6
  <10f8>     DW_AT_decl_line   : 383
  <10fa>     DW_AT_type        : <1a4>
  <10fe>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><1101>: Abbrev Number: 19 (DW_TAG_member)
  <1102>     DW_AT_name        : (indirect string, offset: 0x50): dwStatus
  <1106>     DW_AT_decl_file   : 6
  <1107>     DW_AT_decl_line   : 384
  <1109>     DW_AT_type        : <1a4>
  <110d>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <2><1110>: Abbrev Number: 20 (DW_TAG_member)
  <1111>     DW_AT_name        : dwActualOutLength
  <1123>     DW_AT_decl_file   : 6
  <1124>     DW_AT_decl_line   : 385
  <1126>     DW_AT_type        : <1a4>
  <112a>     DW_AT_data_member_location: 2 byte block: 23 18    (DW_OP_plus_uconst: 24)
 <2><112d>: Abbrev Number: 20 (DW_TAG_member)
  <112e>     DW_AT_name        : dwActualInLength
  <113f>     DW_AT_decl_file   : 6
  <1140>     DW_AT_decl_line   : 386
  <1142>     DW_AT_type        : <1a4>
  <1146>     DW_AT_data_member_location: 2 byte block: 23 1c    (DW_OP_plus_uconst: 28)
 <2><1149>: Abbrev Number: 19 (DW_TAG_member)
  <114a>     DW_AT_name        : (indirect string, offset: 0x66): pfIrpComplete
  <114e>     DW_AT_decl_file   : 6
  <114f>     DW_AT_decl_line   : 387
  <1151>     DW_AT_type        : <1041>
  <1155>     DW_AT_data_member_location: 2 byte block: 23 20    (DW_OP_plus_uconst: 32)
 <2><1158>: Abbrev Number: 19 (DW_TAG_member)
  <1159>     DW_AT_name        : (indirect string, offset: 0x1f): pCompleteParam
  <115d>     DW_AT_decl_file   : 6
  <115e>     DW_AT_decl_line   : 388
  <1160>     DW_AT_type        : <f1>
  <1164>     DW_AT_data_member_location: 2 byte block: 23 24    (DW_OP_plus_uconst: 36)
 <2><1167>: Abbrev Number: 19 (DW_TAG_member)
  <1168>     DW_AT_name        : (indirect string, offset: 0x17d): bAllowDma
  <116c>     DW_AT_decl_file   : 6
  <116d>     DW_AT_decl_line   : 389
  <116f>     DW_AT_type        : <176>
  <1173>     DW_AT_data_member_location: 2 byte block: 23 28    (DW_OP_plus_uconst: 40)
 <1><1177>: Abbrev Number: 17 (DW_TAG_typedef)
  <1178>     DW_AT_name        : MUSB_ControlIrp
  <1188>     DW_AT_decl_file   : 6
  <1189>     DW_AT_decl_line   : 390
  <118b>     DW_AT_type        : <1080>
 <1><118f>: Abbrev Number: 17 (DW_TAG_typedef)
  <1190>     DW_AT_name        : MUSB_pfIrpComplete
  <11a3>     DW_AT_decl_file   : 6
  <11a4>     DW_AT_decl_line   : 400
  <11a6>     DW_AT_type        : <11aa>
 <1><11aa>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <11ab>     DW_AT_byte_size   : 4
  <11ac>     DW_AT_type        : <11b0>
 <1><11b0>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <11b1>     DW_AT_prototyped  : 1
  <11b2>     DW_AT_sibling     : <11c1>
 <2><11b6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <11b7>     DW_AT_type        : <f1>
 <2><11bb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <11bc>     DW_AT_type        : <11c1>
 <1><11c1>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <11c2>     DW_AT_byte_size   : 4
  <11c3>     DW_AT_type        : <11c7>
 <1><11c7>: Abbrev Number: 24 (DW_TAG_structure_type)
  <11c8>     DW_AT_name        : _MUSB_Irp
  <11d2>     DW_AT_byte_size   : 32
  <11d3>     DW_AT_decl_file   : 6
  <11d4>     DW_AT_decl_line   : 392
  <11d6>     DW_AT_sibling     : <1288>
 <2><11da>: Abbrev Number: 20 (DW_TAG_member)
  <11db>     DW_AT_name        : hPipe
  <11e1>     DW_AT_decl_file   : 6
  <11e2>     DW_AT_decl_line   : 431
  <11e4>     DW_AT_type        : <102f>
  <11e8>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><11eb>: Abbrev Number: 19 (DW_TAG_member)
  <11ec>     DW_AT_name        : (indirect string, offset: 0xb8): pBuffer
  <11f0>     DW_AT_decl_file   : 6
  <11f1>     DW_AT_decl_line   : 432
  <11f3>     DW_AT_type        : <f28>
  <11f7>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><11fa>: Abbrev Number: 20 (DW_TAG_member)
  <11fb>     DW_AT_name        : dwLength
  <1204>     DW_AT_decl_file   : 6
  <1205>     DW_AT_decl_line   : 433
  <1207>     DW_AT_type        : <1a4>
  <120b>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><120e>: Abbrev Number: 19 (DW_TAG_member)
  <120f>     DW_AT_name        : (indirect string, offset: 0x50): dwStatus
  <1213>     DW_AT_decl_file   : 6
  <1214>     DW_AT_decl_line   : 434
  <1216>     DW_AT_type        : <1a4>
  <121a>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><121d>: Abbrev Number: 19 (DW_TAG_member)
  <121e>     DW_AT_name        : (indirect string, offset: 0x8): dwActualLength
  <1222>     DW_AT_decl_file   : 6
  <1223>     DW_AT_decl_line   : 435
  <1225>     DW_AT_type        : <1a4>
  <1229>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><122c>: Abbrev Number: 19 (DW_TAG_member)
  <122d>     DW_AT_name        : (indirect string, offset: 0x66): pfIrpComplete
  <1231>     DW_AT_decl_file   : 6
  <1232>     DW_AT_decl_line   : 436
  <1234>     DW_AT_type        : <118f>
  <1238>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <2><123b>: Abbrev Number: 19 (DW_TAG_member)
  <123c>     DW_AT_name        : (indirect string, offset: 0x1f): pCompleteParam
  <1240>     DW_AT_decl_file   : 6
  <1241>     DW_AT_decl_line   : 437
  <1243>     DW_AT_type        : <f1>
  <1247>     DW_AT_data_member_location: 2 byte block: 23 18    (DW_OP_plus_uconst: 24)
 <2><124a>: Abbrev Number: 20 (DW_TAG_member)
  <124b>     DW_AT_name        : bAllowShortTransfer
  <125f>     DW_AT_decl_file   : 6
  <1260>     DW_AT_decl_line   : 438
  <1262>     DW_AT_type        : <176>
  <1266>     DW_AT_data_member_location: 2 byte block: 23 1c    (DW_OP_plus_uconst: 28)
 <2><1269>: Abbrev Number: 19 (DW_TAG_member)
  <126a>     DW_AT_name        : (indirect string, offset: 0x170): bIsrCallback
  <126e>     DW_AT_decl_file   : 6
  <126f>     DW_AT_decl_line   : 439
  <1271>     DW_AT_type        : <176>
  <1275>     DW_AT_data_member_location: 2 byte block: 23 1d    (DW_OP_plus_uconst: 29)
 <2><1278>: Abbrev Number: 19 (DW_TAG_member)
  <1279>     DW_AT_name        : (indirect string, offset: 0x17d): bAllowDma
  <127d>     DW_AT_decl_file   : 6
  <127e>     DW_AT_decl_line   : 440
  <1280>     DW_AT_type        : <176>
  <1284>     DW_AT_data_member_location: 2 byte block: 23 1e    (DW_OP_plus_uconst: 30)
 <1><1288>: Abbrev Number: 17 (DW_TAG_typedef)
  <1289>     DW_AT_name        : MUSB_Irp
  <1292>     DW_AT_decl_file   : 6
  <1293>     DW_AT_decl_line   : 441
  <1295>     DW_AT_type        : <11c7>
 <1><1299>: Abbrev Number: 17 (DW_TAG_typedef)
  <129a>     DW_AT_name        : MUSB_pfIsochIrpComplete
  <12b2>     DW_AT_decl_file   : 6
  <12b3>     DW_AT_decl_line   : 451
  <12b5>     DW_AT_type        : <12b9>
 <1><12b9>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <12ba>     DW_AT_byte_size   : 4
  <12bb>     DW_AT_type        : <12bf>
 <1><12bf>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <12c0>     DW_AT_prototyped  : 1
  <12c1>     DW_AT_sibling     : <12d0>
 <2><12c5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <12c6>     DW_AT_type        : <f1>
 <2><12ca>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <12cb>     DW_AT_type        : <12d0>
 <1><12d0>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <12d1>     DW_AT_byte_size   : 4
  <12d2>     DW_AT_type        : <12d6>
 <1><12d6>: Abbrev Number: 24 (DW_TAG_structure_type)
  <12d7>     DW_AT_name        : _MUSB_IsochIrp
  <12e6>     DW_AT_byte_size   : 36
  <12e7>     DW_AT_decl_file   : 6
  <12e8>     DW_AT_decl_line   : 443
  <12ea>     DW_AT_sibling     : <13dd>
 <2><12ee>: Abbrev Number: 20 (DW_TAG_member)
  <12ef>     DW_AT_name        : hPipe
  <12f5>     DW_AT_decl_file   : 6
  <12f6>     DW_AT_decl_line   : 488
  <12f8>     DW_AT_type        : <102f>
  <12fc>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><12ff>: Abbrev Number: 19 (DW_TAG_member)
  <1300>     DW_AT_name        : (indirect string, offset: 0xb8): pBuffer
  <1304>     DW_AT_decl_file   : 6
  <1305>     DW_AT_decl_line   : 489
  <1307>     DW_AT_type        : <f28>
  <130b>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><130e>: Abbrev Number: 20 (DW_TAG_member)
  <130f>     DW_AT_name        : adwLength
  <1319>     DW_AT_decl_file   : 6
  <131a>     DW_AT_decl_line   : 490
  <131c>     DW_AT_type        : <13dd>
  <1320>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><1323>: Abbrev Number: 20 (DW_TAG_member)
  <1324>     DW_AT_name        : adwStatus
  <132e>     DW_AT_decl_file   : 6
  <132f>     DW_AT_decl_line   : 491
  <1331>     DW_AT_type        : <13dd>
  <1335>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><1338>: Abbrev Number: 20 (DW_TAG_member)
  <1339>     DW_AT_name        : adwActualLength
  <1349>     DW_AT_decl_file   : 6
  <134a>     DW_AT_decl_line   : 492
  <134c>     DW_AT_type        : <13dd>
  <1350>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><1353>: Abbrev Number: 19 (DW_TAG_member)
  <1354>     DW_AT_name        : (indirect string, offset: 0x66): pfIrpComplete
  <1358>     DW_AT_decl_file   : 6
  <1359>     DW_AT_decl_line   : 493
  <135b>     DW_AT_type        : <1299>
  <135f>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <2><1362>: Abbrev Number: 19 (DW_TAG_member)
  <1363>     DW_AT_name        : (indirect string, offset: 0x1f): pCompleteParam
  <1367>     DW_AT_decl_file   : 6
  <1368>     DW_AT_decl_line   : 494
  <136a>     DW_AT_type        : <f1>
  <136e>     DW_AT_data_member_location: 2 byte block: 23 18    (DW_OP_plus_uconst: 24)
 <2><1371>: Abbrev Number: 20 (DW_TAG_member)
  <1372>     DW_AT_name        : wFrameCount
  <137e>     DW_AT_decl_file   : 6
  <137f>     DW_AT_decl_line   : 495
  <1381>     DW_AT_type        : <185>
  <1385>     DW_AT_data_member_location: 2 byte block: 23 1c    (DW_OP_plus_uconst: 28)
 <2><1388>: Abbrev Number: 20 (DW_TAG_member)
  <1389>     DW_AT_name        : wCurrentFrame
  <1397>     DW_AT_decl_file   : 6
  <1398>     DW_AT_decl_line   : 496
  <139a>     DW_AT_type        : <185>
  <139e>     DW_AT_data_member_location: 2 byte block: 23 1e    (DW_OP_plus_uconst: 30)
 <2><13a1>: Abbrev Number: 20 (DW_TAG_member)
  <13a2>     DW_AT_name        : wCallbackInterval
  <13b4>     DW_AT_decl_file   : 6
  <13b5>     DW_AT_decl_line   : 497
  <13b7>     DW_AT_type        : <185>
  <13bb>     DW_AT_data_member_location: 2 byte block: 23 20    (DW_OP_plus_uconst: 32)
 <2><13be>: Abbrev Number: 19 (DW_TAG_member)
  <13bf>     DW_AT_name        : (indirect string, offset: 0x170): bIsrCallback
  <13c3>     DW_AT_decl_file   : 6
  <13c4>     DW_AT_decl_line   : 498
  <13c6>     DW_AT_type        : <176>
  <13ca>     DW_AT_data_member_location: 2 byte block: 23 22    (DW_OP_plus_uconst: 34)
 <2><13cd>: Abbrev Number: 19 (DW_TAG_member)
  <13ce>     DW_AT_name        : (indirect string, offset: 0x17d): bAllowDma
  <13d2>     DW_AT_decl_file   : 6
  <13d3>     DW_AT_decl_line   : 499
  <13d5>     DW_AT_type        : <176>
  <13d9>     DW_AT_data_member_location: 2 byte block: 23 23    (DW_OP_plus_uconst: 35)
 <1><13dd>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <13de>     DW_AT_byte_size   : 4
  <13df>     DW_AT_type        : <1a4>
 <1><13e3>: Abbrev Number: 17 (DW_TAG_typedef)
  <13e4>     DW_AT_name        : MUSB_IsochIrp
  <13f2>     DW_AT_decl_file   : 6
  <13f3>     DW_AT_decl_line   : 500
  <13f5>     DW_AT_type        : <12d6>
 <1><13f9>: Abbrev Number: 17 (DW_TAG_typedef)
  <13fa>     DW_AT_name        : MUSB_pfNewUsbState
  <140d>     DW_AT_decl_file   : 6
  <140e>     DW_AT_decl_line   : 515
  <1410>     DW_AT_type        : <1414>
 <1><1414>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1415>     DW_AT_byte_size   : 4
  <1416>     DW_AT_type        : <141a>
 <1><141a>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <141b>     DW_AT_prototyped  : 1
  <141c>     DW_AT_sibling     : <1430>
 <2><1420>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1421>     DW_AT_type        : <f1>
 <2><1425>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1426>     DW_AT_type        : <f48>
 <2><142a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <142b>     DW_AT_type        : <c0a>
 <1><1430>: Abbrev Number: 17 (DW_TAG_typedef)
  <1431>     DW_AT_name        : MUSB_pfDeviceRequest
  <1446>     DW_AT_decl_file   : 6
  <1447>     DW_AT_decl_line   : 537
  <1449>     DW_AT_type        : <144d>
 <1><144d>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <144e>     DW_AT_byte_size   : 4
  <144f>     DW_AT_type        : <1453>
 <1><1453>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <1454>     DW_AT_prototyped  : 1
  <1455>     DW_AT_type        : <176>
  <1459>     DW_AT_sibling     : <1477>
 <2><145d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <145e>     DW_AT_type        : <f1>
 <2><1462>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1463>     DW_AT_type        : <f48>
 <2><1467>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1468>     DW_AT_type        : <1a4>
 <2><146c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <146d>     DW_AT_type        : <667>
 <2><1471>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1472>     DW_AT_type        : <185>
 <1><1477>: Abbrev Number: 17 (DW_TAG_typedef)
  <1478>     DW_AT_name        : MUSB_pfDeviceConfigSelected
  <1494>     DW_AT_decl_file   : 6
  <1495>     DW_AT_decl_line   : 567
  <1497>     DW_AT_type        : <149b>
 <1><149b>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <149c>     DW_AT_byte_size   : 4
  <149d>     DW_AT_type        : <14a1>
 <1><14a1>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <14a2>     DW_AT_prototyped  : 1
  <14a3>     DW_AT_type        : <176>
  <14a7>     DW_AT_sibling     : <14c0>
 <2><14ab>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <14ac>     DW_AT_type        : <f1>
 <2><14b0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <14b1>     DW_AT_type        : <f48>
 <2><14b5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <14b6>     DW_AT_type        : <176>
 <2><14ba>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <14bb>     DW_AT_type        : <14c0>
 <1><14c0>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <14c1>     DW_AT_byte_size   : 4
  <14c2>     DW_AT_type        : <102f>
 <1><14c6>: Abbrev Number: 17 (DW_TAG_typedef)
  <14c7>     DW_AT_name        : MUSB_pfInterfaceSet
  <14db>     DW_AT_decl_file   : 6
  <14dc>     DW_AT_decl_line   : 598
  <14de>     DW_AT_type        : <14e2>
 <1><14e2>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <14e3>     DW_AT_byte_size   : 4
  <14e4>     DW_AT_type        : <14e8>
 <1><14e8>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <14e9>     DW_AT_prototyped  : 1
  <14ea>     DW_AT_type        : <176>
  <14ee>     DW_AT_sibling     : <150c>
 <2><14f2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <14f3>     DW_AT_type        : <f1>
 <2><14f7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <14f8>     DW_AT_type        : <f48>
 <2><14fc>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <14fd>     DW_AT_type        : <176>
 <2><1501>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1502>     DW_AT_type        : <176>
 <2><1506>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1507>     DW_AT_type        : <14c0>
 <1><150c>: Abbrev Number: 18 (DW_TAG_structure_type)
  <150d>     DW_AT_byte_size   : 44
  <150e>     DW_AT_decl_file   : 6
  <150f>     DW_AT_decl_line   : 654
  <1511>     DW_AT_sibling     : <167d>
 <2><1515>: Abbrev Number: 19 (DW_TAG_member)
  <1516>     DW_AT_name        : (indirect string, offset: 0xee): pPrivateData
  <151a>     DW_AT_decl_file   : 6
  <151b>     DW_AT_decl_line   : 655
  <151d>     DW_AT_type        : <f1>
  <1521>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1524>: Abbrev Number: 20 (DW_TAG_member)
  <1525>     DW_AT_name        : pStandardDescriptors
  <153a>     DW_AT_decl_file   : 6
  <153b>     DW_AT_decl_line   : 656
  <153d>     DW_AT_type        : <667>
  <1541>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><1544>: Abbrev Number: 19 (DW_TAG_member)
  <1545>     DW_AT_name        : (indirect string, offset: 0x1ae): wDescriptorBufferLength
  <1549>     DW_AT_decl_file   : 6
  <154a>     DW_AT_decl_line   : 657
  <154c>     DW_AT_type        : <185>
  <1550>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><1553>: Abbrev Number: 20 (DW_TAG_member)
  <1554>     DW_AT_name        : wStringDescriptorCount
  <156b>     DW_AT_decl_file   : 6
  <156c>     DW_AT_decl_line   : 658
  <156e>     DW_AT_type        : <185>
  <1572>     DW_AT_data_member_location: 2 byte block: 23 a     (DW_OP_plus_uconst: 10)
 <2><1575>: Abbrev Number: 20 (DW_TAG_member)
  <1576>     DW_AT_name        : pHighSpeedDescriptors
  <158c>     DW_AT_decl_file   : 6
  <158d>     DW_AT_decl_line   : 659
  <158f>     DW_AT_type        : <667>
  <1593>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><1596>: Abbrev Number: 20 (DW_TAG_member)
  <1597>     DW_AT_name        : wHighSpeedDescriptorLength
  <15b2>     DW_AT_decl_file   : 6
  <15b3>     DW_AT_decl_line   : 660
  <15b5>     DW_AT_type        : <185>
  <15b9>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><15bc>: Abbrev Number: 20 (DW_TAG_member)
  <15bd>     DW_AT_name        : wControlBufferLength
  <15d2>     DW_AT_decl_file   : 6
  <15d3>     DW_AT_decl_line   : 661
  <15d5>     DW_AT_type        : <185>
  <15d9>     DW_AT_data_member_location: 2 byte block: 23 12    (DW_OP_plus_uconst: 18)
 <2><15dc>: Abbrev Number: 20 (DW_TAG_member)
  <15dd>     DW_AT_name        : pControlBuffer
  <15ec>     DW_AT_decl_file   : 6
  <15ed>     DW_AT_decl_line   : 662
  <15ef>     DW_AT_type        : <f28>
  <15f3>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <2><15f6>: Abbrev Number: 20 (DW_TAG_member)
  <15f7>     DW_AT_name        : pbSelfPowered
  <1605>     DW_AT_decl_file   : 6
  <1606>     DW_AT_decl_line   : 663
  <1608>     DW_AT_type        : <f28>
  <160c>     DW_AT_data_member_location: 2 byte block: 23 18    (DW_OP_plus_uconst: 24)
 <2><160f>: Abbrev Number: 20 (DW_TAG_member)
  <1610>     DW_AT_name        : pfDeviceRequest
  <1620>     DW_AT_decl_file   : 6
  <1621>     DW_AT_decl_line   : 664
  <1623>     DW_AT_type        : <1430>
  <1627>     DW_AT_data_member_location: 2 byte block: 23 1c    (DW_OP_plus_uconst: 28)
 <2><162a>: Abbrev Number: 20 (DW_TAG_member)
  <162b>     DW_AT_name        : pfDeviceConfigSelected
  <1642>     DW_AT_decl_file   : 6
  <1643>     DW_AT_decl_line   : 665
  <1645>     DW_AT_type        : <1477>
  <1649>     DW_AT_data_member_location: 2 byte block: 23 20    (DW_OP_plus_uconst: 32)
 <2><164c>: Abbrev Number: 20 (DW_TAG_member)
  <164d>     DW_AT_name        : pfInterfaceSet
  <165c>     DW_AT_decl_file   : 6
  <165d>     DW_AT_decl_line   : 666
  <165f>     DW_AT_type        : <14c6>
  <1663>     DW_AT_data_member_location: 2 byte block: 23 24    (DW_OP_plus_uconst: 36)
 <2><1666>: Abbrev Number: 20 (DW_TAG_member)
  <1667>     DW_AT_name        : pfUsbState
  <1672>     DW_AT_decl_file   : 6
  <1673>     DW_AT_decl_line   : 667
  <1675>     DW_AT_type        : <13f9>
  <1679>     DW_AT_data_member_location: 2 byte block: 23 28    (DW_OP_plus_uconst: 40)
 <1><167d>: Abbrev Number: 17 (DW_TAG_typedef)
  <167e>     DW_AT_name        : MUSB_FunctionClient
  <1692>     DW_AT_decl_file   : 6
  <1693>     DW_AT_decl_line   : 668
  <1695>     DW_AT_type        : <150c>
 <1><1699>: Abbrev Number: 17 (DW_TAG_typedef)
  <169a>     DW_AT_name        : MUSB_pfDeviceConnected
  <16b1>     DW_AT_decl_file   : 6
  <16b2>     DW_AT_decl_line   : 684
  <16b4>     DW_AT_type        : <16b8>
 <1><16b8>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <16b9>     DW_AT_byte_size   : 4
  <16ba>     DW_AT_type        : <16be>
 <1><16be>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <16bf>     DW_AT_prototyped  : 1
  <16c0>     DW_AT_type        : <176>
  <16c4>     DW_AT_sibling     : <16dd>
 <2><16c8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <16c9>     DW_AT_type        : <f1>
 <2><16cd>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <16ce>     DW_AT_type        : <f48>
 <2><16d2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <16d3>     DW_AT_type        : <16dd>
 <2><16d7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <16d8>     DW_AT_type        : <667>
 <1><16dd>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <16de>     DW_AT_byte_size   : 4
  <16df>     DW_AT_type        : <f34>
 <1><16e3>: Abbrev Number: 17 (DW_TAG_typedef)
  <16e4>     DW_AT_name        : MUSB_pfDeviceDisconnected
  <16fe>     DW_AT_decl_file   : 6
  <16ff>     DW_AT_decl_line   : 694
  <1701>     DW_AT_type        : <1705>
 <1><1705>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1706>     DW_AT_byte_size   : 4
  <1707>     DW_AT_type        : <170b>
 <1><170b>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <170c>     DW_AT_prototyped  : 1
  <170d>     DW_AT_sibling     : <1721>
 <2><1711>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1712>     DW_AT_type        : <f1>
 <2><1716>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1717>     DW_AT_type        : <f48>
 <2><171b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <171c>     DW_AT_type        : <16dd>
 <1><1721>: Abbrev Number: 17 (DW_TAG_typedef)
  <1722>     DW_AT_name        : MUSB_pfDriverTimerExpired
  <173c>     DW_AT_decl_file   : 6
  <173d>     DW_AT_decl_line   : 702
  <173f>     DW_AT_type        : <1743>
 <1><1743>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1744>     DW_AT_byte_size   : 4
  <1745>     DW_AT_type        : <1749>
 <1><1749>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <174a>     DW_AT_prototyped  : 1
  <174b>     DW_AT_sibling     : <175a>
 <2><174f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1750>     DW_AT_type        : <f1>
 <2><1754>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1755>     DW_AT_type        : <f48>
 <1><175a>: Abbrev Number: 17 (DW_TAG_typedef)
  <175b>     DW_AT_name        : MUSB_pfBusSuspended
  <176f>     DW_AT_decl_file   : 6
  <1770>     DW_AT_decl_line   : 710
  <1772>     DW_AT_type        : <1743>
 <1><1776>: Abbrev Number: 17 (DW_TAG_typedef)
  <1777>     DW_AT_name        : MUSB_pfBusResumed
  <1789>     DW_AT_decl_file   : 6
  <178a>     DW_AT_decl_line   : 718
  <178c>     DW_AT_type        : <1743>
 <1><1790>: Abbrev Number: 24 (DW_TAG_structure_type)
  <1791>     DW_AT_name        : _MUSB_DeviceDriver
  <17a4>     DW_AT_byte_size   : 28
  <17a5>     DW_AT_decl_file   : 6
  <17a6>     DW_AT_decl_line   : 740
  <17a8>     DW_AT_sibling     : <1851>
 <2><17ac>: Abbrev Number: 19 (DW_TAG_member)
  <17ad>     DW_AT_name        : (indirect string, offset: 0xee): pPrivateData
  <17b1>     DW_AT_decl_file   : 6
  <17b2>     DW_AT_decl_line   : 741
  <17b4>     DW_AT_type        : <f1>
  <17b8>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><17bb>: Abbrev Number: 20 (DW_TAG_member)
  <17bc>     DW_AT_name        : bTimerCount
  <17c8>     DW_AT_decl_file   : 6
  <17c9>     DW_AT_decl_line   : 742
  <17cb>     DW_AT_type        : <176>
  <17cf>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><17d2>: Abbrev Number: 19 (DW_TAG_member)
  <17d3>     DW_AT_name        : (indirect string, offset: 0x15c): adwTimerResolutions
  <17d7>     DW_AT_decl_file   : 6
  <17d8>     DW_AT_decl_line   : 743
  <17da>     DW_AT_type        : <13dd>
  <17de>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><17e1>: Abbrev Number: 20 (DW_TAG_member)
  <17e2>     DW_AT_name        : pfDeviceConnected
  <17f4>     DW_AT_decl_file   : 6
  <17f5>     DW_AT_decl_line   : 744
  <17f7>     DW_AT_type        : <1699>
  <17fb>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><17fe>: Abbrev Number: 20 (DW_TAG_member)
  <17ff>     DW_AT_name        : pfDeviceDisconnected
  <1814>     DW_AT_decl_file   : 6
  <1815>     DW_AT_decl_line   : 745
  <1817>     DW_AT_type        : <16e3>
  <181b>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><181e>: Abbrev Number: 20 (DW_TAG_member)
  <181f>     DW_AT_name        : pfBusSuspended
  <182e>     DW_AT_decl_file   : 6
  <182f>     DW_AT_decl_line   : 746
  <1831>     DW_AT_type        : <175a>
  <1835>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <2><1838>: Abbrev Number: 20 (DW_TAG_member)
  <1839>     DW_AT_name        : pfBusResumed
  <1846>     DW_AT_decl_file   : 6
  <1847>     DW_AT_decl_line   : 747
  <1849>     DW_AT_type        : <1776>
  <184d>     DW_AT_data_member_location: 2 byte block: 23 18    (DW_OP_plus_uconst: 24)
 <1><1851>: Abbrev Number: 17 (DW_TAG_typedef)
  <1852>     DW_AT_name        : MUSB_DeviceDriver
  <1864>     DW_AT_decl_file   : 6
  <1865>     DW_AT_decl_line   : 748
  <1867>     DW_AT_type        : <1790>
 <1><186b>: Abbrev Number: 18 (DW_TAG_structure_type)
  <186c>     DW_AT_byte_size   : 16
  <186d>     DW_AT_decl_file   : 6
  <186e>     DW_AT_decl_line   : 765
  <1870>     DW_AT_sibling     : <18f1>
 <2><1874>: Abbrev Number: 20 (DW_TAG_member)
  <1875>     DW_AT_name        : pPeripheralList
  <1885>     DW_AT_decl_file   : 6
  <1886>     DW_AT_decl_line   : 766
  <1888>     DW_AT_type        : <667>
  <188c>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><188f>: Abbrev Number: 20 (DW_TAG_member)
  <1890>     DW_AT_name        : wPeripheralListLength
  <18a6>     DW_AT_decl_file   : 6
  <18a7>     DW_AT_decl_line   : 767
  <18a9>     DW_AT_type        : <185>
  <18ad>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><18b0>: Abbrev Number: 20 (DW_TAG_member)
  <18b1>     DW_AT_name        : aDeviceDriverList
  <18c3>     DW_AT_decl_file   : 6
  <18c4>     DW_AT_decl_line   : 768
  <18c6>     DW_AT_type        : <18f1>
  <18ca>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><18cd>: Abbrev Number: 20 (DW_TAG_member)
  <18ce>     DW_AT_name        : bDeviceDriverListLength
  <18e6>     DW_AT_decl_file   : 6
  <18e7>     DW_AT_decl_line   : 769
  <18e9>     DW_AT_type        : <176>
  <18ed>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <1><18f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <18f2>     DW_AT_byte_size   : 4
  <18f3>     DW_AT_type        : <1851>
 <1><18f7>: Abbrev Number: 17 (DW_TAG_typedef)
  <18f8>     DW_AT_name        : MUSB_HostClient
  <1908>     DW_AT_decl_file   : 6
  <1909>     DW_AT_decl_line   : 770
  <190b>     DW_AT_type        : <186b>
 <1><190f>: Abbrev Number: 17 (DW_TAG_typedef)
  <1910>     DW_AT_name        : MUSB_pfNewOtgState
  <1923>     DW_AT_decl_file   : 6
  <1924>     DW_AT_decl_line   : 780
  <1926>     DW_AT_type        : <192a>
 <1><192a>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <192b>     DW_AT_byte_size   : 4
  <192c>     DW_AT_type        : <1930>
 <1><1930>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <1931>     DW_AT_prototyped  : 1
  <1932>     DW_AT_sibling     : <1946>
 <2><1936>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1937>     DW_AT_type        : <f1>
 <2><193b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <193c>     DW_AT_type        : <f48>
 <2><1940>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1941>     DW_AT_type        : <ce7>
 <1><1946>: Abbrev Number: 17 (DW_TAG_typedef)
  <1947>     DW_AT_name        : MUSB_pfOtgError
  <1957>     DW_AT_decl_file   : 6
  <1958>     DW_AT_decl_line   : 791
  <195a>     DW_AT_type        : <195e>
 <1><195e>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <195f>     DW_AT_byte_size   : 4
  <1960>     DW_AT_type        : <1964>
 <1><1964>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <1965>     DW_AT_prototyped  : 1
  <1966>     DW_AT_sibling     : <197a>
 <2><196a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <196b>     DW_AT_type        : <f1>
 <2><196f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1970>     DW_AT_type        : <f48>
 <2><1974>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1975>     DW_AT_type        : <1a4>
 <1><197a>: Abbrev Number: 18 (DW_TAG_structure_type)
  <197b>     DW_AT_byte_size   : 16
  <197c>     DW_AT_decl_file   : 6
  <197d>     DW_AT_decl_line   : 809
  <197f>     DW_AT_sibling     : <19db>
 <2><1983>: Abbrev Number: 19 (DW_TAG_member)
  <1984>     DW_AT_name        : (indirect string, offset: 0xee): pPrivateData
  <1988>     DW_AT_decl_file   : 6
  <1989>     DW_AT_decl_line   : 810
  <198b>     DW_AT_type        : <f1>
  <198f>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1992>: Abbrev Number: 20 (DW_TAG_member)
  <1993>     DW_AT_name        : pbDesireHostRole
  <19a4>     DW_AT_decl_file   : 6
  <19a5>     DW_AT_decl_line   : 811
  <19a7>     DW_AT_type        : <f28>
  <19ab>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><19ae>: Abbrev Number: 20 (DW_TAG_member)
  <19af>     DW_AT_name        : pfOtgState
  <19ba>     DW_AT_decl_file   : 6
  <19bb>     DW_AT_decl_line   : 812
  <19bd>     DW_AT_type        : <190f>
  <19c1>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><19c4>: Abbrev Number: 20 (DW_TAG_member)
  <19c5>     DW_AT_name        : pfOtgError
  <19d0>     DW_AT_decl_file   : 6
  <19d1>     DW_AT_decl_line   : 813
  <19d3>     DW_AT_type        : <1946>
  <19d7>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <1><19db>: Abbrev Number: 17 (DW_TAG_typedef)
  <19dc>     DW_AT_name        : MUSB_OtgClient
  <19eb>     DW_AT_decl_file   : 6
  <19ec>     DW_AT_decl_line   : 814
  <19ee>     DW_AT_type        : <197a>
 <1><19f2>: Abbrev Number: 17 (DW_TAG_typedef)
  <19f3>     DW_AT_name        : MUSB_pfHubEnumerationComplete
  <1a11>     DW_AT_decl_file   : 6
  <1a12>     DW_AT_decl_line   : 825
  <1a14>     DW_AT_type        : <1a18>
 <1><1a18>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1a19>     DW_AT_byte_size   : 4
  <1a1a>     DW_AT_type        : <1a1e>
 <1><1a1e>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <1a1f>     DW_AT_prototyped  : 1
  <1a20>     DW_AT_sibling     : <1a2f>
 <2><1a24>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1a25>     DW_AT_type        : <16dd>
 <2><1a29>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1a2a>     DW_AT_type        : <16dd>
 <1><1a2f>: Abbrev Number: 12 (DW_TAG_structure_type)
  <1a30>     DW_AT_byte_size   : 24
  <1a31>     DW_AT_decl_file   : 7
  <1a32>     DW_AT_decl_line   : 43
  <1a33>     DW_AT_sibling     : <1ac9>
 <2><1a37>: Abbrev Number: 14 (DW_TAG_member)
  <1a38>     DW_AT_name        : wItemSize
  <1a42>     DW_AT_decl_file   : 7
  <1a43>     DW_AT_decl_line   : 44
  <1a44>     DW_AT_type        : <1c4>
  <1a48>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1a4b>: Abbrev Number: 14 (DW_TAG_member)
  <1a4c>     DW_AT_name        : wStaticItemCount
  <1a5d>     DW_AT_decl_file   : 7
  <1a5e>     DW_AT_decl_line   : 45
  <1a5f>     DW_AT_type        : <1c4>
  <1a63>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><1a66>: Abbrev Number: 14 (DW_TAG_member)
  <1a67>     DW_AT_name        : pStaticBuffer
  <1a75>     DW_AT_decl_file   : 7
  <1a76>     DW_AT_decl_line   : 46
  <1a77>     DW_AT_type        : <f1>
  <1a7b>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><1a7e>: Abbrev Number: 14 (DW_TAG_member)
  <1a7f>     DW_AT_name        : wItemCount
  <1a8a>     DW_AT_decl_file   : 7
  <1a8b>     DW_AT_decl_line   : 47
  <1a8c>     DW_AT_type        : <1c4>
  <1a90>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><1a93>: Abbrev Number: 14 (DW_TAG_member)
  <1a94>     DW_AT_name        : wDynamicItemCount
  <1aa6>     DW_AT_decl_file   : 7
  <1aa7>     DW_AT_decl_line   : 48
  <1aa8>     DW_AT_type        : <1c4>
  <1aac>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><1aaf>: Abbrev Number: 14 (DW_TAG_member)
  <1ab0>     DW_AT_name        : pDynamicBuffer
  <1abf>     DW_AT_decl_file   : 7
  <1ac0>     DW_AT_decl_line   : 49
  <1ac1>     DW_AT_type        : <f1>
  <1ac5>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <1><1ac9>: Abbrev Number: 2 (DW_TAG_typedef)
  <1aca>     DW_AT_name        : MUSB_Array
  <1ad5>     DW_AT_decl_file   : 7
  <1ad6>     DW_AT_decl_line   : 50
  <1ad7>     DW_AT_type        : <1a2f>
 <1><1adb>: Abbrev Number: 23 (DW_TAG_structure_type)
  <1adc>     DW_AT_name        : _MUSB_LinkedList
  <1aed>     DW_AT_byte_size   : 12
  <1aee>     DW_AT_decl_file   : 7
  <1aef>     DW_AT_decl_line   : 110
  <1af0>     DW_AT_sibling     : <1b21>
 <2><1af4>: Abbrev Number: 13 (DW_TAG_member)
  <1af5>     DW_AT_name        : (indirect string, offset: 0x74): pItem
  <1af9>     DW_AT_decl_file   : 7
  <1afa>     DW_AT_decl_line   : 111
  <1afb>     DW_AT_type        : <f1>
  <1aff>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1b02>: Abbrev Number: 14 (DW_TAG_member)
  <1b03>     DW_AT_name        : pNext
  <1b09>     DW_AT_decl_file   : 7
  <1b0a>     DW_AT_decl_line   : 112
  <1b0b>     DW_AT_type        : <1b21>
  <1b0f>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><1b12>: Abbrev Number: 13 (DW_TAG_member)
  <1b13>     DW_AT_name        : (indirect string, offset: 0x0): dwCount
  <1b17>     DW_AT_decl_file   : 7
  <1b18>     DW_AT_decl_line   : 113
  <1b19>     DW_AT_type        : <94>
  <1b1d>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <1><1b21>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1b22>     DW_AT_byte_size   : 4
  <1b23>     DW_AT_type        : <1adb>
 <1><1b27>: Abbrev Number: 2 (DW_TAG_typedef)
  <1b28>     DW_AT_name        : MUSB_LinkedList
  <1b38>     DW_AT_decl_file   : 7
  <1b39>     DW_AT_decl_line   : 114
  <1b3a>     DW_AT_type        : <1adb>
 <1><1b3e>: Abbrev Number: 21 (DW_TAG_enumeration_type)
  <1b3f>     DW_AT_byte_size   : 4
  <1b40>     DW_AT_decl_file   : 8
  <1b41>     DW_AT_decl_line   : 30
  <1b42>     DW_AT_sibling     : <1c65>
 <2><1b46>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1b47>     DW_AT_name        : MUSB_HSET_PORT_NONE
  <1b5b>     DW_AT_const_value : 0
 <2><1b5c>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1b5d>     DW_AT_name        : MUSB_HSET_PORT_TEST_J
  <1b73>     DW_AT_const_value : 1
 <2><1b74>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1b75>     DW_AT_name        : MUSB_HSET_PORT_TEST_K
  <1b8b>     DW_AT_const_value : 2
 <2><1b8c>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1b8d>     DW_AT_name        : MUSB_HSET_PORT_TEST_SE0_NAK
  <1ba9>     DW_AT_const_value : 3
 <2><1baa>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1bab>     DW_AT_name        : MUSB_HSET_PORT_TEST_PACKET
  <1bc6>     DW_AT_const_value : 4
 <2><1bc7>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1bc8>     DW_AT_name        : MUSB_HSET_PORT_RESET
  <1bdd>     DW_AT_const_value : 5
 <2><1bde>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1bdf>     DW_AT_name        : MUSB_HSET_PORT_SUSPEND
  <1bf6>     DW_AT_const_value : 6
 <2><1bf7>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1bf8>     DW_AT_name        : MUSB_HSET_PORT_RESUME
  <1c0e>     DW_AT_const_value : 7
 <2><1c0f>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1c10>     DW_AT_name        : MUSB_HSET_PORT_SETUP_START
  <1c2b>     DW_AT_const_value : 8
 <2><1c2c>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1c2d>     DW_AT_name        : MUSB_HSET_PORT_SETUP_IN
  <1c45>     DW_AT_const_value : 9
 <2><1c46>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1c47>     DW_AT_name        : MUSB_HSET_PORT_SETUP_STATUS
  <1c63>     DW_AT_const_value : 10
 <1><1c65>: Abbrev Number: 2 (DW_TAG_typedef)
  <1c66>     DW_AT_name        : MUSB_HsetPortMode
  <1c78>     DW_AT_decl_file   : 8
  <1c79>     DW_AT_decl_line   : 53
  <1c7a>     DW_AT_type        : <1b3e>
 <1><1c7e>: Abbrev Number: 25 (DW_TAG_enumeration_type)
  <1c7f>     DW_AT_name        : _MUSB_DmaChannelStatus
  <1c96>     DW_AT_byte_size   : 4
  <1c97>     DW_AT_decl_file   : 9
  <1c98>     DW_AT_decl_line   : 57
  <1c99>     DW_AT_sibling     : <1d1f>
 <2><1c9d>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1c9e>     DW_AT_name        : MUSB_DMA_STATUS_UNKNOWN
  <1cb6>     DW_AT_const_value : 0
 <2><1cb7>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1cb8>     DW_AT_name        : MUSB_DMA_STATUS_FREE
  <1ccd>     DW_AT_const_value : 1
 <2><1cce>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1ccf>     DW_AT_name        : MUSB_DMA_STATUS_BUSY
  <1ce4>     DW_AT_const_value : 2
 <2><1ce5>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1ce6>     DW_AT_name        : MUSB_DMA_STATUS_BUS_ABORT
  <1d00>     DW_AT_const_value : 3
 <2><1d01>: Abbrev Number: 22 (DW_TAG_enumerator)
  <1d02>     DW_AT_name        : MUSB_DMA_STATUS_CORE_ABORT
  <1d1d>     DW_AT_const_value : 4
 <1><1d1f>: Abbrev Number: 2 (DW_TAG_typedef)
  <1d20>     DW_AT_name        : MUSB_DmaChannelStatus
  <1d36>     DW_AT_decl_file   : 9
  <1d37>     DW_AT_decl_line   : 68
  <1d38>     DW_AT_type        : <1c7e>
 <1><1d3c>: Abbrev Number: 12 (DW_TAG_structure_type)
  <1d3d>     DW_AT_byte_size   : 20
  <1d3e>     DW_AT_decl_file   : 9
  <1d3f>     DW_AT_decl_line   : 83
  <1d40>     DW_AT_sibling     : <1da0>
 <2><1d44>: Abbrev Number: 13 (DW_TAG_member)
  <1d45>     DW_AT_name        : (indirect string, offset: 0xee): pPrivateData
  <1d49>     DW_AT_decl_file   : 9
  <1d4a>     DW_AT_decl_line   : 84
  <1d4b>     DW_AT_type        : <f1>
  <1d4f>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1d52>: Abbrev Number: 14 (DW_TAG_member)
  <1d53>     DW_AT_name        : dwMaxLength
  <1d5f>     DW_AT_decl_file   : 9
  <1d60>     DW_AT_decl_line   : 85
  <1d61>     DW_AT_type        : <1a4>
  <1d65>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><1d68>: Abbrev Number: 13 (DW_TAG_member)
  <1d69>     DW_AT_name        : (indirect string, offset: 0x8): dwActualLength
  <1d6d>     DW_AT_decl_file   : 9
  <1d6e>     DW_AT_decl_line   : 86
  <1d6f>     DW_AT_type        : <1a4>
  <1d73>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><1d76>: Abbrev Number: 14 (DW_TAG_member)
  <1d77>     DW_AT_name        : bStatus
  <1d7f>     DW_AT_decl_file   : 9
  <1d80>     DW_AT_decl_line   : 87
  <1d81>     DW_AT_type        : <1d1f>
  <1d85>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><1d88>: Abbrev Number: 14 (DW_TAG_member)
  <1d89>     DW_AT_name        : bDesiredMode
  <1d96>     DW_AT_decl_file   : 9
  <1d97>     DW_AT_decl_line   : 88
  <1d98>     DW_AT_type        : <176>
  <1d9c>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <1><1da0>: Abbrev Number: 2 (DW_TAG_typedef)
  <1da1>     DW_AT_name        : MUSB_DmaChannel
  <1db1>     DW_AT_decl_file   : 9
  <1db2>     DW_AT_decl_line   : 89
  <1db3>     DW_AT_type        : <1d3c>
 <1><1db7>: Abbrev Number: 2 (DW_TAG_typedef)
  <1db8>     DW_AT_name        : MUSB_pfDmaStartController
  <1dd2>     DW_AT_decl_file   : 9
  <1dd3>     DW_AT_decl_line   : 98
  <1dd4>     DW_AT_type        : <1dd8>
 <1><1dd8>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1dd9>     DW_AT_byte_size   : 4
  <1dda>     DW_AT_type        : <1dde>
 <1><1dde>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <1ddf>     DW_AT_prototyped  : 1
  <1de0>     DW_AT_type        : <176>
  <1de4>     DW_AT_sibling     : <1dee>
 <2><1de8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1de9>     DW_AT_type        : <f1>
 <1><1dee>: Abbrev Number: 2 (DW_TAG_typedef)
  <1def>     DW_AT_name        : MUSB_pfDmaStopController
  <1e08>     DW_AT_decl_file   : 9
  <1e09>     DW_AT_decl_line   : 107
  <1e0a>     DW_AT_type        : <1dd8>
 <1><1e0e>: Abbrev Number: 2 (DW_TAG_typedef)
  <1e0f>     DW_AT_name        : MUSB_pfDmaAllocateChannel
  <1e29>     DW_AT_decl_file   : 9
  <1e2a>     DW_AT_decl_line   : 123
  <1e2b>     DW_AT_type        : <1e2f>
 <1><1e2f>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1e30>     DW_AT_byte_size   : 4
  <1e31>     DW_AT_type        : <1e35>
 <1><1e35>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <1e36>     DW_AT_prototyped  : 1
  <1e37>     DW_AT_type        : <1e59>
  <1e3b>     DW_AT_sibling     : <1e59>
 <2><1e3f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1e40>     DW_AT_type        : <f1>
 <2><1e44>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1e45>     DW_AT_type        : <176>
 <2><1e49>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1e4a>     DW_AT_type        : <176>
 <2><1e4e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1e4f>     DW_AT_type        : <176>
 <2><1e53>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1e54>     DW_AT_type        : <185>
 <1><1e59>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1e5a>     DW_AT_byte_size   : 4
  <1e5b>     DW_AT_type        : <1da0>
 <1><1e5f>: Abbrev Number: 2 (DW_TAG_typedef)
  <1e60>     DW_AT_name        : MUSB_pfDmaReleaseChannel
  <1e79>     DW_AT_decl_file   : 9
  <1e7a>     DW_AT_decl_line   : 132
  <1e7b>     DW_AT_type        : <1e7f>
 <1><1e7f>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1e80>     DW_AT_byte_size   : 4
  <1e81>     DW_AT_type        : <1e85>
 <1><1e85>: Abbrev Number: 11 (DW_TAG_subroutine_type)
  <1e86>     DW_AT_prototyped  : 1
  <1e87>     DW_AT_sibling     : <1e91>
 <2><1e8b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1e8c>     DW_AT_type        : <1e59>
 <1><1e91>: Abbrev Number: 2 (DW_TAG_typedef)
  <1e92>     DW_AT_name        : MUSB_pfDmaAllocateBuffer
  <1eab>     DW_AT_decl_file   : 9
  <1eac>     DW_AT_decl_line   : 145
  <1ead>     DW_AT_type        : <1eb1>
 <1><1eb1>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1eb2>     DW_AT_byte_size   : 4
  <1eb3>     DW_AT_type        : <1eb7>
 <1><1eb7>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <1eb8>     DW_AT_prototyped  : 1
  <1eb9>     DW_AT_type        : <f28>
  <1ebd>     DW_AT_sibling     : <1ecc>
 <2><1ec1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1ec2>     DW_AT_type        : <1e59>
 <2><1ec6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1ec7>     DW_AT_type        : <1a4>
 <1><1ecc>: Abbrev Number: 2 (DW_TAG_typedef)
  <1ecd>     DW_AT_name        : MUSB_pfDmaReleaseBuffer
  <1ee5>     DW_AT_decl_file   : 9
  <1ee6>     DW_AT_decl_line   : 158
  <1ee7>     DW_AT_type        : <1eeb>
 <1><1eeb>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1eec>     DW_AT_byte_size   : 4
  <1eed>     DW_AT_type        : <1ef1>
 <1><1ef1>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <1ef2>     DW_AT_prototyped  : 1
  <1ef3>     DW_AT_type        : <176>
  <1ef7>     DW_AT_sibling     : <1f06>
 <2><1efb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1efc>     DW_AT_type        : <1e59>
 <2><1f00>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1f01>     DW_AT_type        : <f28>
 <1><1f06>: Abbrev Number: 2 (DW_TAG_typedef)
  <1f07>     DW_AT_name        : MUSB_pfDmaProgramChannel
  <1f20>     DW_AT_decl_file   : 9
  <1f21>     DW_AT_decl_line   : 178
  <1f22>     DW_AT_type        : <1f26>
 <1><1f26>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1f27>     DW_AT_byte_size   : 4
  <1f28>     DW_AT_type        : <1f2c>
 <1><1f2c>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <1f2d>     DW_AT_prototyped  : 1
  <1f2e>     DW_AT_type        : <176>
  <1f32>     DW_AT_sibling     : <1f50>
 <2><1f36>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1f37>     DW_AT_type        : <1e59>
 <2><1f3b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1f3c>     DW_AT_type        : <185>
 <2><1f40>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1f41>     DW_AT_type        : <176>
 <2><1f45>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1f46>     DW_AT_type        : <667>
 <2><1f4a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1f4b>     DW_AT_type        : <1a4>
 <1><1f50>: Abbrev Number: 2 (DW_TAG_typedef)
  <1f51>     DW_AT_name        : MUSB_pfDmaGetChannelStatus
  <1f6c>     DW_AT_decl_file   : 9
  <1f6d>     DW_AT_decl_line   : 189
  <1f6e>     DW_AT_type        : <1f72>
 <1><1f72>: Abbrev Number: 7 (DW_TAG_pointer_type)
  <1f73>     DW_AT_byte_size   : 4
  <1f74>     DW_AT_type        : <1f78>
 <1><1f78>: Abbrev Number: 9 (DW_TAG_subroutine_type)
  <1f79>     DW_AT_prototyped  : 1
  <1f7a>     DW_AT_type        : <1d1f>
  <1f7e>     DW_AT_sibling     : <1f88>
 <2><1f82>: Abbrev Number: 10 (DW_TAG_formal_parameter)
  <1f83>     DW_AT_type        : <1e59>
 <1><1f88>: Abbrev Number: 2 (DW_TAG_typedef)
  <1f89>     DW_AT_name        : MUSB_pfDmaControllerIsr
  <1fa1>     DW_AT_decl_file   : 9
  <1fa2>     DW_AT_decl_line   : 209
  <1fa3>     DW_AT_type        : <1dd8>
 <1><1fa7>: Abbrev Number: 12 (DW_TAG_structure_type)
  <1fa8>     DW_AT_byte_size   : 40
  <1fa9>     DW_AT_decl_file   : 9
  <1faa>     DW_AT_decl_line   : 230
  <1fab>     DW_AT_sibling     : <20ce>
 <2><1faf>: Abbrev Number: 13 (DW_TAG_member)
  <1fb0>     DW_AT_name        : (indirect string, offset: 0xee): pPrivateData
  <1fb4>     DW_AT_decl_file   : 9
  <1fb5>     DW_AT_decl_line   : 231
  <1fb6>     DW_AT_type        : <f1>
  <1fba>     DW_AT_data_member_location: 2 byte block: 23 0     (DW_OP_plus_uconst: 0)
 <2><1fbd>: Abbrev Number: 14 (DW_TAG_member)
  <1fbe>     DW_AT_name        : pfDmaStartController
  <1fd3>     DW_AT_decl_file   : 9
  <1fd4>     DW_AT_decl_line   : 232
  <1fd5>     DW_AT_type        : <1db7>
  <1fd9>     DW_AT_data_member_location: 2 byte block: 23 4     (DW_OP_plus_uconst: 4)
 <2><1fdc>: Abbrev Number: 14 (DW_TAG_member)
  <1fdd>     DW_AT_name        : pfDmaStopController
  <1ff1>     DW_AT_decl_file   : 9
  <1ff2>     DW_AT_decl_line   : 233
  <1ff3>     DW_AT_type        : <1dee>
  <1ff7>     DW_AT_data_member_location: 2 byte block: 23 8     (DW_OP_plus_uconst: 8)
 <2><1ffa>: Abbrev Number: 14 (DW_TAG_member)
  <1ffb>     DW_AT_name        : pfDmaAllocateChannel
  <2010>     DW_AT_decl_file   : 9
  <2011>     DW_AT_decl_line   : 234
  <2012>     DW_AT_type        : <1e0e>
  <2016>     DW_AT_data_member_location: 2 byte block: 23 c     (DW_OP_plus_uconst: 12)
 <2><2019>: Abbrev Number: 14 (DW_TAG_member)
  <201a>     DW_AT_name        : pfDmaReleaseChannel
  <202e>     DW_AT_decl_file   : 9
  <202f>     DW_AT_decl_line   : 235
  <2030>     DW_AT_type        : <1e5f>
  <2034>     DW_AT_data_member_location: 2 byte block: 23 10    (DW_OP_plus_uconst: 16)
 <2><2037>: Abbrev Number: 14 (DW_TAG_member)
  <2038>     DW_AT_name        : pfDmaAllocateBuffer
  <204c>     DW_AT_decl_file   : 9
  <204d>     DW_AT_decl_line   : 236
  <204e>     DW_AT_type        : <1e91>
  <2052>     DW_AT_data_member_location: 2 byte block: 23 14    (DW_OP_plus_uconst: 20)
 <2><2055>: Abbrev Number: 14 (DW_TAG_member)
  <2056>     DW_AT_name        : pfDmaReleaseBuffer
  <2069>     DW_AT_decl_file   : 9
  <206a>     DW_AT_decl_line   : 237
  <206b>     DW_AT_type        : <1ecc>
  <206f>     DW_AT_data_member_location: 2 byte block: 23 18    (DW_OP_plus_uconst: 24)
 <2><2072>: Abbrev Number: 14 (DW_TAG_member)
  <2073>     DW_AT_name        : pfDmaProgramChannel
  <2087>     DW_AT_decl_file   : 9
  <2088>     DW_AT_decl_line   : 238
  <2089>     DW_AT_type        : <1f06>
  <208d>     DW_AT_data_member_location: 2 byte block: 23 1c    (DW_OP_plus_uconst: 28)
