
#include <fapi/sys_services.h>
#include <fapi/drv_usb_func_msc.h>
#include <fapi/drv_usb_func_vendor.h>
#include "musb/mu_bot.h"
#include "musb/mu_scsi.h"


extern void func_21c0ab7c(void); //drv_ata

#define MUSB_MemAlloc FAPI_SYS_MALLOC
#define MUSB_MemFree FAPI_SYS_FREE
#define MUSB_MemSet musb_memset

typedef struct
{
   uint8_t bmRequestType; //0 ?
   uint8_t bRequest; //1 ?

} MUSB_DeviceRequest;

#define MUSB_TYPE_MASK 0x60
#define MUSB_TYPE_CLASS 0x20


typedef struct
{
   uint8_t bLength; //0
   uint8_t bDescriptorType; //1
   uint16_t bcdUSB; //2
   uint8_t bDeviceClass; //4
   uint8_t bDeviceSubClass; //5
   uint8_t bDeviceProtocol; //6
   uint8_t bMaxPacketSize0; //7
   uint16_t idVendor; //8
   uint16_t idProduct; //10
   uint16_t bcdDevice; //12
   uint8_t iManufacturer; //14
   uint8_t iProduct; //15
   uint8_t iSerialNumber; //16
   uint8_t bNumConfigurations; //17
   //18
} MUSB_DeviceDescriptor;


typedef struct
{
   uint8_t bLength;
   uint8_t bDescriptorType;
   uint16_t bcdUSB;
   uint8_t bDeviceClass;
   uint8_t bDeviceSubClass;
   uint8_t bDeviceProtocol;
   uint8_t bMaxPacketSize0;
   uint8_t bNumConfigurations;
   uint8_t bRESERVED;

} MUSB_QualifierDescriptor;

typedef struct
{
   uint8_t bLength; //0
   uint8_t bDescriptorType; //1
   uint16_t wTotalLength; //2
   uint8_t bNumInterfaces; //4
   uint8_t bConfigurationValue; //5
   uint8_t iConfiguration; //6
   uint8_t bmAttributes; //7
   uint8_t bMaxPower; //8
   //9
} MUSB_ConfigurationDescriptor;

typedef struct
{
   uint8_t bLength; //0
   uint8_t bDescriptorType; //1
   uint8_t bInterfaceNumber; //2
   uint8_t bAlternateSetting; //3
   uint8_t bNumEndpoints; //4
   uint8_t bInterfaceClass; //5
   uint8_t bInterfaceSubClass; //6
   uint8_t bInterfaceProtocol; //7
   uint8_t iInterface; //8
   //9
} MUSB_InterfaceDescriptor;

typedef struct
{
   uint8_t bLength; //0
   uint8_t bDescriptorType; //1
   uint8_t bEndpointAddress; //2
   uint8_t bmAttributes; //3
   uint16_t wMaxPacketSize; //4
   uint8_t bInterval; //6
   //7
} MUSB_EndpointDescriptor;

typedef struct
{
   int fill_0; //0
   uint32_t dCswTag; //4
   uint32_t dCswDataResidue; //8
   uint8_t bCswStatus; //12

} MGC_MsdCsw;

typedef struct
{
   uint32_t dCbwSignature; //0
   uint32_t dCbwTag; //4
   uint32_t dCbwDataTransferLength; //8
   uint8_t bmCbwFlags; //12
   uint8_t bCbwLun; //13
   uint8_t bCbwCbLength; //14
   uint8_t aCbwCb[16]; //15
} MGC_MsdCbw;

extern int32_t MUSB_StartTransfer(MUSB_Irp*);
extern void MUSB_CancelTransfer(MUSB_Irp*);
extern void MUSB_SetPipeHalt(void* hPipe, uint32_t);
extern uint32_t MUSB_GetPipeHalt(void* hPipe);

#define FERR int32_t
#define FBOOL uint32_t
#define FFALSE 0
#define FTRUE 1
#define FALSE 0

#define MUSB_STATUS_OK 0

#define USB_MSC_CONTROL_BUFFER_LENGTH 256

// MODE DATA
#define RBC_MODE_LENGTH        17
#define RBC_MODE_PAGE_CODE   0x06
#define RBC_MODE_PAGE_LENGTH 0x0b
#define RBC_MODE_PAGE_ALL    0x3F
#define RBC_MODE_LENGTH        17

#define RBC_SENSE_ASC_LUN_NOT_SUPPORTED     0x25

#define RBC_INQUIRY_DATA_LEN           0x24


#define EP_BULK_IN  0
#define EP_BULK_OUT 1

#define IRP_DATA_IN  0
#define IRP_DATA_OUT 1
#define IRP_CBW      2
#define IRP_CSW      3

typedef struct
{
    uint8_t  dataLength;              //!< Length of the following data bytes.
    uint8_t  mediumType;              //!< The medium type (always 0 for RBC devices).
    uint8_t  deviceParameter;         //!< The device parameter (always 0 for RBC devices).
    uint8_t  blockDescriptorLength;   //!< The block descriptor length (always 0 for RBC devices).
    uint8_t  pageCode;                //!< The page code (always 0x86 for RBC devices).
    uint8_t  pageLength;              //!< The page length (always 0x0B for this mode page).
    uint8_t  wcd;                     //!< Write cache disable bit.
    uint8_t  blockLengthHighByte;     //!< The high byte of the block size of the logical unit.
    uint8_t  blockLengthLowByte;      //!< The low byte of the block size of the logical unit.
    uint8_t  blockCount[5];           //!< The block capacity of the user data area.
    uint8_t  powerPerformance;        //!< Power vs. performance level.
    uint8_t  flags;                   //!< READ,WRITE,FORMAT and LOCK disable  flags.
    uint8_t  reserved;                //!< A reserved byte.
} FM_USB_MSC_RBC_MODE_S;

typedef struct
{
    uint8_t  responseCode;      //!< Response code (current errors=0x70), plus VALID.
    uint8_t  obsolete;          //!< Not used.
    uint8_t  senseKey; //2         //!< Sense key, plus FILEMARK, EOM, and ILI.
    uint8_t  info_31_24;        //!< Information bit 31 to 24 (LBA for direct-access devices).
    uint8_t  info_23_16;        //!< Information bit 23 to 16 (LBA for direct-access devices).
    uint8_t  info_15_8;         //!< Information bit 15 to  8 (LBA for direct-access devices).
    uint8_t  info_7_0;          //!< Information bit  7 to  0 (LBA for direct-access devices).
    uint8_t  additionalLength;  //!< Length of additional data (everything else from here).
    uint8_t  commandInfo_31_24; //!< Command-specific information (bit 31 to 24).
    uint8_t  commandInfo_23_16; //!< Command-specific information (bit 23 to 16).
    uint8_t  commandInfo_15_8;  //!< Command-specific information (bit 15 to  8).
    uint8_t  commandInfo_7_0;   //!< Command-specific information (bit  7 to  0).
    uint8_t  asc; //12              //!< Additional sense code.
    uint8_t  ascq;              //!< Additional sense code qualifier.
    uint8_t  fruCode;           //!< Field-Replaceable Unit code.
    uint8_t  keyFlags_0;        //!< Sense key specific data plus SKSV.
    uint8_t  keyFlags_1;        //!< Sense key specific data.
    uint8_t  keyFlags_2;        //!< Sense key specific data.
} FM_USB_MSC_RBC_SENSE_S;

typedef struct
{
    FAPI_USB_FUNC_MSC_LunEnumT type; //0
    uint32_t     firstLba; //4    //!< The index of the first logical block of the device.
    uint32_t     lbaCapacity; //8 //!< Total number of logical blocks for the device.
    uint32_t     blockLength; //12 //!< Length of logical block in bytes.
    uint32_t     bufferLength; //16 //!< Length of current data buffer for non-DMA LUN, otherwise 0.
    uint32_t     rwAddr; //20      //!< Read/write address of the device. This is either a RAM-buffer address or the DMA device address.
    FAPI_SYS_HandleT ataHandle; //24       //!< #FTRUE for hardware controlled DMA device otherwise #FFALSE;
    void (*Data_28)(void); //28       //!< #FTRUE if device is ready for data transfer otherwise #FFALSE.
    uint32_t Data_32; //32    //!< #FTRUE if the device is write protected otherwise #FFALSE
    uint8_t bData_36; //36
    uint8_t      inquiryData[RBC_INQUIRY_DATA_LEN]; //37
    //76
} FM_USB_MSC_DEVICE_S;

static void usbMscProcessCbw(MGC_MsdCbw* pCBW);

static void usbMscRbcTestUnitReady(uint8_t lun, uint8_t* pCmd);

static uint8_t cbDeviceRequest( void* pPrivateData,
                           MUSB_BusHandle busHandle,
                           uint32_t sequenceNum,
                           const uint8_t* pRequestData,
                           uint16_t length
                         );
static uint8_t cbDeviceConfigSelected( void* pPrivateData,
                                  MUSB_BusHandle busHandle,
                                  uint8_t configValue,
                                  MUSB_Pipe* pPipes
                                );
static uint8_t cbInterfaceSet( void* pPrivateData,
                          MUSB_BusHandle busHandle,
                          uint8_t interfaceNumber,
                          uint8_t alternateSetting,
